#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x24 (0x24 - 0x0)
// UserDefinedStruct AttributeModifierPatternForSE.AttributeModifierPatternForSE
struct FAttributeModifierPatternForSE
{
public:
	class UClass*                                AttributeClassToModify_2_918A1421494E24A105B8A5A8F607267C; // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                AttributeClassThatFollows_4_8466CDBA412696936C3303890F38060A; // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                AttributeModifierToApply_7_F086E7564AA75494D7F5C088B5EC0C2F; // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                AttributeModifierEventToTrigger_10_CB8AAB2445ED723A6A6069ACE918EA0B; // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ApplyToPlayers_13_3AD8BB524CB38537606515BA4BA669B4; // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         ApplyToEnemies_15_3C9138C346FC091C01E547888C47BCF0; // 0x21(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class EAttributeFollowingModes          FollowingModeWhenEventOn_19_9FB8B3824F99409F2CE79DB273D21734; // 0x22(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EAttributeFollowingModes          FollowingModeWhenEventOff_21_5128E8404CF5B4B2458E9A9AB2896843; // 0x23(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


