#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x88 (0x1E8 - 0x160)
// BlueprintGeneratedClass BodyDamageReactionBruteGrab.BodyDamageReactionBruteGrab_C
class UBodyDamageReactionBruteGrab_C : public UBodyDamageReactionBase_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x160(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                         Detatch_Called;                                    // 0x168(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4CFF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          GrabPull;                                          // 0x170(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          ChosenGrabDamage;                                  // 0x178(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          GrabLoop;                                          // 0x180(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          GrabOutro;                                         // 0x188(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          GrabEscape;                                        // 0x190(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Interrupted;                                       // 0x198(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsAdultBrute;                                      // 0x199(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4D00[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        L_minOutroDuration;                                // 0x19C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBrute_Grab_Verb_C*                    L_grabbingVerb;                                    // 0x1A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EBodyDamageReactionBruteGrabEnum  L_grabState;                                       // 0x1A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4D01[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        EvaluatedActorsForFlyingBodyDamage;                // 0x1B0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                        MinVelocityForTouchDamage;                         // 0x1C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4D02[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                CameraBehaviorClass;                               // 0x1C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  CarrySocket;                                       // 0x1D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseRelativeMeshOffset;                             // 0x1D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsAirborne;                                        // 0x1D9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4D03[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              IntendedEscapeRotation;                            // 0x1DC(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UBodyDamageReactionBruteGrab_C* GetDefaultObj();

	void TickGrabEscape(class UQtnFullBodyStateHitReaction* CallFunc_GetOwningHitReaction_ReturnValue, bool CallFunc_IsTouchingGround_ReturnValue);
	void EndVictimCam(class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue, bool CallFunc_IsValidClass_ReturnValue, class UQtnCameraComponent* CallFunc_GetQtnCameraComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void StartVictimCam(class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue, bool CallFunc_IsValidClass_ReturnValue, class UQtnCameraComponent* CallFunc_GetQtnCameraComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UQtnCameraBehavior* CallFunc_RequestCameraBehavior_ReturnValue);
	void DamageTouchingActors_ServerOnly(const struct FVector& VictimLocation, const TArray<class AActor*>& OverlappingActors, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue, class AActor* CallFunc_Array_Get_Item, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue, const struct FQtnDamageInfo& CallFunc_GetDamageInfo_ReturnValue, int32 CallFunc_Array_AddUnique_ReturnValue, const struct FQtnDamageInfo& K2Node_MakeStruct_QtnDamageInfo, bool CallFunc_ShouldFlyingBodyDamageThisActor_result, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue_1, TArray<class AActor*>& CallFunc_GetOverlappingActors_OverlappingActors, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue);
	void OnDebugDisplay(class UQtnDebugWrapper* DebugWrapper, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class AActor* CallFunc_Array_Get_Item, const class FString& CallFunc_Conv_FloatToString_ReturnValue, bool CallFunc_IsValid_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, const class FString& CallFunc_Conv_BoolToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Conv_BoolToString_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Conv_BoolToString_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_4);
	void SetGrabState(enum class EBodyDamageReactionBruteGrabEnum GrabState, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue_1, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue_1, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue_2, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue_1, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue, float CallFunc_BreakRotator_Roll_1, float CallFunc_BreakRotator_Pitch_1, float CallFunc_BreakRotator_Yaw_1, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue_3, const struct FRotator& CallFunc_MakeRotator_ReturnValue_1, float CallFunc_ApplyKnockback_ReturnValue, const struct FVector& CallFunc_SelectVector_ReturnValue, const struct FRotator& CallFunc_SelectRotator_ReturnValue, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue_4, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue_2, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_3, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_2, bool CallFunc_K2_SetActorRotation_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_3, const struct FHitResult& CallFunc_K2_SetActorLocation_SweepHitResult, bool CallFunc_K2_SetActorLocation_ReturnValue, const struct FQtnPawnMontage& K2Node_MakeStruct_QtnPawnMontage, class UQtnFullBodyStateHitReaction* CallFunc_GetOwningHitReaction_ReturnValue, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue_1, float CallFunc_PlayReactionMontage_ReturnValue, class AQtnFXActor* CallFunc_BP_BeginEffect_ReturnValue, class UQtnFullBodyStateHitReaction* CallFunc_GetOwningHitReaction_ReturnValue_1, const struct FQtnPawnMontage& K2Node_MakeStruct_QtnPawnMontage_1, class UQtnFullBodyStateHitReaction* CallFunc_GetOwningHitReaction_ReturnValue_2, float CallFunc_PlayReactionMontage_ReturnValue_1, const struct FQtnPawnMontage& K2Node_MakeStruct_QtnPawnMontage_2, float CallFunc_FMin_ReturnValue, class UQtnFullBodyStateHitReaction* CallFunc_GetOwningHitReaction_ReturnValue_3, float CallFunc_PlayReactionMontage_ReturnValue_2, class UQtnFullBodyStateHitReaction* CallFunc_GetOwningHitReaction_ReturnValue_4, const struct FQtnPawnMontage& K2Node_MakeStruct_QtnPawnMontage_3, float CallFunc_PlayReactionMontage_ReturnValue_3, class UQtnFullBodyStateHitReaction* CallFunc_GetOwningHitReaction_ReturnValue_5, const struct FQtnPawnMontage& K2Node_MakeStruct_QtnPawnMontage_4, float CallFunc_PlayReactionMontage_ReturnValue_4);
	bool IsReactionFinished(bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void Server_Attach(bool Temp_bool_Variable, const struct FVector& Temp_struct_Variable, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue_1, class ABodyPawnBase_C* K2Node_DynamicCast_AsBody_Pawn_Base, bool K2Node_DynamicCast_bSuccess, const struct FVector& K2Node_Select_Default, const struct FQtnCarrySettings& K2Node_MakeStruct_QtnCarrySettings);
	void HandleOtherDamage(struct FQtnDamageInfo& OtherDamageInfo, struct FQtnHitReactionInfo& OtherReactInfo, bool* AllowNewReaction);
	void DoGrabDamage(class UAnimMontage*& ReactionMontage);
	void DetatchFromGrab(bool Interrupted, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue_1, float CallFunc_ApplyKnockback_ReturnValue, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue_2, class ABodyPawnBase_C* K2Node_DynamicCast_AsBody_Pawn_Base, bool K2Node_DynamicCast_bSuccess, bool CallFunc_HasAuthority_ReturnValue_1);
	void Do_Touch_Damage_Server_Only(class AActor* OtherActor, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const struct FQtnDamageInfo& CallFunc_GetDamageInfo_ReturnValue, bool CallFunc_ShouldFlyingBodyDamageThisActor_result, int32 CallFunc_Array_Add_ReturnValue, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_GetVelocity_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Normal_ReturnValue, float CallFunc_VSize_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, const struct FQtnDamageInfo& K2Node_MakeStruct_QtnDamageInfo, float CallFunc_Divide_FloatFloat_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue);
	void ShouldFlyingBodyDamageThisActor(class AActor*& ActorToEvaluate, class AQtnPawn*& Culprit, bool* Result, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsEnemy_ReturnValue, class AQtnPawn* K2Node_DynamicCast_AsQtn_Pawn, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsHitReactingOrKnockedDown_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void OnEnterReaction(bool IsServer);
	void OnReactionMontageDone(class UAnimMontage* Montage, bool Interrupted);
	void OnExitReaction(bool IsServer);
	void OnTickReaction(float DeltaSeconds);
	void OnTouchOtherActor_Event_0(class AQtnPawn* SelfPawn, class AActor* OtherActor, struct FVector& TouchLocation, struct FVector& TouchNormal);
	void ExecuteUbergraph_BodyDamageReactionBruteGrab(int32 EntryPoint, const struct FQtnDamageInfo& CallFunc_GetDamageInfo_ReturnValue, float K2Node_Event_DeltaSeconds, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue, class UQtnFullBodyStateHitReaction* CallFunc_GetOwningHitReaction_ReturnValue, bool CallFunc_IsTouchingGround_ReturnValue, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue_1, class ABodyPawnBase_C* K2Node_DynamicCast_AsBody_Pawn_Base, bool K2Node_DynamicCast_bSuccess, class AQtnBodyPawn* CallFunc_GetVictimBody_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, class AQtnBodyPawn* CallFunc_GetVictimBody_ReturnValue_1, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue_2, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue_1, bool CallFunc_IsCarrying_ReturnValue, bool CallFunc_IsAliveAndConscious_ReturnValue, bool CallFunc_IsValid_ReturnValue, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue_2, class ABodyPawnAIBrute_C* K2Node_DynamicCast_AsBody_Pawn_AIBrute, bool K2Node_DynamicCast_bSuccess_1, bool K2Node_Event_isServer, class UAnimMontage* K2Node_Event_montage, bool K2Node_Event_interrupted, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue_3, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue_3, class UQtnFullBodyStateHitReaction* CallFunc_GetOwningHitReaction_ReturnValue_1, bool CallFunc_IsCarrying_ReturnValue_1, bool CallFunc_IsMontageFinishPending_ReturnValue, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue_4, bool K2Node_Event_isServer_1, bool CallFunc_IsValid_ReturnValue_1, const struct FQtnDamageInfo& CallFunc_GetDamageInfo_ReturnValue_1, class AQtnBodyPawn* CallFunc_GetVictimBody_ReturnValue_2, class UBrute_Grab_Verb_C* K2Node_DynamicCast_AsBrute_Grab_Verb, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_AcknowledgeGrab_success, bool CallFunc_IsVerbActive_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, class AQtnBodyPawn* CallFunc_GetVictimBody_ReturnValue_3, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_SwitchEnum_CmpSuccess_1, float CallFunc_Subtract_FloatFloat_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue_4, bool CallFunc_HasAuthority_ReturnValue_1, class AQtnPawn* K2Node_CustomEvent_selfPawn, class AActor* K2Node_CustomEvent_otherActor, const struct FVector& K2Node_CustomEvent_touchLocation, const struct FVector& K2Node_CustomEvent_touchNormal, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue_5, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, bool CallFunc_GetButtonMashRatio_isFull, float CallFunc_GetButtonMashRatio_ReturnValue, class AQtnPawn* CallFunc_GetVictimPawn_ReturnValue_6, class AQtnPawn* CallFunc_GetDamagingCulprit_ReturnValue_5, class UQtnVerbComponent* CallFunc_GetVerbComponent_ReturnValue, bool CallFunc_IsPlayerControlled_ReturnValue, bool CallFunc_GetButtonMashRatio_isFull_1, float CallFunc_GetButtonMashRatio_ReturnValue_1);
};

}


