#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xD0 (0x330 - 0x260)
// WidgetBlueprintGeneratedClass BP_Inventory_Grid_Widget.BP_Inventory_Grid_Widget_C
class UBP_Inventory_Grid_Widget_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x260(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                               BORDER_Drawer;                                     // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_LootIcon_C*                        BP_LootIcon_Mulch_1;                               // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_LootIcon_C*                        BP_LootIcon_Mulch_2;                               // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_LootIcon_C*                        BP_LootIcon_Mulch_3;                               // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_LootIcon_C*                        BP_LootIcon_Mulch_4;                               // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_LootIcon_C*                        BP_LootIcon_Mulch_5;                               // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_SideNav_Widget_C*                  BP_SideNav_Widget_80;                              // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_TopNav_Widget_C*                   BP_TopNav_Widget;                                  // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        Hbox_SideNav;                                      // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                            ScrollBox_0;                                       // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              SIZE_Drawer;                                       // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              Size_Grid;                                         // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          VBOX_MulchItems;                                   // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          VBOX_NoItems;                                      // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                              WRAP_Icons;                                        // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                              WRAP_IconsMulch;                                   // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_LootIcon_C*                        Selected_Icon;                                     // 0x2E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Current_Selected_Index;                            // 0x2F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5117[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUserWidget*                           OwningMenu;                                        // 0x2F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EQtn_EquipmentCategory            EquipmentCategory;                                 // 0x300(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HasSubcategory;                                    // 0x301(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5118[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBP_LootIcon_C*                        EquippedIcon;                                      // 0x308(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQtnItemData>                  AllItemData;                                       // 0x310(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UBP_LootIcon_C*>                AllLootIcons;                                      // 0x320(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

	static class UClass* StaticClass();
	static class UBP_Inventory_Grid_Widget_C* GetDefaultObj();

	void GetUnlockData(class UObject* Requester, bool* Locked, class FText* LockText);
	void ScrollInput(float ScrollInput, bool FromStick, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FVector2D& CallFunc_GetDesiredSize_ReturnValue, float CallFunc_GetScrollOffset_ReturnValue, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, float CallFunc_Add_FloatFloat_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue);
	void ShouldAddToList(const struct FQtnItemData& ShouldAdd, bool* ShouldShow, class UQtnGameInstance* CallFunc_GetQtnGameInstance_ReturnValue, class UQtnCombatSettings* CallFunc_GetCombatSettings_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_GetWeaponConfigurationFromWeaponTypeGameplayType_FoundConfiguration, const struct FQtnWeaponConfiguration& CallFunc_GetWeaponConfigurationFromWeaponTypeGameplayType_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_2, bool CallFunc_Not_PreBool_ReturnValue_3, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1);
	void FilterWeaponList(TArray<struct FQtnItemData>& ItemData, enum class EQtn_EquipmentCategory EquipCategory, TArray<struct FQtnItemData>* OutItems, bool WantMelee, const TArray<struct FQtnItemData>& OutArray, bool CallFunc_EqualEqual_ByteByte_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, const struct FQtnItemData& CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class UQtnGameInstance* CallFunc_GetQtnGameInstance_ReturnValue, class UQtnCombatSettings* CallFunc_GetCombatSettings_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, bool CallFunc_GetWeaponConfigurationFromWeaponTypeGameplayType_FoundConfiguration, const struct FQtnWeaponConfiguration& CallFunc_GetWeaponConfigurationFromWeaponTypeGameplayType_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_1);
	void CategoryFilter(enum class EQtnSubCategories Category, class UTopNavTab_Widget_C* SelectedTab, enum class EQtnSubCategories SubCat, const TArray<class UBP_LootIcon_C*>& FilteredIconList, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, bool K2Node_SwitchEnum_CmpSuccess, int32 CallFunc_Add_IntInt_ReturnValue_1, class UBP_LootIcon_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class UBP_LootIcon_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, class UPanelSlot* CallFunc_AddChild_ReturnValue);
	void GetIconFromDrawer(int32 Index, class UBP_LootIcon_C** Icon, class UBP_LootIcon_C* CallFunc_Array_Get_Item, bool CallFunc_Array_IsValidIndex_ReturnValue);
	class FText GetEQtnCategoryText(const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue);
	void Subnav_Check(enum class EQtn_EquipmentCategory EquipmentCategory, bool K2Node_SwitchEnum_CmpSuccess);
	void GetItemDetail(class UBP_LootIcon_C* LootObject, int32 ItemIndex);
	void HandleSelectionItem(class UBP_LootIcon_C* Item_Icon);
	void Populate_Grid(TArray<struct FQtnItemData>& ItemData, TArray<enum class EQtnSubCategories>& Categories);
	void InitInventoryGrid(enum class EQtn_EquipmentCategory EquipmentCategory, class UUserWidget* OwningMenu, TArray<enum class EQtnSubCategories>& Subcategories);
	void HandleLootSelect(class UBP_LootIcon_C* ThisIcon);
	void HandleLootHover(class UBP_LootIcon_C* ThisIcon, bool Hovering);
	void OverrideHeight(float Height, float Width);
	void SetForMediaBrain();
	void GenerateGrid();
	void ExecuteUbergraph_BP_Inventory_Grid_Widget(int32 EntryPoint, TArray<struct FQtnItemData>& K2Node_CustomEvent_ItemData, TArray<enum class EQtnSubCategories>& K2Node_CustomEvent_Categories, enum class EQtn_EquipmentCategory Temp_byte_Variable, class AQtnPlayerController* CallFunc_GetLocalPlayerControllerBP_localPlayerController, enum class EQtnOutputValidityEnum CallFunc_GetLocalPlayerControllerBP_outputPin, bool K2Node_SwitchEnum_CmpSuccess, class UBP_LootIcon_C* CallFunc_Create_ReturnValue, enum class EQtn_EquipmentCategory K2Node_CustomEvent_EquipmentCategory, class UUserWidget* K2Node_CustomEvent_OwningMenu, TArray<enum class EQtnSubCategories>& K2Node_CustomEvent_Subcategories, class UPanelSlot* CallFunc_AddChild_ReturnValue, TArray<struct FQtnItemData>& Temp_struct_Variable, class UBP_LootIcon_C* K2Node_CustomEvent_Item_Icon, class UBP_LootIcon_C* K2Node_Event_LootObject, int32 K2Node_Event_itemIndex, class AQtnPlayerController* CallFunc_GetLocalPlayerControllerBP_localPlayerController_1, enum class EQtnOutputValidityEnum CallFunc_GetLocalPlayerControllerBP_outputPin_1, bool K2Node_SwitchEnum_CmpSuccess_1, class AQtnBodyPawn* CallFunc_GetOriginalBodyPawn_ReturnValue, class UQtnInventoryComponent* CallFunc_GetBodyInventory_ReturnValue, TArray<struct FQtnItemData>& CallFunc_GetVaultWeapons_ReturnValue, TScriptInterface<class IItemUIInterfaces_C> K2Node_DynamicCast_AsItem_UIInterfaces, bool K2Node_DynamicCast_bSuccess, class UBP_LootIcon_C* K2Node_Event_thisIcon_1, class AQtnPlayerController* CallFunc_GetLocalPlayerControllerBP_localPlayerController_2, enum class EQtnOutputValidityEnum CallFunc_GetLocalPlayerControllerBP_outputPin_2, bool CallFunc_IsValid_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_2, class AQtnBodyPawn* CallFunc_GetOccupiedBodyPawn_ReturnValue, class UBP_LootIcon_C* K2Node_Event_thisIcon, bool K2Node_Event_hovering, class UQtnInventoryComponent* CallFunc_GetBodyInventory_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, float K2Node_CustomEvent_height, float K2Node_CustomEvent_width, TScriptInterface<class IItemUIInterfaces_C> K2Node_DynamicCast_AsItem_UIInterfaces_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsValid_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, TScriptInterface<class IItemUIInterfaces_C> K2Node_DynamicCast_AsItem_UIInterfaces_2, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_MatchesTag_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 CallFunc_GetChildIndex_ReturnValue, const struct FQtnItemData& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_ShouldAddToList_shouldShow, TArray<struct FQtnItemData>& Temp_struct_Variable_1, TArray<struct FQtnItemData>& K2Node_Select_Default, bool CallFunc_Array_IsValidIndex_ReturnValue);
};

}


