#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2CA (0x52A - 0x260)
// WidgetBlueprintGeneratedClass BP_LootIcon.BP_LootIcon_C
class UBP_LootIcon_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x260(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      Training;                                          // 0x268(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      HoverAlreadyEquipped;                              // 0x270(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      Hover;                                             // 0x278(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      EquipGlint;                                        // 0x280(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      Unselected;                                        // 0x288(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      SelectedLoop;                                      // 0x290(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                               Border_LootIconBackground;                         // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               Border_Name;                                       // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               BUTTON_Loot;                                       // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                IMAGE_BorderHighlight;                             // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_EquipDogear;                                 // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_Glint;                                       // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                IMAGE_Highlight;                                   // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                LootIcon_Image;                                    // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                        RText_CategoryName;                                // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             Scale;                                             // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              SizeBox_CategoryName;                              // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                          RarityColor;                                       // 0x2F0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MyIndex;                                           // 0x300(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EQtnItemRarity                    Rarity;                                            // 0x304(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_50CD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBP_Inventory_Grid_Widget_C*           MyInventoryGrid;                                   // 0x308(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                           OwningMenu;                                        // 0x310(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Equipped;                                          // 0x318(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_50CE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EquippedBorderPadding;                             // 0x31C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQtnItemData                          MyItemData;                                        // 0x320(0x68)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AItemIconRender_BP_C*                  IconCaptureActor;                                  // 0x388(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQtnBodyPawn*                          PlayerBody;                                        // 0x390(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuEquipment_Widget_C*               MyMenu;                                            // 0x398(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Inventory_Grid_Widget_C*           EquipmentDrawer;                                   // 0x3A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EQtn_EquipmentCategory            EquipmentCategory;                                 // 0x3A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_50CF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Text_Category;                                     // 0x3B0(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                          Rarity_Common;                                     // 0x3C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Rarity_Uncommon;                                   // 0x3D8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Rarity_Rare;                                       // 0x3E8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CategoryIsSelected;                                // 0x3F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsCategory;                                        // 0x3F9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_50D0[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AQtnItem*                              EquippedMelee;                                     // 0x400(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQtnItem*                              EquippedRanged;                                    // 0x408(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsMedia;                                           // 0x410(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_50D1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          Rarity_Legendary;                                  // 0x414(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EQtnSubCategories                 UISubcategory;                                     // 0x424(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AutoUpdateEquipped;                                // 0x425(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_50D2[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnWeaponConfiguration               WeaponConfigurationData;                           // 0x428(0xE0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                          ItemTypeGameplayTag;                               // 0x508(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMenuEquipment_Widget_C*               Equipment_Menu;                                    // 0x510(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            LootButtonHovered;                                 // 0x518(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         Disabled;                                          // 0x528(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         TrainingPulse;                                     // 0x529(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UBP_LootIcon_C* GetDefaultObj();

	void TrainingMomentFinish(class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue);
	void TrainingMomentStart(bool WantedPressed, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, class FText CallFunc_Format_ReturnValue);
	void CheckPowerEquipped(class AQtnPlayerController* CallFunc_GetLocalPlayerControllerBP_localPlayerController, enum class EQtnOutputValidityEnum CallFunc_GetLocalPlayerControllerBP_outputPin, bool K2Node_SwitchEnum_CmpSuccess, class AQtnBodyPawn* CallFunc_GetOccupiedBodyPawn_ReturnValue, class UQtnInventoryComponent* CallFunc_GetBodyInventory_ReturnValue, const struct FQtnItemData& CallFunc_GetPower1ItemData_ReturnValue, const struct FQtnItemData& CallFunc_GetPower2ItemData_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue);
	void GetMediaStatInstancesAndSetUpIcon(const struct FQtnItemData& IncomingPowerItemData, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, const struct FQtnItemStatSettings& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, TSubclassOf<class UQtnVerb> CallFunc_SyncLoadVerbClass_ReturnValue, class UQtnVerb* CallFunc_GetClassDefaultObject_ReturnValue, class UQtnVerb_Archetype_C* K2Node_DynamicCast_AsQtn_Verb_Archetype, bool K2Node_DynamicCast_bSuccess);
	void CheckMediaPlacement();
	void SetMediaCategory();
	void RenderIcon(class AQtnItem* Item, const struct FQtnItemData& Data, bool CallFunc_IsValid_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class AItemIconRender_BP_C* CallFunc_FinishSpawningActor_ReturnValue, class UTextureRenderTarget2D* CallFunc_CreateIconTexture_outTexture);
	void GetRarityColor(const struct FQtnItemData& Data, class UQtnGameInstance* CallFunc_GetQtnGameInstance_ReturnValue, bool CallFunc_GetRarityGameplayTagFromStringCodes_TagFound, const struct FGameplayTag& CallFunc_GetRarityGameplayTagFromStringCodes_ReturnValue, bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue);
	void GetOwningMenu(class UBP_Inventory_Grid_Widget_C* InventoryGrid, class UMenuEquipment_Widget_C* EquipmentMenu, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void InitLootIcon(int32 Index, enum class EQtnItemRarity Rarity, class UBP_Inventory_Grid_Widget_C* InventoryGrid, const struct FQtnItemData& MyItemData, class UMenuEquipment_Widget_C* EquipmentMenu, enum class EQtn_EquipmentCategory EquipmentCategory);
	void BndEvt__BUTTON_Loot_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void LootSelected(bool Selected);
	void LootEquipped(bool Equipped);
	void InitCategoryIcon(class UMenuEquipment_Widget_C* OwningMenu, class UBP_Inventory_Grid_Widget_C* EquipmentDrawer, enum class EQtn_EquipmentCategory Equipment_Category);
	void CategorySelected(bool Selected);
	void UpdateCategoryVisual();
	void BndEvt__BUTTON_Loot_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BUTTON_Loot_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void LimitedInteraction_Powers(bool Limited);
	void RemoteClick();
	void EquipAnim();
	void ButtonHovered(bool AlreadySelected);
	void ButtonUnhovered(bool AlreadySelected);
	void StartTrainingHighlight();
	void UnbindTrainingEvent();
	void PauseTrainingHighlight(class UBP_LootIcon_C* HoveredButton, enum class EQtn_EquipmentCategory Category, bool CategoryHovered);
	void ExecuteUbergraph_BP_LootIcon(int32 EntryPoint, class FText Temp_text_Variable, class FText Temp_text_Variable_1, class FText Temp_text_Variable_2, bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, enum class EQtn_EquipmentCategory Temp_byte_Variable_2, const struct FQtnItemData& Temp_struct_Variable, const struct FQtnItemData& Temp_struct_Variable_1, enum class EQtn_EquipmentCategory Temp_byte_Variable_3, class AQtnItem* Temp_object_Variable, class AQtnItem* Temp_object_Variable_1, bool Temp_bool_Variable_1, enum class EQtn_EquipmentCategory Temp_byte_Variable_4, class AQtnItem* Temp_object_Variable_2, class AQtnItem* Temp_object_Variable_3, enum class EQtn_EquipmentCategory Temp_byte_Variable_5, class AQtnItem* Temp_object_Variable_4, class AQtnItem* Temp_object_Variable_5, enum class EQtn_EquipmentCategory Temp_byte_Variable_6, class AQtnItem* Temp_object_Variable_6, class AQtnItem* Temp_object_Variable_7, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, int32 K2Node_CustomEvent_index, enum class EQtnItemRarity K2Node_CustomEvent_Rarity, class UBP_Inventory_Grid_Widget_C* K2Node_CustomEvent_inventoryGrid, const struct FQtnItemData& K2Node_CustomEvent_myItemData, class UMenuEquipment_Widget_C* K2Node_CustomEvent_EquipmentMenu, enum class EQtn_EquipmentCategory K2Node_CustomEvent_EquipmentCategory, bool K2Node_CustomEvent_Selected_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, class FText Temp_text_Variable_3, bool K2Node_CustomEvent_Equipped, bool CallFunc_IsValid_ReturnValue, TScriptInterface<class IItemUIInterfaces_C> K2Node_DynamicCast_AsItem_UIInterfaces, bool K2Node_DynamicCast_bSuccess, enum class EQtn_EquipmentCategory Temp_byte_Variable_7, enum class EQtnOutputValidityEnum CallFunc_GetLocalPlayerOriginalBody_outputPin, class AQtnBodyPawn* CallFunc_GetLocalPlayerOriginalBody_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_MatchesTag_ReturnValue, bool CallFunc_NotEqual_BoolBool_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_2, class UMenuEquipment_Widget_C* K2Node_CustomEvent_OwningMenu, class UBP_Inventory_Grid_Widget_C* K2Node_CustomEvent_EquipmentDrawer, enum class EQtn_EquipmentCategory K2Node_CustomEvent_Equipment_Category, bool K2Node_CustomEvent_Selected, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_TextIsEmpty_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, bool CallFunc_Not_PreBool_ReturnValue, enum class ESlateVisibility K2Node_Select_Default, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, enum class EQtnOutputValidityEnum CallFunc_GetLocalPlayerOriginalBody_outputPin_1, class AQtnBodyPawn* CallFunc_GetLocalPlayerOriginalBody_ReturnValue_1, class AQtnItem* CallFunc_GetIntendedEquippedWeapons_rangedWeapon, class AQtnItem* CallFunc_GetIntendedEquippedWeapons_meleeWeapon, bool K2Node_SwitchEnum_CmpSuccess_2, TScriptInterface<class IItemUIInterfaces_C> K2Node_DynamicCast_AsItem_UIInterfaces_1, bool K2Node_DynamicCast_bSuccess_1, TScriptInterface<class IItemUIInterfaces_C> K2Node_DynamicCast_AsItem_UIInterfaces_2, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_IsValid_ReturnValue_3, class UAudioComponent* CallFunc_SpawnSound2D_ReturnValue, class UAudioComponent* CallFunc_SpawnSound2D_ReturnValue_1, bool K2Node_CustomEvent_limited, const struct FLinearColor& CallFunc_MakeColor_ReturnValue, const struct FLinearColor& CallFunc_MakeColor_ReturnValue_1, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_1, class UQtnGameInstance* CallFunc_GetQtnGameInstance_ReturnValue, enum class EQtnOutputValidityEnum CallFunc_GetLocalPlayerOriginalBody_outputPin_2, class AQtnBodyPawn* CallFunc_GetLocalPlayerOriginalBody_ReturnValue_2, class UQtnCombatSettings* CallFunc_GetCombatSettings_ReturnValue, class AQtnItem* CallFunc_GetIntendedEquippedWeapons_rangedWeapon_1, class AQtnItem* CallFunc_GetIntendedEquippedWeapons_meleeWeapon_1, bool K2Node_SwitchEnum_CmpSuccess_3, class UObject* CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue, class AQtnItem* CallFunc_GetIntendedEquippedWeapon_ReturnValue, class UTexture2D* K2Node_DynamicCast_AsTexture_2D, bool K2Node_DynamicCast_bSuccess_3, const struct FQtnItemData& CallFunc_GetItemData_ReturnValue, class UClass* CallFunc_SyncLoadClass_ReturnValue, class UClass* K2Node_ClassDynamicCast_AsQtn_Item, bool K2Node_ClassDynamicCast_bSuccess, bool CallFunc_EqualEqual_StrStr_ReturnValue, class AQtnItem* CallFunc_GetItemArchetype_ReturnValue, class ABaseWeapon_C* K2Node_DynamicCast_AsBase_Weapon, bool K2Node_DynamicCast_bSuccess_4, class UTexture2D* CallFunc_GetIconForUI_ReturnValue, class AQtnItem* CallFunc_GetIntendedEquippedWeapon_ReturnValue_1, class UTexture2D* K2Node_Select_Default_1, bool CallFunc_IsValid_ReturnValue_4, const struct FQtnItemData& CallFunc_GetItemData_ReturnValue_1, bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess, bool CallFunc_EqualEqual_StrStr_ReturnValue_1, class UQtnGameInstance* CallFunc_GetQtnGameInstance_ReturnValue_1, const struct FQtnWeaponConfiguration& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_GetItemTypeGameplayTagFromStringCodes_TagFound, const struct FGameplayTag& CallFunc_GetItemTypeGameplayTagFromStringCodes_ReturnValue, bool Temp_bool_Variable_2, class AQtnPlayerController* CallFunc_GetLocalPlayerControllerBP_localPlayerController, enum class EQtnOutputValidityEnum CallFunc_GetLocalPlayerControllerBP_outputPin, bool K2Node_SwitchEnum_CmpSuccess_4, class AQtnBodyPawn* CallFunc_GetOriginalBodyPawn_ReturnValue, bool K2Node_CustomEvent_AlreadySelected_1, bool K2Node_CustomEvent_AlreadySelected, class UWidgetAnimation* K2Node_Select_Default_2, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_3, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_2, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_3, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_4, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_5, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_6, class UBP_LootIcon_C* K2Node_CustomEvent_HoveredButton, enum class EQtn_EquipmentCategory K2Node_CustomEvent_Category, bool K2Node_CustomEvent_CategoryHovered, bool CallFunc_Not_PreBool_ReturnValue_1, float CallFunc_GetGameTimeInSeconds_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_2, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Sin_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_7, class FText K2Node_Select_Default_3, class AQtnItem* K2Node_Select_Default_4, enum class EQtnOutputValidityEnum CallFunc_GetLocalPlayerOccupiedBody_outputPin, class AQtnBodyPawn* CallFunc_GetLocalPlayerOccupiedBody_ReturnValue, class UTexture2D* CallFunc_GetIconForUI_ReturnValue_1, class UQtnInventoryComponent* CallFunc_GetBodyInventory_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_5, const struct FQtnItemData& CallFunc_GetPower2ItemData_ReturnValue, const struct FQtnItemData& CallFunc_GetPower1ItemData_ReturnValue, const struct FQtnItemData& K2Node_Select_Default_5, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_8, bool CallFunc_IsVisible_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_6, class AQtnItem* K2Node_Select_Default_6, class AQtnItem* K2Node_Select_Default_7, bool CallFunc_IsValid_ReturnValue_5, class AQtnItem* K2Node_Select_Default_8, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_9, enum class EQtnOutputYesNoEnum CallFunc_IsObjectOfType_outputPin, bool K2Node_SwitchEnum_CmpSuccess_7);
	void LootButtonHovered__DelegateSignature(class UBP_LootIcon_C* HoveredButton, enum class EQtn_EquipmentCategory Category, bool CategoryHovered);
};

}


