#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x56 (0x56 - 0x0)
// UserDefinedStruct CinematicShot_Struct.CinematicShot_Struct
struct FCinematicShot_Struct
{
public:
	class UClass*                                Actor_10_1776976D434E7E860C34B5B7C0A0A482;         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ShotTImeOverride_6_9E8E5D934D6AF1191FFB499E9F401960; // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_31C8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTribunal_CharacterResponse           CharacterAction_9_75621D4E4AEA6195428EF69764448A92; // 0x10(0x35)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_31C9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         ShouldCut_12_E99E2F0349A03693C35A8D9F39C9CAE8;     // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_31CA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ShotNum_17_1EDAC3FA4454752E5C8457B10E508C2C;       // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        InsertNum_18_1AF4075D405AEFDFEAC7EF964A986EF2;     // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AutoManageVideoCall_20_D82B27DD4C223890553436898083B191; // 0x54(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         SkipVideoTransition_22_78E45949416AB28908AB54863843BE01; // 0x55(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}


