#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x104 (0x384 - 0x280)
// WidgetBlueprintGeneratedClass DamageNumberWidgetArchetype.DamageNumberWidgetArchetype_C
class UDamageNumberWidgetArchetype_C : public UQtnDamageNumberWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x280(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      FadeInOut_Text;                                    // 0x288(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      FadeInOut_Numbers_Thrust;                          // 0x290(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      FadeInOut_Numbers;                                 // 0x298(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      FadeInOut_Icon;                                    // 0x2A0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      FadeInOut;                                         // 0x2A8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                          CanvasPanel_OffsetBox;                             // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          CanvasPanel_Root;                                  // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                IMG_Icon;                                          // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TextBlock_TextDisplay;                             // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDamageNumberWidgetComponent_C*        OwningComponent;                                   // 0x2D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               ParentOffset;                                      // 0x2D8(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HorizontalTravel;                                  // 0x2E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                        Delta;                                             // 0x2E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1BC6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           VerticalTravelCurve;                               // 0x2F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                           HorizontalTravelCurve;                             // 0x2F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                           ScaleCurve;                                        // 0x300(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Alpha01;                                           // 0x308(0x4)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1BC7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UQtnDamageType>            Incoming_Damage_Type;                              // 0x310(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	enum class EQtnAttackMotion                  Incoming_Attack_Motion;                            // 0x318(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1BC8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Vertical_Travel;                                   // 0x31C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IncreasedDamage;                                   // 0x320(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1BCA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DamageDifference;                                  // 0x324(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HasDamageInfo;                                     // 0x328(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1BCC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UWidgetAnimation*                      WidgetAnimation;                                   // 0x330(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               Target_Location;                                   // 0x338(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1BCD[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnDamageNumberOptionalInfo          Optional_Data;                                     // 0x348(0x38)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)
	float                                        MaxDistanceToCamera;                               // 0x380(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UDamageNumberWidgetArchetype_C* GetDefaultObj();

	void SetFont(class FText InText, const struct FGameplayTag& OptionalContext, const struct FLinearColor& Color, bool LOCAL_Healing, const struct FLinearColor& LOCAL_Color, const struct FSlateColor& K2Node_MakeStruct_SlateColor, bool CallFunc_MatchesTag_ReturnValue, const struct FLinearColor& Temp_struct_Variable, const struct FLinearColor& Temp_struct_Variable_1, bool Temp_bool_Variable, const struct FLinearColor& K2Node_Select_Default, const struct FLinearColor& CallFunc_Multiply_LinearColorLinearColor_ReturnValue, const struct FFontOutlineSettings& K2Node_MakeStruct_FontOutlineSettings, const struct FSlateFontInfo& K2Node_MakeStruct_SlateFontInfo);
	void ScaleTextFontSize(class UTextBlock* Text, float CallFunc_GetTextShadowOffsetScaleRate_ScaleRate, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_FMin_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, float CallFunc_GetTextScaleRate_ScaleRate, float CallFunc_FMin_ReturnValue_1, float CallFunc_Multiply_IntFloat_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, int32 CallFunc_FFloor_ReturnValue, const struct FFontOutlineSettings& K2Node_MakeStruct_FontOutlineSettings, class UQtnDamageNumbersSubsystem* CallFunc_GetWorldSubsystem_ReturnValue, float CallFunc_GetTextScaleRate_ScaleRate_1, bool CallFunc_IsOldDamageNumberSystem_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_2, int32 CallFunc_FTrunc_ReturnValue, const struct FSlateFontInfo& K2Node_MakeStruct_SlateFontInfo);
	void GetTextShadowOffsetScaleRate(float* ScaleRate, float LOCAL_DistanceToCameraForOffset, class APlayerCameraManager* CallFunc_GetPlayerCameraManager_ReturnValue, const struct FVector& CallFunc_GetCameraLocation_ReturnValue, float CallFunc_Vector_Distance2D_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_FClamp_ReturnValue);
	void GetTextScaleRate(float* ScaleRate, class APlayerCameraManager* CallFunc_GetPlayerCameraManager_ReturnValue, const struct FVector& CallFunc_GetCameraLocation_ReturnValue, float CallFunc_Vector_Distance2D_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_FClamp_ReturnValue);
	void Set_Damage_Info_Variables(const struct FQtnDamageInfo& Damage_Info, class UQtnDamageType* CallFunc_GetDamageArchetype_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue);
	void SetWidgetAnimation(bool Temp_bool_Variable, enum class EQtnAttackMotion Temp_byte_Variable, class UWidgetAnimation* K2Node_Select_Default, class UWidgetAnimation* K2Node_Select_Default_1);
	void SetTransitionDistances(bool Temp_bool_Variable, float Temp_float_Variable, bool Temp_bool_Variable_1, float Temp_float_Variable_1, bool Temp_bool_Variable_2, enum class EQtnAttackMotion Temp_byte_Variable, float Temp_float_Variable_2, float Temp_float_Variable_3, float Temp_float_Variable_4, float Temp_float_Variable_5, float Temp_float_Variable_6, float Temp_float_Variable_7, float Temp_float_Variable_8, enum class EQtnAttackMotion Temp_byte_Variable_1, float CallFunc_RandomFloatInRange_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue_1, bool CallFunc_RandomBool_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue_2, float K2Node_Select_Default, float CallFunc_Multiply_FloatFloat_ReturnValue, float K2Node_Select_Default_1, float K2Node_Select_Default_2, float CallFunc_RandomFloatInRange_ReturnValue_3, float CallFunc_RandomFloatInRange_ReturnValue_4, float K2Node_Select_Default_3, float K2Node_Select_Default_4);
	void SetTransitionCurves(enum class EQtnAttackMotion Temp_byte_Variable, class UCurveFloat* Temp_object_Variable, class UCurveFloat* Temp_object_Variable_1, class UCurveFloat* Temp_object_Variable_2, class UCurveFloat* Temp_object_Variable_3, class UCurveFloat* Temp_object_Variable_4, class UCurveFloat* Temp_object_Variable_5, class UCurveFloat* Temp_object_Variable_6, enum class EQtnAttackMotion Temp_byte_Variable_1, class UCurveFloat* Temp_object_Variable_7, class UCurveFloat* Temp_object_Variable_8, class UCurveFloat* Temp_object_Variable_9, class UCurveFloat* Temp_object_Variable_10, class UCurveFloat* Temp_object_Variable_11, class UCurveFloat* Temp_object_Variable_12, class UCurveFloat* Temp_object_Variable_13, class UCurveFloat* K2Node_Select_Default, class UCurveFloat* K2Node_Select_Default_1);
	void SetOwningComponent(class UDamageNumberWidgetComponent_C* InOwner, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue);
	void Finished_973AD4024AD367B6DDCE31B05D9276F0();
	void Finished_B50ADEBA4731DD741F35FC8568B01016();
	void OnStartFromMaterialEvent(class AActor* Target, class UMaterialInterface* Material, struct FQtnDamageNumberOptionalInfo& OptionalData, struct FVector& WorldLocation);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnStartFromTextEvent(class AActor* Target, class FText& TextToDisplay, struct FQtnDamageNumberOptionalInfo& OptionalData, struct FVector& WorldLocation);
	void OnStartFromDamageInfoEvent(class AActor* Target, struct FQtnDamageInfo& DamageInfo, struct FQtnDamageNumberOptionalInfo& OptionalData, struct FVector& WorldLocation);
	void ExecuteUbergraph_DamageNumberWidgetArchetype(int32 EntryPoint, float Temp_float_Variable, class UQtnDamageNumbersSubsystem* CallFunc_GetWorldSubsystem_ReturnValue, bool CallFunc_IsOldDamageNumberSystem_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class AActor* K2Node_Event_Target_2, class UMaterialInterface* K2Node_Event_Material, const struct FQtnDamageNumberOptionalInfo& K2Node_Event_OptionalData_2, const struct FVector& K2Node_Event_WorldLocation_2, float CallFunc_RandomFloatInRange_ReturnValue, bool CallFunc_RandomBool_ReturnValue, float CallFunc_SelectFloat_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, float CallFunc_Multiply_FloatFloat_ReturnValue, class UUMGSequencePlayer* CallFunc_CreatePlayAnimationProxyObject_Result, class UWidgetAnimationPlayCallbackProxy* CallFunc_CreatePlayAnimationProxyObject_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FLinearColor& CallFunc_Conv_ColorToLinearColor_ReturnValue, float CallFunc_GetFloatValue_ReturnValue, float CallFunc_MapRangeClamped_ReturnValue, float CallFunc_MapRangeClamped_ReturnValue_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, float CallFunc_GetEndTime_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_FClamp_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, float Temp_float_Variable_1, bool Temp_bool_Variable, float K2Node_Select_Default, float CallFunc_GetTextScaleRate_ScaleRate, bool K2Node_Event_IsDesignTime, float CallFunc_Divide_FloatFloat_ReturnValue_1, float CallFunc_SelectFloat_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue_2, const struct FFontOutlineSettings& K2Node_MakeStruct_FontOutlineSettings, const struct FSlateFontInfo& K2Node_MakeStruct_SlateFontInfo, class UUMGSequencePlayer* CallFunc_CreatePlayAnimationProxyObject_Result_1, class UWidgetAnimationPlayCallbackProxy* CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, class AActor* K2Node_Event_Target_1, class FText K2Node_Event_TextToDisplay, const struct FQtnDamageNumberOptionalInfo& K2Node_Event_OptionalData_1, const struct FVector& K2Node_Event_WorldLocation_1, float CallFunc_Add_FloatFloat_ReturnValue, class AActor* K2Node_Event_Target, const struct FQtnDamageInfo& K2Node_Event_DamageInfo, const struct FQtnDamageNumberOptionalInfo& K2Node_Event_OptionalData, const struct FVector& K2Node_Event_WorldLocation, int32 CallFunc_Round_ReturnValue, float CallFunc_GetFloatValue_ReturnValue_1, class FText CallFunc_Conv_IntToText_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_3, float CallFunc_Multiply_FloatFloat_ReturnValue_4, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1);
};

}


