#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1C1 (0x459 - 0x298)
// WidgetBlueprintGeneratedClass GlobalNav_Widget.GlobalNav_Widget_C
class UGlobalNav_Widget_C : public UQtnUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x298(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      AnimLoadMenu;                                      // 0x2A0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAffordance_Widget_C*                  Affordance1_Widget;                                // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAffordance_Widget_C*                  Affordance2_Widget;                                // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAffordance_Widget_C*                  Affordance3_Widget;                                // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAffordance_Widget_C*                  Affordance_Close;                                  // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAffordance_Widget_C*                  AffordanceLeft_Widget;                             // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAffordance_Widget_C*                  AffordanceRight_Widget;                            // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               Border_TopNav;                                     // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URewardsCurrency_Widget_C*             Currency_DM;                                       // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCurrencyWallet_Widget_C*              CurrencyWallet_Widget;                             // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGlobalNavButton_Widget_C*             GM_Cosmetics_BPW;                                  // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGlobalNavButton_Widget_C*             GM_DarkMatterPerks_BPW;                            // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGlobalNavButton_Widget_C*             GM_Ironwright_BPW;                                 // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGlobalNavButton_Widget_C*             GM_Matchmaking_BPW;                                // 0x308(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGlobalNavButton_Widget_C*             GM_Unlocks_BPW;                                    // 0x310(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGlobalNavButton_Widget_C*             GM_UpgradeSummary_BPW;                             // 0x318(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        HBOX_BottomAffordance;                             // 0x320(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_BackgroundBottom;                            // 0x328(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_BackgroundTop;                               // 0x330(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                        CurrentCategoryIndex;                              // 0x338(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5619[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<int32, class UClass*>                   IndexMenuWidgetClassMap;                           // 0x340(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                GlobalNavButton;                                   // 0x390(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAffordance_Widget_C*>          AffordanceArray;                                   // 0x398(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class FString, class FText>             CurrentAffordances;                                // 0x3A8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABodyPawnPlayer_C*                     MyBody;                                            // 0x3F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                        MenuLoadCurrentTime;                               // 0x400(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_561A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                PerkVOActor;                                       // 0x408(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          PerkIdleTimer;                                     // 0x410(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         ActiveMenuInTrainingMoment;                        // 0x418(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_561B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                ArmoryVOActor;                                     // 0x420(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                GlobalArmoryVOActor;                               // 0x428(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFTUXDataBag_C*                        FTUXDataBag;                                       // 0x430(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionDataBag_C*                     RunProgDataBag;                                    // 0x438(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         GlobalNavDisabled;                                 // 0x440(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_561C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UObject*>                       RequestedInputBlockers;                            // 0x448(0x10)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	bool                                         IsInputBlockRequested;                             // 0x458(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UGlobalNav_Widget_C* GetDefaultObj();

	void RequestCurrencyVisibilities(bool* ShowTP, bool* ShowDM, bool* ShowPP);
	void SequenceEvent__ENTRYPOINTGlobalNav_Widget_0();
	void GetGateTimerWidget(class UBP_GateTimer_Widget_C** BP_GateTimer_Widget, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue, class UMessagingHUDScreen_C* CallFunc_GetScreen_ReturnValue, class UMessagingHUD_C* CallFunc_GetUserWidget_ReturnValue);
	void IsGlobalNavInputBlocked_(bool* IsBlocked_, class UObject* Temp_object_Variable, bool CallFunc_Array_RemoveItem_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);
	void RemoveGlobalNavInputBlocker(class UObject* RequesterUnblock, class UObject* Temp_object_Variable, bool CallFunc_Array_RemoveItem_ReturnValue, bool CallFunc_Array_RemoveItem_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);
	void AddGlobalNavInputBlocker(class UObject* RequestingObject, class UObject* Temp_object_Variable, int32 CallFunc_Array_AddUnique_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Array_RemoveItem_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);
	void RefreshWalletVisibility();
	void SetIsDisabled(bool SetTo, bool Temp_bool_Variable, const struct FLinearColor& K2Node_MakeStruct_LinearColor, const struct FLinearColor& K2Node_MakeStruct_LinearColor_1, const struct FLinearColor& K2Node_Select_Default);
	void CheckForRequiredDataBag(class UClass* Class, class UQtnDataBag* DataBagPtr, bool* HasDataBag, class UQtnDataBag** DataBag, bool CallFunc_IsValid_ReturnValue, class AQtnPlayerController* CallFunc_GetLocalPlayerControllerBP_localPlayerController, enum class EQtnOutputValidityEnum CallFunc_GetLocalPlayerControllerBP_outputPin, class UQtnLocalOptionsSaveData* CallFunc_GetSaveLoadDataBP_localOptionsSaveData, class UQtnCloudOptionsSaveData* CallFunc_GetSaveLoadDataBP_cloudOptionsSaveData, class UQtnProgressSaveData* CallFunc_GetSaveLoadDataBP_progressSaveData, enum class EQtnOutputValidityEnum CallFunc_GetSaveLoadDataBP_outputPin, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_SwitchEnum_CmpSuccess_1, class UQtnDataBag* CallFunc_GetCustomDataBag_ReturnValue);
	void UnregisterArmoryVOActor();
	void RegisterArmoryVOActor(class AActor* NewArmoryVOActor, class AActor* GlobalArmoryVOActor);
	void CheckForTrainingMoment(class UUserWidget* RequestingMenu, bool* InTrainingMoment, class UUserWidget* LOCAL_RequestingMenu, class UClass* CallFunc_GetObjectClass_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue_1, class UMenu_DarkMatterPerks_C* K2Node_DynamicCast_AsMenu_Dark_Matter_Perks, bool K2Node_DynamicCast_bSuccess, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_GetDisplayName_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, const class FString& CallFunc_Concat_StrStr_ReturnValue_5, class UMenuMatchmaking_Widget_C* K2Node_DynamicCast_AsMenu_Matchmaking_Widget, bool K2Node_DynamicCast_bSuccess_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_6, const class FString& CallFunc_GetDisplayName_ReturnValue_3, const class FString& CallFunc_GetDisplayName_ReturnValue_4, const class FString& CallFunc_GetDisplayName_ReturnValue_5, class UMenuEquipment_Widget_C* K2Node_DynamicCast_AsMenu_Equipment_Widget, bool K2Node_DynamicCast_bSuccess_2, const class FString& CallFunc_GetDisplayName_ReturnValue_6, bool CallFunc_BooleanOR_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue_7, const class FString& CallFunc_Concat_StrStr_ReturnValue_7, const class FString& CallFunc_Concat_StrStr_ReturnValue_8, class UClass* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_9, const class FString& CallFunc_Concat_StrStr_ReturnValue_10, bool CallFunc_EqualEqual_ClassClass_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_11, const class FString& CallFunc_Concat_StrStr_ReturnValue_12, const class FString& CallFunc_Concat_StrStr_ReturnValue_13, const class FString& CallFunc_Concat_StrStr_ReturnValue_14, const class FString& CallFunc_GetDisplayName_ReturnValue_8, const class FString& CallFunc_Concat_StrStr_ReturnValue_15, const class FString& CallFunc_GetDisplayName_ReturnValue_9, const class FString& CallFunc_Concat_StrStr_ReturnValue_16, const class FString& CallFunc_Concat_StrStr_ReturnValue_17, const class FString& CallFunc_Concat_StrStr_ReturnValue_18, const class FString& CallFunc_Concat_StrStr_ReturnValue_19, const class FString& CallFunc_Concat_StrStr_ReturnValue_20, const class FString& CallFunc_Concat_StrStr_ReturnValue_21, const class FString& CallFunc_Concat_StrStr_ReturnValue_22, const class FString& CallFunc_Concat_StrStr_ReturnValue_23, const class FString& CallFunc_Concat_StrStr_ReturnValue_24, const class FString& CallFunc_Concat_StrStr_ReturnValue_25, const class FString& CallFunc_Concat_StrStr_ReturnValue_26, const class FString& CallFunc_Concat_StrStr_ReturnValue_27, const class FString& CallFunc_Concat_StrStr_ReturnValue_28, bool K2Node_SwitchInteger_CmpSuccess, bool CallFunc_CheckIfMapIsAMissionWorld__MissionWorld);
	void OnDebugDisplay(class UQtnDebugWrapper* DebugWrapper, const class FString& CallFunc_Conv_FloatToString_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1);
	void TrainingMoment_NotifyPowerTrainingAccessSource(class UWidget* Widget, class UMenuEquipment_Widget_C* K2Node_DynamicCast_AsMenu_Equipment_Widget, bool K2Node_DynamicCast_bSuccess);
	void CanPlayPerkVO(bool* CanPlay, enum class EQtnTutorialStatus CallFunc_GetTutorialState_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_CheckForRequiredDataBag_HasDataBag, class UQtnDataBag* CallFunc_CheckForRequiredDataBag_DataBag, class UFTUXDataBag_C* K2Node_DynamicCast_AsFTUXData_Bag, bool K2Node_DynamicCast_bSuccess);
	void DispatchPerkVOEvent(const struct FGameplayTag& EventType, float Scale, bool CallFunc_CheckForRequiredDataBag_HasDataBag, class UQtnDataBag* CallFunc_CheckForRequiredDataBag_DataBag, bool CallFunc_CanPlayPerkVO_canPlay, class UMissionDataBag_C* K2Node_DynamicCast_AsMission_Data_Bag, bool K2Node_DynamicCast_bSuccess, bool CallFunc_MakeLiteralBool_ReturnValue, const struct FQtnEventMessage& CallFunc_StaticMakeEventMessage_ReturnValue);
	void UnregisterPerkVOActor();
	void RegisterPerkVOActor(class AActor* NewPerkVOActor);
	void Find_Unlocked_Category(int32 StartingCategory, bool GoBackwards, int32* UnlockedIndex, bool* Success, int32 LastIndex, int32 NumAttemptsRemaining, bool GoingBackwards, bool FoundSomething, int32 WorkingIndex, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 CallFunc_QtnWrapInt_ReturnValue, bool CallFunc_IsCategoryUnlocked_isUnlocked, int32 CallFunc_QtnWrapInt_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Map_Length_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool CallFunc_IsCategoryUnlocked_isUnlocked_1);
	void IsCategoryUnlocked(int32 CategoryIndex, bool* IsUnlocked, bool Result, class FName CallFunc_MakeLiteralName_ReturnValue, bool K2Node_SwitchInteger_CmpSuccess, bool CallFunc_GetTutorialBoolValue_ReturnValue, bool CallFunc_CheckIfMapIsAMissionWorld__MissionWorld, enum class EQtnTutorialStatus CallFunc_GetTutorialState_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class FName CallFunc_MakeLiteralName_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_GetTutorialBoolValue_ReturnValue_1, enum class EQtnTutorialStatus CallFunc_GetTutorialState_ReturnValue_1, class FName CallFunc_MakeLiteralName_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_GetTutorialBoolValue_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_1, enum class EQtnTutorialStatus CallFunc_GetTutorialState_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, int32 CallFunc_GetCurrentArc_CurrentArc, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_CheckForRequiredDataBag_HasDataBag, class UQtnDataBag* CallFunc_CheckForRequiredDataBag_DataBag, bool CallFunc_BooleanAND_ReturnValue, class UMissionDataBag_C* K2Node_DynamicCast_AsMission_Data_Bag, bool K2Node_DynamicCast_bSuccess, bool CallFunc_CheckForRequiredDataBag_HasDataBag_1, class UQtnDataBag* CallFunc_CheckForRequiredDataBag_DataBag_1, class UFTUXDataBag_C* K2Node_DynamicCast_AsFTUXData_Bag, bool K2Node_DynamicCast_bSuccess_1, TArray<class AQtnPlayerPawn*>& CallFunc_GetAllPlayerPawns_foundPlayerPawns, bool CallFunc_CheckIfMapIsAMissionWorld__MissionWorld_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue_1, bool CallFunc_CheckIfMapIsAMissionWorld__MissionWorld_2, bool CallFunc_BooleanOR_ReturnValue_4);
	void UpdateBottomAffordance(const TArray<class UWidget*>& AffordanceWidgets, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, class UWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, class UAffordance_Widget_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Add_IntInt_ReturnValue_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, TArray<class FString>& CallFunc_Map_Keys_Keys, const class FString& CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_1, class FText CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, class FText CallFunc_Conv_StringToText_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_2);
	void UpdateLocalAffordance(bool IsUsingMouseKB, bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, enum class ESlateVisibility K2Node_Select_Default);
	void Update_All_Global_Nav_Buttons(class UUserWidget* RequestingMenu, const TArray<class UGlobalNavButton_Widget_C*>& ButtonArray, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_CheckForTrainingMoment_InTrainingMoment, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, bool CallFunc_CheckIfMapIsAMissionWorld__MissionWorld, class UGlobalNavButton_Widget_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, bool CallFunc_IsCategoryUnlocked_isUnlocked, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue_2, int32 CallFunc_Array_Add_ReturnValue_3, int32 CallFunc_Array_Add_ReturnValue_4, int32 CallFunc_Array_Add_ReturnValue_5);
	void CheckIfMapIsAMissionWorld_(bool* MissionWorld, bool MapIsMissionWorld, enum class EQtnOutputYesNoEnum CallFunc_IsThisMapAMissionWorldBP_outputPin, bool K2Node_SwitchEnum_CmpSuccess);
	void RequestAffordance();
	void LoadRepeater();
	void Anim_MenuOpen();
	void Anim_MenuClose();
	void OnQtnWidgetResumed(class UQtnScreen* PreviousScreen);
	void OnUIScreenActionPressed(enum class EQtnUIScreenActionEnum ScreenAction);
	void CloseMenu();
	void Event_ShowMenu(int32 CurrentIndex);
	void Event_CycleMenu(int32 NewIndex);
	void InputChange(bool IsUsingMouseAndKeyboard);
	void UpdateGlobalNavAffordances(TMap<class FString, class FText> Affordances, class UClass* MyClass);
	void OnQtnWidgetInitialized();
	void ResetPerkIdleTimer();
	void OnPerkIdleTimer();
	void OnCurrencyChangedEvent();
	void SetupCurrencyVisibilities_1(bool ShowTP, bool ShowDM, bool ShowPP);
	void ExecuteUbergraph_GlobalNav_Widget(int32 EntryPoint, bool CallFunc_IsAnimationPlayingForward_ReturnValue, float CallFunc_GetAnimationCurrentTime_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue, class UQtnScreen* K2Node_Event_previousScreen, enum class EQtnUIScreenActionEnum K2Node_Event_screenAction, bool K2Node_SwitchEnum_CmpSuccess, class UQtnScreen* CallFunc_GetOwningScreen_ReturnValue, int32 K2Node_CustomEvent_CurrentIndex, bool CallFunc_CheckIfMapIsAMissionWorld__MissionWorld, TSubclassOf<class UUserWidget> Temp_class_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Find_Unlocked_Category_unlockedIndex, bool CallFunc_Find_Unlocked_Category_success, class UQtnScreen* CallFunc_GetOwningScreen_ReturnValue_1, class UQtnScreen* CallFunc_GetOwningScreen_ReturnValue_2, class UQtnScreen* CallFunc_GetOwningScreen_ReturnValue_3, class UGlobalNav_Widget_C* CallFunc_ShowUserWidget_ReturnValue, int32 K2Node_CustomEvent_NewIndex, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, class UClass* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class UUserWidget* CallFunc_HideUserWidget_ReturnValue, int32 Temp_int_Variable, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool K2Node_CustomEvent_isUsingMouseAndKeyboard, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Find_Unlocked_Category_unlockedIndex_1, bool CallFunc_Find_Unlocked_Category_success_1, TMap<class FString, class FText> K2Node_Event_Affordances, class UClass* K2Node_Event_myClass, class UClass* CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, bool CallFunc_EqualEqual_ClassClass_ReturnValue, TArray<class UAffordance_Widget_C*>& K2Node_MakeArray_Array, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue_1, class AQtnPlayerUIArchetype_C* K2Node_DynamicCast_AsQtn_Player_UIArchetype, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsUsingMouseAndKeyboard_ReturnValue, class AQtnBodyPawn* CallFunc_GetOccupiedBodyPawn_ReturnValue, class ABodyPawnPlayer_C* K2Node_DynamicCast_AsBody_Pawn_Player, bool K2Node_DynamicCast_bSuccess_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, int32 CallFunc_Find_Unlocked_Category_unlockedIndex_2, bool CallFunc_Find_Unlocked_Category_success_2, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, bool CallFunc_IsValid_ReturnValue_3, TSubclassOf<class UUserWidget> Temp_class_Variable_1, bool CallFunc_MakeLiteralBool_ReturnValue, bool Temp_bool_Variable, const struct FQtnEventMessage& CallFunc_StaticMakeEventMessage_ReturnValue, TSubclassOf<class UUserWidget> K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue_4, const struct FGameplayTag& CallFunc_MakeLiteralGameplayTag_ReturnValue, int32 CallFunc_GetCurrencyQuantity_ReturnValue, const struct FQtnCurrencyEntry& K2Node_MakeStruct_QtnCurrencyEntry, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, class UClass* CallFunc_Map_Find_Value_2, bool CallFunc_Map_Find_ReturnValue_2, bool K2Node_Event_ShowTP, bool K2Node_Event_ShowDM, bool K2Node_Event_ShowPP, class UUserWidget* CallFunc_ShowUserWidget_ReturnValue_1, TScriptInterface<class IGlobalNavAffordance_Interface_C> K2Node_DynamicCast_AsGlobal_Nav_Affordance_Interface, bool K2Node_DynamicCast_bSuccess_2, TScriptInterface<class IGlobalNavWallet_BPI_C> K2Node_DynamicCast_AsGlobal_Nav_Wallet_BPI, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_RequestCurrencyVisibilities_ShowTP, bool CallFunc_RequestCurrencyVisibilities_ShowDM, bool CallFunc_RequestCurrencyVisibilities_ShowPP, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue_2, class AQtnPlayerUIArchetype_C* K2Node_DynamicCast_AsQtn_Player_UIArchetype_1, bool K2Node_DynamicCast_bSuccess_4, enum class EQtnTutorialStatus CallFunc_GetTutorialState_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, bool CallFunc_IsGlobalNavInputBlocked__IsBlocked_);
};

}


