#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2D2 (0x56A - 0x298)
// WidgetBlueprintGeneratedClass GoalHUD.GoalHUD_C
class UGoalHUD_C : public UQtnUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x298(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      FadeObjectiveUI;                                   // 0x2A0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      AddBackdrop;                                       // 0x2A8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      GoalAnnounce_Out;                                  // 0x2B0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      GoalAnnounce_In;                                   // 0x2B8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBossHealth_Widget_C*                  BossHealth_Widget;                                 // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_GoalsWidget_C*                     BP_GoalsWidget;                                    // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          CanvasPanel_NavMarkers;                            // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNotificationEnemyBullshit_Widget_C*   EnemyBullshit1_Widget;                             // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNotificationEnemyBullshit_Widget_C*   EnemyBullshit2_Widget;                             // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNotificationEnemyBullshit_Widget_C*   EnemyBullshitRevealCard_Widget_81;                 // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        Hbox_ObjectiveAnnounce;                            // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_BackdropTint;                                // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNotificationCard_Widget_C*            NotificationCard_Widget;                           // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              Overlay_Objective;                                 // 0x308(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPopUp_MissionLaunch_Widget_C*         PopUp_MissionLaunch_Widget;                        // 0x310(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          RootCanvasPanel;                                   // 0x318(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URulebookNotification_Widget_C*        RulebookNotification_Widget;                       // 0x320(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                             SafeZone_0;                                        // 0x328(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             ScaleBox_CardNotification;                         // 0x330(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             ScaleBox_Goals;                                    // 0x338(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             ScaleBox_ScrollText;                               // 0x340(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollAnnounce_Widget_C*              ScrollAnnounce_Widget;                             // 0x348(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TEXT_AnnounceSubText;                              // 0x350(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TEXT_GoalAnnounce;                                 // 0x358(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          VBox_Scroll;                                       // 0x360(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UGoalBase_C*>                   SortedActiveGoals;                                 // 0x368(0x10)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	class FText                                  LastGoalText;                                      // 0x378(0x18)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	class FText                                  LastGoalDetail;                                    // 0x390(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_            RulebookLocalVoteCast;                             // 0x3A8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                ActiveRulebookUpgrade;                             // 0x3B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UClass*, bool>                    RulebooksAndLocalCastVote;                         // 0x3C0(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated)
	class FText                                  GoalTitleOverride;                                 // 0x410(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  GoalSubtextOveride;                                // 0x428(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UClass*, class UClass*>           CheatVerbToActiveBullshitArchetype;                // 0x440(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FUI_Card_Struct>               ExistingUpgradeQueue;                              // 0x490(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                        Backdrop_Current_Time;                             // 0x4A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6A54[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            AddOrRemoveBackdrop;                               // 0x4A8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            RulebookActivated;                                 // 0x4B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UNotificationEnemyBullshit_Widget_C*> EnemyBullshitWidgets;                              // 0x4C8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class UClass*, class UNotificationEnemyBullshit_Widget_C*> EnemyBullshitToCardUI;                             // 0x4D8(0x50)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	class UClass*                                Started_Bullshit;                                  // 0x528(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         RulebookQueued;                                    // 0x530(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6A55[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          BullshitAnimTimer;                                 // 0x538(0x8)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                        BullshitLightningTime;                             // 0x540(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6A56[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            UI_LightningEnemyBullshit;                         // 0x548(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UNotificationEnemyBullshit_Widget_C*   StartedBullshitWidget;                             // 0x558(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          BannerDurationTimer;                               // 0x560(0x8)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         InBossFight;                                       // 0x568(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         AnnouncingBullshit;                                // 0x569(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UGoalHUD_C* GetDefaultObj();

	void SequenceEvent__ENTRYPOINTGoalHUD_0();
	void IsBSPresentationInProgress(bool* Yes, bool CallFunc_IsValidClass_ReturnValue, bool CallFunc_K2_TimerExistsHandle_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1);
	void Handle_Enemy_Bullshit_Camera_Start();
	void RefreshActiveEnemyBullshit(class UClass* BSClass, int32 NewCount, int32 OldCount, class AQtnBodyPawn* AffectedBody, float TimerMax, class UClass* LOCAL_IncomingBSClass, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_IsValidClass_ReturnValue, bool CallFunc_ClassIsChildOf_ReturnValue);
	bool IsAnnouncementEnemyBullshit();
	void GetBullshitClassFromCheatVerb(class UClass* EnemyCheatActivationVerbBase, class UClass** QtnBullshitBPBaseArchetype, bool* Found, const class FString& CallFunc_GetClassDisplayName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, class UClass* CallFunc_SyncLoadClass_ReturnValue, class UClass* K2Node_ClassDynamicCast_AsQtn_Bullshit_BPBase_Archetype, bool K2Node_ClassDynamicCast_bSuccess, const class FString& CallFunc_GetDisplayName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, bool CallFunc_IsValidClass_ReturnValue);
	void CreateCardStructFromBullshitArchetype(TSubclassOf<class UQtnBullshit> bullshitClass, struct FUI_Card_Struct* UI_Card_Struct, class UQtnBullshit* CallFunc_GetBullshitArchetype_ReturnValue, class UTexture2D* CallFunc_GetIconForUI_ReturnValue, TSoftObjectPtr<class UTexture2D> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue, const struct FUI_Card_Struct& K2Node_MakeStruct_UI_Card_Struct);
	void Refresh_Scroll_Text(class FText GoalText);
	void HandleEnemyBullshitReset();
	void HandleEnemyBullshitResumePlay();
	void HandleEnemyBullshitReveal(class UClass* CallFunc_GetBullshitClassFromCheatVerb_QtnBullshitBPBaseArchetype, bool CallFunc_GetBullshitClassFromCheatVerb_Found, const struct FUI_Card_Struct& CallFunc_CreateCardStructFromBullshitArchetype_UI_Card_Struct, const struct FUI_Card_Struct& CallFunc_CreateCardStructFromBullshitArchetype_UI_Card_Struct_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void HandleEnemyBullshitStarted(class UClass* Enemy_Cheat_Activation_Verb_Base, class UClass* NewLocalVar_0);
	void HandleLaunchFinished();
	void HandleLaunchStarted(int32 Arc, enum class EQtnDifficulty Difficulty);
	void AddRemoveBossHealthBar(bool IsAdding, bool Temp_bool_Variable, bool CallFunc_Not_PreBool_ReturnValue, const class FString& CallFunc_Conv_BoolToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_1, enum class ESlateVisibility K2Node_Select_Default, enum class ESlateVisibility Temp_byte_Variable_2, enum class ESlateVisibility Temp_byte_Variable_3, enum class ESlateVisibility K2Node_Select_Default_1);
	void RefreshEnemyBullshit(class UEnemyBSManagerComponent_C* LOCAL_EBS_Manager, class UNotificationEnemyBullshit_Widget_C* LOCAL_CurrentEBS_Widget, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class UNotificationEnemyBullshit_Widget_C* CallFunc_Array_Get_Item, TArray<class UNotificationEnemyBullshit_Widget_C*>& CallFunc_Map_Values_Values, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_IsVisible_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, class UNotificationEnemyBullshit_Widget_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Map_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);
	void SelectEnemyBullshitWidget(class UClass*& Key, class UNotificationEnemyBullshit_Widget_C** EBS_Widget, bool* BullshitAlreadyOnscreen, int32 LOCAL_IndexToInit, TMap<class UClass*, int32> LOCAL_CurrentBullshitBPB, class UNotificationEnemyBullshit_Widget_C* LOCAL_WidgetToInit, class UClass* LOCAL_IncomingBullshitBPB, enum class ESlateVisibility CallFunc_GetVisibility_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool Temp_bool_Variable, TArray<class UNotificationEnemyBullshit_Widget_C*>& CallFunc_Map_Values_Values, class UNotificationEnemyBullshit_Widget_C* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, class UNotificationEnemyBullshit_Widget_C* K2Node_Select_Default, int32 CallFunc_Map_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);
	void Create_Activation_Verb_to_Bullshit_Archetype_Map(const TArray<class UClass*>& LOCAL_OldValues, const TArray<class UClass*>& LOCAL_OldKeys, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class UQtnGameInstance* CallFunc_GetQtnGameInstance_ReturnValue, class UQtnCombatSettings* CallFunc_GetCombatSettings_ReturnValue, class UGlobalCombatSettings_C* K2Node_DynamicCast_AsGlobal_Combat_Settings, bool K2Node_DynamicCast_bSuccess, TArray<TSoftClassPtr<class UQtnBullshitBPBaseArchetype_C>>& CallFunc_Map_Keys_Keys, TArray<TSoftClassPtr<class UEnemyCheatActivationVerbBase_C>>& CallFunc_Map_Values_Values, TSoftClassPtr<class UQtnBullshitBPBaseArchetype_C> CallFunc_Array_Get_Item, TSoftClassPtr<class UEnemyCheatActivationVerbBase_C> CallFunc_Array_Get_Item_1, class UClass* CallFunc_SyncLoadClass_ReturnValue, class UClass* CallFunc_SyncLoadClass_ReturnValue_1, class UClass* K2Node_ClassDynamicCast_AsQtn_Bullshit_BPBase_Archetype, bool K2Node_ClassDynamicCast_bSuccess, class UClass* K2Node_ClassDynamicCast_AsEnemy_Cheat_Activation_Verb_Base, bool K2Node_ClassDynamicCast_bSuccess_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void CheckActiveGoals(class FText* New_goal_subtext, bool* Only_one_goal_active, class FText LOCAL_Text, const TArray<class UQtnGoal*>& LOCAL_GoalsToShow, int32 LOCAL_HighestPriority, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool Temp_bool_True_if_break_was_hit_Variable, int32 Temp_int_Array_Index_Variable_1, bool CallFunc_Not_PreBool_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, class UQtnGoal* CallFunc_Array_Get_Item, class UGoalBase_C* K2Node_DynamicCast_AsGoal_Base, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Add_IntInt_ReturnValue_1, const class FString& CallFunc_Conv_TextToString_ReturnValue_1, bool CallFunc_EqualEqual_StrStr_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, class FText CallFunc_Conv_StringToText_ReturnValue, class UQtnGoal* CallFunc_Array_Get_Item_1, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class UGoalBase_C* CallFunc_Array_Get_Item_2, int32 CallFunc_Array_AddUnique_ReturnValue, class UGoalBase_C* CallFunc_Array_Get_Item_3, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1);
	void RefreshGoalText(class FText GoalText, class FText GoalSubtext, bool CallFunc_NotEqual_TextText_ReturnValue, bool CallFunc_NotEqual_TextText_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue);
	void TickActiveGoalUI(bool CallFunc_TextIsEmpty_ReturnValue, class FText CallFunc_checkActiveGoals_new_goal_subtext, bool CallFunc_checkActiveGoals_only_one_goal_active, class UGoalBase_C* CallFunc_Array_Get_Item, bool CallFunc_Array_IsValidIndex_ReturnValue);
	void UnregisterActiveGoal(class UGoalBase_C* Goal, bool CallFunc_Array_RemoveItem_ReturnValue);
	void Register_Active_Goal(class UGoalBase_C* Goal, bool NeedAdd, int32 GoalPriority, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, bool Temp_bool_True_if_break_was_hit_Variable, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UGoalBase_C* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue);
	void Finished_801CAF73482C72604A57818E0A41CF5F();
	void BackdropRepeater();
	void AnimSeq_Backdrop(bool Add);
	void RemoveBackdrop();
	void OnQtnWidgetResumed(class UQtnScreen* PreviousScreen);
	void DisplaySubGoal(class FText GoalText);
	void UpdateGoalDetails(class FText Text);
	void OnQtnWidgetInitialized();
	void HandleToggleUI(bool IsHidden);
	void OnQtnWidgetPaused();
	void CleanUpGoalBanner();
	void OnQtnWidgetTicked(float DeltaSeconds);
	void HUD_AnnounceGoal(class FText GoalText);
	void UpgradeCardNotify(int32 OrigLevel, const struct FQtnUpgradeSettings& UpgradeSettings, const struct FQtnRolledUpgradeData& RolledUpgradeData);
	void Anim_RulebookActivated();
	void CardNotification_EnemyBullshitStart(class UClass* StartedBullshit, float TimerMax);
	void BullshitStopUI(class UClass* StoppedBullshit);
	void RemoveEnemyBullshitReference(class UClass* BullshitToRemove);
	void EventOnRulebookActivated(class ALoot_Rulebook_Parent_Frob_C* RulebookActivated);
	void AnnounceRulebookActivation();
	void EnemyBullshit_StartLightningTimer();
	void EnemyBullshit_FireLightning();
	void CardNotification_EnemyBullshitStartAnimation();
	void CombatInhibitedEvent_Event_0(bool IsInhibited, bool IsServer);
	void Anim_RemoveBannerGoal();
	void OnSocialHubMissionReady(int32 Arc, enum class EQtnDifficulty Difficulty);
	void OnSocialHubAllPlayersReady();
	void ExecuteUbergraph_GoalHUD(int32 EntryPoint, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility CallFunc_GetVisibility_ReturnValue, enum class ESlateVisibility Temp_byte_Variable_1, bool K2Node_SwitchEnum_CmpSuccess, enum class ESlateVisibility Temp_byte_Variable_2, enum class ESlateVisibility Temp_byte_Variable_3, bool K2Node_CustomEvent_Add, bool Temp_bool_Variable, const class FString& CallFunc_Conv_BoolToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, bool CallFunc_IsAnimationPlayingForward_ReturnValue, float CallFunc_GetAnimationCurrentTime_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue, class UQtnScreen* K2Node_Event_previousScreen, class FText K2Node_CustomEvent_goalText_1, int32 Temp_int_Array_Index_Variable, class FText K2Node_CustomEvent_Text, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue, bool K2Node_CustomEvent_isHidden, class UQtnScreen* CallFunc_GetOwningScreen_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsScreenActive_ReturnValue, float K2Node_Event_DeltaSeconds, class FText K2Node_CustomEvent_goalText, int32 K2Node_CustomEvent_OrigLevel, const struct FQtnUpgradeSettings& K2Node_CustomEvent_UpgradeSettings, const struct FQtnRolledUpgradeData& K2Node_CustomEvent_RolledUpgradeData, class AQtnGameState* CallFunc_GetQtnGameState_ReturnValue, class AQtnGameStateArchetype_C* K2Node_DynamicCast_AsQtn_Game_State_Archetype, bool K2Node_DynamicCast_bSuccess, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UClass* K2Node_CustomEvent_StartedBullshit, float K2Node_CustomEvent_TimerMax, class UClass* CallFunc_GetBullshitClassFromCheatVerb_QtnBullshitBPBaseArchetype, bool CallFunc_GetBullshitClassFromCheatVerb_Found, const class FString& CallFunc_GetDisplayName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, class UNotificationEnemyBullshit_Widget_C* CallFunc_SelectEnemyBullshitWidget_EBS_Widget, bool CallFunc_SelectEnemyBullshitWidget_BullshitAlreadyOnscreen, const struct FUI_Card_Struct& CallFunc_CreateCardStructFromBullshitArchetype_UI_Card_Struct, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class UClass* K2Node_CustomEvent_StoppedBullshit, const class FString& CallFunc_GetClassDisplayName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, class UClass* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class UNotificationEnemyBullshit_Widget_C* CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, class UClass* K2Node_CustomEvent_BullshitToRemove, bool CallFunc_Map_Remove_ReturnValue, class UNotificationEnemyBullshit_Widget_C* CallFunc_Map_Find_Value_2, bool CallFunc_Map_Find_ReturnValue_2, const class FString& CallFunc_GetClassDisplayName_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, const class FString& CallFunc_GetDisplayName_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, const class FString& CallFunc_GetDisplayName_ReturnValue_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, const class FString& CallFunc_Concat_StrStr_ReturnValue_5, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, bool CallFunc_IsValid_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_6, class UNotificationEnemyBullshit_Widget_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_AddUnique_ReturnValue, int32 CallFunc_Array_AddUnique_ReturnValue_1, class ALoot_Rulebook_Parent_Frob_C* K2Node_CustomEvent_RulebookActivated, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, class UQtnScreen* CallFunc_GetOwningScreen_ReturnValue_1, bool CallFunc_IsScreenActive_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_9, bool CallFunc_IsAnnouncementEnemyBullshit_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_10, class AQtnPlayerController* CallFunc_GetOwningPlayerController_ReturnValue, class AQtnPlayerControllerArchetype_C* K2Node_DynamicCast_AsQtn_Player_Controller_Archetype, bool K2Node_DynamicCast_bSuccess_1, const class FString& CallFunc_GetDisplayName_ReturnValue_4, const class FString& CallFunc_Concat_StrStr_ReturnValue_7, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_11, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_12, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_13, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_14, class UUMGSequencePlayer* CallFunc_CreatePlayAnimationProxyObject_Result, class UWidgetAnimationPlayCallbackProxy* CallFunc_CreatePlayAnimationProxyObject_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_15, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_16, bool Temp_bool_Variable_1, bool K2Node_CustomEvent_isInhibited, bool K2Node_CustomEvent_isServer, bool CallFunc_Not_PreBool_ReturnValue_1, enum class ESlateVisibility K2Node_Select_Default, float CallFunc_Conv_BoolToFloat_ReturnValue, class AQtnGameState* CallFunc_GetQtnGameState_ReturnValue_1, int32 K2Node_CustomEvent_arc, enum class EQtnDifficulty K2Node_CustomEvent_difficulty, class AQtnGameStateArchetype_C* K2Node_DynamicCast_AsQtn_Game_State_Archetype_1, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsBSPresentationInProgress_yes, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_17, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_FClamp_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, enum class ESlateVisibility K2Node_Select_Default_1, bool CallFunc_K2_TimerExistsHandle_ReturnValue);
	void UI_LightningEnemyBullshit__DelegateSignature();
	void RulebookActivated__DelegateSignature();
	void AddOrRemoveBackdrop__DelegateSignature(bool Add);
	void RulebookLocalVoteCast__DelegateSignature(bool YesVote, TArray<class UClass*>& RulebookEnemyUpgrade, class UClass* RulebookReward);
};

}


