#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x288 (0x2E0 - 0x58)
// BlueprintGeneratedClass GoalBase.GoalBase_C
class UGoalBase_C : public UQtnGoal
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x58(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UGoalHUD_C*                            GoalHUD;                                           // 0x60(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        GoalPriority;                                      // 0x68(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6615[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  GoalTitle;                                         // 0x70(0x18)(Edit, BlueprintVisible)
	class FText                                  GoalDetail;                                        // 0x88(0x18)(Edit, BlueprintVisible)
	bool                                         NeedsAnnouncement;                                 // 0xA0(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6617[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGameplayTag>                  RelevantGameplayTags;                              // 0xA8(0x10)(Edit, BlueprintVisible)
	TArray<class FName>                          RelevantComponentTags;                             // 0xB8(0x10)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_            ThisVOCueFinishedForAllPlayers;                    // 0xC8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                        PlayercueCount_VO;                                 // 0xD8(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6619[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        ActorsWithIcons;                                   // 0xE0(0x10)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance, RepNotify)
	TArray<class AActor*>                        ActorsThatDontNeedIcons;                           // 0xF0(0x10)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance, RepNotify)
	class ABP_DeadPlayerTeleportLoc_C*           LateJoinTeleportLoc;                               // 0x100(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                LateJoinLocationName;                              // 0x108(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                         LOCAL_catchLateJoinerUIUpdate;                     // 0x118(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_661A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            CutsceneEndedForAllPlayers;                        // 0x120(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ACutsceneManagerActor_C*               CutsceneManagerActor;                              // 0x130(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        PlayerCueCount_Cutscene;                           // 0x138(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_661B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_GoalPickup_C*                      QuestItem;                                         // 0x140(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQuestItemSpawner_C*                   QuestItemSpawner;                                  // 0x148(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQtnSkirmish*                          Skirmish;                                          // 0x150(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SkirmishEventOccured;                              // 0x158(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_661C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundCue*                             ObjectiveStartedCue;                               // 0x160(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NoObjectiveHUD;                                    // 0x168(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         UseDefaultPlayerStartsAsLateJoinLoc;               // 0x169(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_661D[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          Loot_Spawner_Region;                               // 0x170(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AActor*>                        HiddenIconActors;                                  // 0x180(0x10)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance, RepNotify)
	TArray<class AActor*>                        UnhiddenIconActors;                                // 0x190(0x10)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance, RepNotify)
	class ABP_DeadPlayerTeleportLoc_C*           DefaultLateJoinLocation;                           // 0x1A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                UpgradeGiver;                                      // 0x1A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATravelVolume_BP_C*>            GatesToUpdateUpgradeGiver;                         // 0x1B0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<TSoftClassPtr<class AActor>>          ToggleClasses;                                     // 0x1C0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AActor*>                        ActorsToToggle;                                    // 0x1D0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UClass*                                RewardType;                                        // 0x1E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ExpectedSavedPlayers;                              // 0x1E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SavedPlayers;                                      // 0x1EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         TravelInitiated;                                   // 0x1F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_661E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  NextLevelName;                                     // 0x1F4(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SaveAsSeen_;                                       // 0x1FC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IncrementDay_;                                     // 0x1FD(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         HasProgressPin;                                    // 0x1FE(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_661F[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstance*                     ProgressPin_UnknownIcon;                           // 0x200(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                     ProgressPin_LoseIcon;                              // 0x208(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ProgressPin_complete;                              // 0x210(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6620[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ProgressPin_name;                                  // 0x218(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  Upgrade_Get_GoalDetail;                            // 0x230(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  Upgrade_Wait_GoalDetail;                           // 0x248(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  Upgrade_Go_GoalDetail;                             // 0x260(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         HasJokerGate;                                      // 0x278(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                         HideUntilPathConfirmed;                            // 0x279(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6621[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        VisibilityDistance;                                // 0x27C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         TriggersSuccessEvent;                              // 0x280(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6622[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  GoalRejection;                                     // 0x288(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         RegisterGoalRejectionAtStart;                      // 0x2A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         ShowDebugInfo;                                     // 0x2A1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6623[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ACinematicFlythrough_Archetype_C*      Flythrough;                                        // 0x2A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Gate_GoalDetail;                                   // 0x2B0(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         R_HasGateLock;                                     // 0x2C8(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                         R_LockOpened;                                      // 0x2C9(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                        Pad_6624[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                R_CullingLevel;                                    // 0x2D0(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, RepNotify, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UGoalBase_C* GetDefaultObj();

	void Remove_Nichole_Icon_Server_Only(class AQtnGameState* CallFunc_GetQtnGameState_ReturnValue, bool CallFunc_IsServer_ReturnValue, class AQtnGameStateArchetype_C* K2Node_DynamicCast_AsQtn_Game_State_Archetype, bool K2Node_DynamicCast_bSuccess);
	void OnRep_r_CullingLevel(bool CallFunc_IsEmpty_ReturnValue);
