#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x8 (0x8 - 0x0)
// UserDefinedStruct HubConversationActiveFlags.HubConversationActiveFlags
struct FHubConversationActiveFlags
{
public:
	bool                                         Actor_Cartman_15_AF4AEAAD44A223079699C7B81EA69204; // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Actor_Butters_7_4F7EFE204ECC4BC0D4BE68B50906AEBD;  // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Actor_Kyle_Arc2_1_160706CD4AE3EF884781298691FE972D; // 0x2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Actor_Kyle_Arc3Plus_3_A2719988470588132FB18091B3923565; // 0x3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Actor_Kenny_11_9D16A00348B0965E21CA4F94AF00BB57;   // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Actor_Stan_5_33F52491438406A9C0C4C084C0A8795E;     // 0x5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         TriggerVolume_Arc2_9_27F18EB14C6652CBBF98D284BC102783; // 0x6(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         TriggerVolume_Arc3Plus_13_FEFDE73D476C3B329407338A7451B9CF; // 0x7(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}


