#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x220 (0x470 - 0x250)
// BlueprintGeneratedClass LootManagerActor.LootManagerActor_C
class ALootManagerActor_C : public AActor
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x250(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x258(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                         LootInitHappened;                                  // 0x260(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_497C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumLoot_Smashables;                                // 0x264(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NumLoot_SmashHealth;                               // 0x268(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NumLoot_AverageFrob;                               // 0x26C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NumLoot_CardPackFrobbable;                         // 0x270(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NumLoot_AmazingFrob;                               // 0x274(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NumLoot_DarkMatter;                                // 0x278(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NumLoot_Rulebooks;                                 // 0x27C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                          ValidSpawnerRegions;                               // 0x280(0x10)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	TArray<class AQtnLevelLootSpawner_C*>        AllLootSpawners;                                   // 0x290(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance, ContainsInstancedReference)
	enum class EQtnLootType_Enum                 CurrentTier;                                       // 0x2A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_497D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                DebugScreenColor;                                  // 0x2A4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<enum class EQtnLootType_Enum, int32>    DEBUGONLY_TierToExternalCount;                     // 0x2A8(0x50)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	TMap<enum class EQtnLootType_Enum, int32>    DEBUGONLY_TierToLevelLootCount;                    // 0x2F8(0x50)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	bool                                         ShowDebug;                                         // 0x348(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_497E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        ActuallySpawned_Smashables;                        // 0x350(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TArray<class AActor*>                        ActuallySpawned_HealthSmashables;                  // 0x360(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TArray<class AActor*>                        ActuallySpawned_AvgFrobbables;                     // 0x370(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TArray<class AActor*>                        ActuallySpawned_AmazingFrobbables;                 // 0x380(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TArray<class AActor*>                        ActuallySpawned_CardPacks;                         // 0x390(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TArray<class AActor*>                        ActuallySpawned_Rulebooks;                         // 0x3A0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TArray<class AActor*>                        ActuallySpawned_DarkMatter;                        // 0x3B0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TArray<class AActor*>                        Rulebooks;                                         // 0x3C0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                        Rulebooks_NumToDouble;                             // 0x3D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Rulebooks_NumToTriple_DEPRECIATED;                 // 0x3D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Rulebooks_NumSpawned_Basic;                        // 0x3D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Rulebooks_NumSpawned_Double;                       // 0x3DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Rulebooks_NumSpawned_Triple;                       // 0x3E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_497F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AQtnLevelLootSpawner_C*>        DEBUGONLY_AlwaysSpawners;                          // 0x3E8(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class AQtnLevelLootSpawner_C*>        DEBUGONLY_DowngradedSpawners;                      // 0x3F8(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class FString>                        DEBUGONLY_WarningsFound;                           // 0x408(0x10)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	TArray<class AQtnLevelLootSpawner_C*>        DEBUGONLY_AlwaysSpawnLoc_LowestTierCouldNotSpawn;  // 0x418(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class AQtnLevelLootSpawner_C*>        DEBUGONLY_AlwaysSpawn_NotEnoughLocs;               // 0x428(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class AActor*>                        Rulebooks_Spawners;                                // 0x438(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AQtnLevelLootSpawner_C*>        UnusedLocations;                                   // 0x448(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	bool                                         DEBUGONLY_Rerolled;                                // 0x458(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4980[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          DEBUGONLY_RerolledRegions;                         // 0x460(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class ALootManagerActor_C* GetDefaultObj();

	void SetMaxDrawDistance(class AActor* LootActor, TArray<class UMeshComponent*>& CallFunc_K2_GetComponentsByClass_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Array_Length_ReturnValue, class UMeshComponent* CallFunc_Array_Get_Item, int32 Temp_int_Loop_Counter_Variable, float CallFunc_GetCustomLootCullDistance_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);
	void GetNextHighestTier(class AQtnLevelLootSpawner_C* Location, enum class EQtnLootType_Enum* Next_highest_tier, bool* HasMoreOptions, bool CallFunc_IsValid_ReturnValue);
