#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x340 (0x5D8 - 0x298)
// WidgetBlueprintGeneratedClass MenuUpgrade_Widget.MenuUpgrade_Widget_C
class UMenuUpgrade_Widget_C : public UQtnUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x298(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UAffordance_Widget_C*                  AffordanceReshuffle_Widget;                        // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUpgradeAffordance_Widget_C*           AffordanceWidget_1;                                // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUpgradeAffordance_Widget_C*           AffordanceWidget_2;                                // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUpgradeAffordance_Widget_C*           AffordanceWidget_3;                                // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUpgradeAffordance_Widget_C*           AffordanceWidget_4;                                // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CapsuleBtn_Widget_C*               BtnWidget_Reroll;                                  // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCurrencyWallet_Widget_C*              CurrencyWallet_Widget;                             // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          MainUIPanel;                                       // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollAnnounce_Widget_C*              ScrollAnnounce_Widget;                             // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTimer_Widget_C*                       Timer_Widget;                                      // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUpgradeDetail_Widget_C*               UpgradeDetail_AceInTheHole;                        // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUpgradeDetail_Widget_C*               UpgradeDetail_CardShark;                           // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUpgradeDetail_Widget_C*               UpgradeDetail_OnlyTheBest;                         // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUpgradeDetail_Widget_C*               UpgradeDetail_SweetTalker;                         // 0x308(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                              Wbox_Left;                                         // 0x310(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                MyUpgradeStation;                                  // 0x318(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CurrentHoveredCard;                                // 0x320(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UpgradeFillActive;                                 // 0x324(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3788[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUpgradeAffordance_Widget_C*           CurrentUpgradeWidget;                              // 0x328(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CurrentFillTime;                                   // 0x330(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3789[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABodyPawnPlayer_C*                     MyBodyPawnPlayer;                                  // 0x338(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UQtnPerk>                  Perk_CardShark;                                    // 0x340(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class UUpgradeDetail_Widget_C*>       DetailCards;                                       // 0x348(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TSubclassOf<class UQtnPerk>                  Perk_SweetTalker;                                  // 0x358(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UQtnPerk>                  Perk_OnlyTheBest;                                  // 0x360(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                Perk_AceInTheHole;                                 // 0x368(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUpgradeDetail_Widget_C*               Out_CardShark;                                     // 0x370(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          IdleTimer;                                         // 0x378(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        TempCurrentCurrency;                               // 0x380(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        TickTime;                                          // 0x384(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUpgradeDetail_Widget_C*               AceInTheHoleCard;                                  // 0x388(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUpgradeDetail_Widget_C*               OnlyTheBestCard;                                   // 0x390(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQtnStruct_VOLine>             JokerFTUX_EntryVO;                                 // 0x398(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FQtnStruct_VOLine>             JokerFTUX_ExitVO;                                  // 0x3A8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         InJokerFTUX;                                       // 0x3B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         UpgradeFTUX_InFTUX;                                // 0x3B9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         RarityFTUX_InRarityFTUX;                           // 0x3BA(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_378A[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FQtnStruct_VOLine>             RarityFTUX_RarityVO;                               // 0x3C0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FQtnStruct_VOLine>             RarityFTUX_UpgradeOpenVO;                          // 0x3D0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         RarityFTUX_hasDoneRarity;                          // 0x3E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         RarityFTUX_hasDoneReshuffle;                       // 0x3E1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         UpgradeFTUX_hasPickedUpgrade;                      // 0x3E2(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_378B[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUI_FTUX_TrainingMoment_Screen_C*      Ftux_Training_Moment_Screen;                       // 0x3E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQtnStruct_VOLine>             UpgradeFTUX_EntryVO;                               // 0x3F0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  UpgradeFTUX_Header;                                // 0x400(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  UpgradeFTUX_Description_Rarity_Gamepad;            // 0x418(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  UpgradeFTUX_Description_Rarity_Mouse;              // 0x430(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  UpgradeFTUX_Description_Reshuffle;                 // 0x448(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  FartEscapeFTUX_Header;                             // 0x460(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FQtnStruct_VOLine                     FartEscapeFTUX_FartEscapeVO;                       // 0x478(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_378C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnGoalManager_FTUX_C*                FTUX_Goal_Manager;                                 // 0x4A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         FartEscapeFTUX_InFTUX;                             // 0x4A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_378D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnGoal_FTUX_FartEscapeTutorial_C*    FartEscapeGoal;                                    // 0x4B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         FartEscapeFTUX_VODone;                             // 0x4B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_378E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  FartEscapeFTUX_Scroll;                             // 0x4C0(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  HealingTotemFTUX_Header;                           // 0x4D8(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UQtnGoal_FTUX_HealingTotem_C*          HealingTotemGoal;                                  // 0x4F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQtnStruct_VOLine                     HealingTotemFTUX_HealingTotemVO;                   // 0x4F8(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_378F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         HealingTotemFTUX_VODone;                           // 0x520(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         HealingTotemFTUX_InFTUX;                           // 0x521(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3790[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  HealingTotemFTUX_Scroll;                           // 0x528(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         JokerFTUX_IntroDone;                               // 0x540(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3791[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  JokerFTUX_Listen;                                  // 0x548(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  UpgradeFTUX_Listen;                                // 0x560(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FQtnStruct_VOLine>             RarityFTUX_ReshuffleEntryVO;                       // 0x578(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         RarityFTUX_hasListenedToReshuffle;                 // 0x588(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         RarityFTUX_hasListenedToRarity;                    // 0x589(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         UpgradeFTUX_hasListenedToIntro;                    // 0x58A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         RarityFTUX_VODone;                                 // 0x58B(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         RarityFTUX_blockReshuffle;                         // 0x58C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3792[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  RarityFTUX_Button_IncreaseRarity;                  // 0x590(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  FTUX_SelectCard_Gamepad;                           // 0x5A8(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  FTUX_SelectCard_Keys;                              // 0x5C0(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UMenuUpgrade_Widget_C* GetDefaultObj();

	void RequestCurrencyVisibilities(bool* ShowTP, bool* ShowDM, bool* ShowPP);
	void SearchForEnemyUpgrade(class UClass*& EnemyUpgradeToFind, bool* UpgradeFound, int32 LOCAL_UpgradeIndex, class UClass* LOCAL_UpgradeClass, class AQtnGameState* CallFunc_GetQtnGameState_ReturnValue, TArray<TSubclassOf<class UQtnUpgrade>>& CallFunc_GetCurrentEnemyUpgrades_ReturnValue, bool CallFunc_Array_Contains_ReturnValue);
	void GetMenuUpgradeSpeaker(class AScriptedSkeletalActor_Trial_C** Speaker, class UPlayerUpgradeSessionState_C* CallFunc_GetPlayerUpgradeSessionData_UpgradeSession, class APlayerTribunalSlot_BP_C* CallFunc_GetTribunalSlot_TribSlot);
