#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x8A (0x16A - 0xE0)
// BlueprintGeneratedClass MissionEventComponent.MissionEventComponent_C
class UMissionEventComponent_C : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xE0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class ABP_GoalPickup_C*>              CarriedItems;                                      // 0xE8(0x10)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	class FText                                  OldGoalTitle;                                      // 0xF8(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class FText                                  OldGoalMessage;                                    // 0x110(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	bool                                         HasQuestItem;                                      // 0x128(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                        Pad_5CB0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ACutsceneManagerActor_C*               CutsceneManager;                                   // 0x130(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         InConstrainedAir;                                  // 0x138(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5CB1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Server_NumPlayersRequestingSkip;                   // 0x13C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CurrentTravelVol_Server;                           // 0x140(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5CB2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ATravelVolume_BP_C*                    CurTravelVolume;                                   // 0x148(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainingMomentManager_C*              SocialHubManager;                                  // 0x150(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CarryingHeavyItem;                                 // 0x158(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5CB3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ATrainingMoment_BP_C*                  LOCAL_myCurrentTraining;                           // 0x160(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Local_needsFTUXBSVO;                               // 0x168(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         Local_needsFTUXBSIgnoredVO;                        // 0x169(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UMissionEventComponent_C* GetDefaultObj();

	void SetMapEntryCountdown_ServerOnly(int32 Countdown, class AQtnGameState* CallFunc_GetQtnGameState_ReturnValue, bool CallFunc_IsServer_ReturnValue, class AQtnGameStateArchetype_C* K2Node_DynamicCast_AsQtn_Game_State_Archetype, bool K2Node_DynamicCast_bSuccess);
	void GetGoalManagerBase(class UQtnGoalManagerBase_C** NewParam, class UQtnGoalManager* CallFunc_GetGoalManager_ReturnValue, class UQtnGoalManagerBase_C* K2Node_DynamicCast_AsQtn_Goal_Manager_Base, bool K2Node_DynamicCast_bSuccess);
