#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x180 (0x418 - 0x298)
// WidgetBlueprintGeneratedClass PlayerHUD.PlayerHUD_C
class UPlayerHUD_C : public UQtnUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x298(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      EscapePromptIn;                                    // 0x2A0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      Currencies_In;                                     // 0x2A8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      Currencies_Out;                                    // 0x2B0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                          CanvasRadialFill;                                  // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterCom_Widget_C*                CharacterCom_Widget;                               // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWigglePrompt_Widget_C*                EscapePrompt_Widget;                               // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                IMAGE_HUD;                                         // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                IMAGE_RadialFillChargeInput;                       // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          RootCanvasPanel;                                   // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          SafeZoneCanvasPanel;                               // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             ScaleBox_CharacterCom;                             // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TEXT_Messaging;                                    // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            WatermarkText;                                     // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUD_Affordance_Widget_C*              WorldAffordance;                                   // 0x308(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UBP_Loot_C*>                    ItemPopUps;                                        // 0x310(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UBP_Loot_C*                            LastAffordanceLoot;                                // 0x320(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        RadialFillAmount;                                  // 0x328(0x4)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        RadialFillAmount_previous;                         // 0x32C(0x4)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        RadialFillFadeTimer;                               // 0x330(0x4)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1DE6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnInventoryComponent*                MyBodyInventory;                                   // 0x338(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQtnAttributeComponent*                BodyAttributes;                                    // 0x340(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        BSCountdownValue;                                  // 0x348(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1DE7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBodyInventoryComponent_C*             Body_Inventory_Component;                          // 0x350(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             AffordanceCenterRatio;                             // 0x358(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          TimerWalletAnim;                                   // 0x360(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          TimerWalletOut;                                    // 0x368(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class AActor*, class UScreenIndicator_C*> TrackedActorMap;                                   // 0x370(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	float                                        RadialFillFadeDuration;                            // 0x3C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1DE9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                CurrentRadialFillImage;                            // 0x3C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            EscapeButtonPressed;                               // 0x3D0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                        CurrentEscapeAddTime;                              // 0x3E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1DEB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UScreenIndicator_C*>            RegisteredScreenIndicators;                        // 0x3E8(0x10)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	bool                                         bLastFrameSignifierIsEmpty;                        // 0x3F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1DEC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ItemPickupPromptButItsATextInsteadOfAString;       // 0x400(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UPlayerHUD_C* GetDefaultObj();

	void SequenceEvent__ENTRYPOINTPlayerHUD_0();
	void RemoveBlockTokens(class UQtnVerb_Archetype_C* blockVerb, bool CallFunc_GetCombatHUD_FoundWidget, class UCombatHUD_C* CallFunc_GetCombatHUD_CombatHUD, bool CallFunc_GetCombatHUD_FoundWidget_1, class UCombatHUD_C* CallFunc_GetCombatHUD_CombatHUD_1);
	void TickScreenIndicators(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UScreenIndicator_C* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void RemoveScreenIndicator(class UScreenIndicator_C*& ScreenIndicator, bool Immediate, bool CallFunc_Array_RemoveItem_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsWidgetPoolEnabled_ReturnValue);
	void AddScreenIndicator(struct FIndicatorData& IndicatorData, class AActor* IndicatorActor, class UScreenIndicator_C** NewIndicator, bool CallFunc_IsWidgetPoolEnabled_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AQtnGameState* K2Node_DynamicCast_AsQtn_Game_State, bool K2Node_DynamicCast_bSuccess, class UScreenIndicator_C* CallFunc_Create_ReturnValue, class UUserWidget* CallFunc_AcquireWidgetFromPool_ReturnValue, class UScreenIndicator_C* K2Node_DynamicCast_AsScreen_Indicator, bool K2Node_DynamicCast_bSuccess_1, int32 CallFunc_Array_Add_ReturnValue, class UCanvasPanelSlot* CallFunc_AddChildToCanvas_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, class UCanvasPanelSlot* CallFunc_AddChildToCanvas_ReturnValue_1);
	void GetGoalHUD(bool* FoundWidget, class UGoalHUD_C** AsGoal_HUD, class UQtnScreen* CallFunc_GetOwningScreen_ReturnValue, class UGoalHUD_C* CallFunc_GetUserWidget_ReturnValue, class UGoalHUD_C* K2Node_DynamicCast_AsGoal_HUD, bool K2Node_DynamicCast_bSuccess);
	void SetRadialFillRatio(float FillRatio, float FadeDuration, bool ForVictimEscape, float CallFunc_FClamp_ReturnValue, enum class ESlateVisibility CallFunc_GetVisibility_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void OnDebugDisplay(class UQtnDebugWrapper* DebugWrapper, const TArray<class UWidget*>& LocalRootPanelChildren, class UQtnDebugWrapper* LocalDebugWrapper, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, class UWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue, int32 CallFunc_Map_Length_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, const class FString& CallFunc_Concat_StrStr_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, const struct FColor& K2Node_MakeStruct_Color, const struct FColor& K2Node_MakeStruct_Color_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, TArray<class UScreenIndicator_C*>& CallFunc_Map_Values_Values, int32 CallFunc_Array_Length_ReturnValue_1, class UScreenIndicator_C* CallFunc_Array_Get_Item_1, bool CallFunc_Less_IntInt_ReturnValue_1);
	void UpdateAffordancePosition(bool UseWorldSpaceLabel, const struct FVector& WorldSpaceLocation, const class FString& AffordanceText, const struct FVector2D& AffordancePosition, const struct FVector2D& CallFunc_GetScreenOffsetFromText_ReturnValue, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue, bool CallFunc_GetScreenLocationFromWorld_isWithinView, const struct FVector2D& CallFunc_GetScreenLocationFromWorld_ReturnValue, const struct FVector2D& CallFunc_GetScreenRatioFromLocation_ReturnValue, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, bool CallFunc_InRange_FloatFloat_ReturnValue, float CallFunc_BreakVector2D_X_1, float CallFunc_BreakVector2D_Y_1, const struct FVector2D& CallFunc_GetScreenLocationFromRatio_ReturnValue, bool CallFunc_InRange_FloatFloat_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, const struct FVector2D& CallFunc_Add_Vector2DVector2D_ReturnValue, const struct FVector2D& CallFunc_GetScreenLocationFromRatio_ReturnValue_1);
	void GetCombatHUD(bool* FoundWidget, class UCombatHUD_C** CombatHUD, class UQtnScreen* CallFunc_GetOwningScreen_ReturnValue, class UCombatHUDScreen_C* CallFunc_GetSubScreen_ReturnValue, class UUserWidget* CallFunc_GetMainWidget_ReturnValue, class UCombatHUD_C* K2Node_DynamicCast_AsCombat_HUD, bool K2Node_DynamicCast_bSuccess);
	void UpdateWatermark(bool CallFunc_IsShippingBuild_ReturnValue);
	void Call_New_Goal(class FText GoalText, class UQtnScreen* CallFunc_GetOwningScreen_ReturnValue, class UGoalHUD_C* CallFunc_GetUserWidget_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void UpdateCharacterCommunicationToAutoClose();
	void FinishCharacterCommunicationFromVO(class AScriptedSkeletalPhoneActor_C* PhoneActor);
	void StartCharacterCommunicationFromVO(class AScriptedSkeletalPhoneActor_C* PhoneActor, class UAnimMontage* AnimMontage, bool IsLeadIn, bool NeedsLeadIn, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue);
	void CharacterCommunication(const struct FTribunal_CharacterResponse& Response, float* SoundDuration, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void AddRemoveTrackedActor(class AActor* Actor, class UObject* Icon_Optional_, bool Adding, const struct FIndicatorData& IndicatorData, class UScreenIndicator_C** IndicatorOut, const struct FIndicatorData& LOCAL_Indicator_Data, class UObject* LOCAL_TargetIcon, bool LOCAL_actorAlreadyTracked, const TArray<class UObjectiveMarkerWidget_C*>& LOCAL_ActorsToRemove, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, class AQtnGameState* CallFunc_GetQtnGameState_ReturnValue, bool CallFunc_Map_Remove_ReturnValue, class AQtnGameStateArchetype_C* K2Node_DynamicCast_AsQtn_Game_State_Archetype, bool K2Node_DynamicCast_bSuccess, class UScreenIndicator_C* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class UScreenIndicator_C* CallFunc_Add_Screen_Indicator_Local_Only_indicatorOut, class AQtnGameState* CallFunc_GetQtnGameState_ReturnValue_1, class AQtnGameStateArchetype_C* K2Node_DynamicCast_AsQtn_Game_State_Archetype_1, bool K2Node_DynamicCast_bSuccess_1, class UScreenIndicator_C* CallFunc_Add_Screen_Indicator_Local_Only_indicatorOut_1, class UScreenIndicator_C* CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, const struct FOffScreen_Texture& K2Node_MakeStruct_OffScreen_Texture, const struct FOnScreen_Texture& K2Node_MakeStruct_OnScreen_Texture);
	void UpdateBlockUI(float TokenValue, bool ActivelyBlocking, bool CallFunc_GetCombatHUD_FoundWidget, class UCombatHUD_C* CallFunc_GetCombatHUD_CombatHUD);
	void AddBlockTokens(int32 NumTokens, class UQtnVerb_Archetype_C* blockVerb, bool CallFunc_GetCombatHUD_FoundWidget, class UCombatHUD_C* CallFunc_GetCombatHUD_CombatHUD, bool CallFunc_GetCombatHUD_FoundWidget_1, class UCombatHUD_C* CallFunc_GetCombatHUD_CombatHUD_1);
	void Update_Radial_Fill(float DTime, bool CallFunc_Less_FloatFloat_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, bool CallFunc_NotEqual_FloatFloat_ReturnValue, bool CallFunc_BooleanOR_ReturnValue);
	void CheckAffordanceForLoot(class UObject* Object, class UBP_Loot_C** Item, class UBP_Loot_C* OutItemWidget, class ABase_Item_Archetype_C* OutItem, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class UBP_Loot_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class AActor* CallFunc_FetchItemActor_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue);
	void UpdatePopUpPositions(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class AQtnPlayerController* CallFunc_GetOwningPlayerController_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UBP_Loot_C* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, const struct FVector& CallFunc_FetchWorldLocation_ReturnValue, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue, const struct FVector2D& CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition, bool CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue);
	void UpdateAffordance(class UTexture2D* LOCAL_Reticle, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue, const struct FQtnAffordanceInfo& CallFunc_GetAffordanceInfo_affordanceInfo, bool CallFunc_IsValid_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue_1, const struct FQtnAffordanceInfo& CallFunc_GetAffordanceInfo_affordanceInfo_1, class UBP_Loot_C* CallFunc_CheckAffordanceForLoot_item, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsEmpty_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class AQtnItem* K2Node_DynamicCast_AsQtn_Item, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsLootRecipientLocalPlayer_ReturnValue);
	void EscapeRepeater();
	void AnimSeq_EscapeWidget(bool Adding);
	void OnQtnWidgetTicked(float DeltaSeconds);
	void OnQtnWidgetResumed(class UQtnScreen* PreviousScreen);
	void OnQtnWidgetInitialized();
	void HandleToggleUI(bool IsHidden);
	void HUBTravelMessage(bool Failed);
	void OnQtnWidgetPaused();
	void DisplaySubGoal(class FText GoalText);
	void UpdateGoalDetails(class FText Text);
	void OnQtnWidgetReadyForGameplay();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_PlayerHUD(int32 EntryPoint, const struct FAnchors& K2Node_MakeStruct_Anchors, bool K2Node_CustomEvent_Adding, bool Temp_bool_Has_Been_Initd_Variable, bool CallFunc_IsAnimationPlayingForward_ReturnValue, class UCanvasPanelSlot* CallFunc_GetCanvasPanelSlot_ReturnValue, float CallFunc_GetAnimationCurrentTime_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue, float CallFunc_MakeLiteralFloat_ReturnValue, float K2Node_Event_DeltaSeconds, float CallFunc_Ease_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, class UQtnScreen* K2Node_Event_previousScreen, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue, bool K2Node_CustomEvent_isHidden, class UQtnScreen* CallFunc_GetOwningScreen_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsScreenActive_ReturnValue, bool K2Node_CustomEvent_failed, class FText K2Node_CustomEvent_goalText, class UQtnScreen* CallFunc_GetOwningScreen_ReturnValue_1, class FText K2Node_CustomEvent_Text, class UGoalHUD_C* CallFunc_GetUserWidget_ReturnValue, class UQtnScreen* CallFunc_GetOwningScreen_ReturnValue_2, bool CallFunc_IsValid_ReturnValue, class UGoalHUD_C* CallFunc_GetUserWidget_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, bool Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable, class AQtnBodyPawn* CallFunc_GetOccupiedBodyPawn_ReturnValue, bool Temp_bool_IsClosed_Variable, class ABodyPawnPlayer_C* K2Node_DynamicCast_AsBody_Pawn_Player, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsReadyForGameplay_ReturnValue, class UQtnScreen* CallFunc_GetOwningScreen_ReturnValue_3, bool CallFunc_IsScreenActive_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, float CallFunc_Ease_ReturnValue_1, float CallFunc_Ease_ReturnValue_2, class AQtnPlayerPawn* CallFunc_GetOwningQtnPlayerPawn_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, bool CallFunc_HasOptedInToPassiveEscape_ReturnValue, bool K2Node_Event_IsDesignTime, class UCanvasPanelSlot* CallFunc_GetCanvasPanelSlot_ReturnValue_1);
	void EscapeButtonPressed__DelegateSignature(bool IsPressed);
};

}


