#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xF8 (0x670 - 0x578)
// BlueprintGeneratedClass QtnGoalManager_MainStreet.QtnGoalManager_MainStreet_C
class UQtnGoalManager_MainStreet_C : public UQtnGoalManagerBase_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x578(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<TSoftClassPtr<class UQtnGoal>>        PossibleAmbushes;                                  // 0x580(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftClassPtr<class UQtnGoal>>        PossibleBonusZones;                                // 0x590(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                          FirstFOS;                                          // 0x5A0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                          SecondFOS;                                         // 0x5B0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UQtnGoal*                              FirstRolledFOS;                                    // 0x5C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQtnGoal*                              SecondRolledFOS;                                   // 0x5C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                        DEBUG_SpokesToIgnore;                              // 0x5D0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UQtnGoal*                              FindKennyGoal;                                     // 0x5E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQtnGoal*                              PlaygroundGoal;                                    // 0x5E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQtnGoal*                              GetToEndOfStreetGoal;                              // 0x5F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQtnGoal*                              CatapultGoal;                                      // 0x5F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQtnGoal*                              PrincessKennyGoal;                                 // 0x600(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQtnBodyPawn*                          DEBUGONLY_BuddyCartman;                            // 0x608(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQtnGoal*                              PreAmbushGoal;                                     // 0x610(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQtnGoal*                              AmbushA;                                           // 0x618(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQtnGoal*                              AmbushB;                                           // 0x620(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UQtnGoal*>                      AmbushA_GoalsToIgnore;                             // 0x628(0x10)(Edit, BlueprintVisible, Net, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UQtnGoal*>                      AmbushB_GoalsToIgnore;                             // 0x638(0x10)(Edit, BlueprintVisible, Net, DisableEditOnInstance, ContainsInstancedReference)
	class UQtnGoal_MS_Act2_MapEntry_C*           LOCAL_MapEntryGoal;                                // 0x648(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQtnGoal*                              OriginalAmbushA;                                   // 0x650(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ThisRunHasCharacterEncounter;                      // 0x658(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4BF7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ATravelVolume_BP_C*                    TrialExitGate;                                     // 0x660(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFTUXManager_C*                        R_FTUXManager_0;                                   // 0x668(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UQtnGoalManager_MainStreet_C* GetDefaultObj();

