#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xC8 (0x640 - 0x578)
// BlueprintGeneratedClass QtnGoalManager_Downtown.QtnGoalManager_Downtown_C
class UQtnGoalManager_Downtown_C : public UQtnGoalManagerBase_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x578(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<TSoftClassPtr<class UQtnGoal>>        PossibleFeatsOfStrength_Day2_Soft;                 // 0x580(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                          FirstFOS;                                          // 0x590(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                          SecondFOS;                                         // 0x5A0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UQtnGoal*                              FirstRolledFOS;                                    // 0x5B0(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQtnGoal*                              SecondRolledFOS;                                   // 0x5B8(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                        DEBUG_SpokesToIgnore;                              // 0x5C0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UQtnGoal*                              PlaygroundGoal;                                    // 0x5D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQtnGoal*                              LeaveTrialGoal;                                    // 0x5D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UQtnGoal>>        PossibleBonusZones;                                // 0x5E0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UQtnGoal*                              BonusZoneGoal;                                     // 0x5F0(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UQtnGoal*>                      BonusZoneGoalsToIgnore;                            // 0x5F8(0x10)(Edit, BlueprintVisible, Net, DisableEditOnInstance, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_            DEBUGONLY_DevChangeFeats;                          // 0x608(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UClass*>                        Unique_Rolled_Goals;                               // 0x618(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         ThisRunHasCharacterEncounter;                      // 0x628(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6C5A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnGoal*                              PreFTUXGoal;                                       // 0x630(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATravelVolume_BP_C*                    TrialExitGate;                                     // 0x638(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UQtnGoalManager_Downtown_C* GetDefaultObj();

