#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x4A0 (0x578 - 0xD8)
// BlueprintGeneratedClass QtnGoalManagerBase.QtnGoalManagerBase_C
class UQtnGoalManagerBase_C : public UQtnGoalManagerBaseNative
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xD8(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UClass*>                        AllGoalClasses;                                    // 0xE0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                        ActiveGoalClasses;                                 // 0xF0(0x10)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UQtnGoal*>                      ActiveGoals;                                       // 0x100(0x10)(Edit, BlueprintVisible, Net, DisableEditOnInstance, ContainsInstancedReference)
	class ALootManagerActor_C*                   LootManagerActor;                                  // 0x110(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACutsceneManagerActor_C*               CutsceneManagerActor;                              // 0x118(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DEBUGONLY_FlushMissionProgress;                    // 0x120(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         DEBUG_LevelBP;                                     // 0x121(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6C28[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  DEBUGONLY_NextLevelNameDay1;                       // 0x124(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6C29[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          DEBUG_SpokeTags;                                   // 0x130(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         SpawnGlobalLoot;                                   // 0x140(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6C2B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UQtnGoal*>                      AllGoals;                                          // 0x148(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<enum class EQtnLootType_Enum, int32>    TodaysLevelLoot;                                   // 0x158(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ASkirmishBase_C*>               Skirmishes;                                        // 0x1A8(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class AQtnLevelLootSpawner_C*>        LevelLootSpawners;                                 // 0x1B8(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	TMap<enum class EQtnLootType_Enum, struct FVector2D> LevelLootTotals_Day1;                              // 0x1C8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                        LateJoinTeleportRadius;                            // 0x218(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        LateJoinTeleportAttempts;                          // 0x21C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            SpawnUpgradeStations;                              // 0x220(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UQtnGoal*>                      GoalsWithUpgraderOverrides;                        // 0x230(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ADayToggleManagerActor_C*              ToggleManagerActor;                                // 0x240(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                        RegisteredSummonCharacters;                        // 0x248(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                        RegisteredSummons;                                 // 0x258(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class UClass*>                        LOCAL_Goal_Rewards;                                // 0x268(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ATravelVolume_BP_C*>            AllTravelVolumes;                                  // 0x278(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_DeadPlayerTeleportLoc_C*>   AllDeadPlayerTeleports;                            // 0x288(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<enum class EQtnLootType_Enum, struct FVector2D> LevelLootTotals_Day2;                              // 0x298(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<enum class EQtnLootType_Enum, struct FVector2D> LevelLootTotals_Day3;                              // 0x2E8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                  DEBUGONLY_NextLevelNameDay2;                       // 0x338(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  DEBUGONLY_NextLevelNameDay3;                       // 0x340(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQtnStruct_ProgressPin>        CompletedProgressPins;                             // 0x348(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FQtnStruct_ProgressPin>        PotentialProgressPinsThisMap;                      // 0x358(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<enum class EQtnLootType_Enum, struct FVector2D> LevelLootTotals_Day4;                              // 0x368(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        ActualJokersSpawned;                               // 0x3B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6C34[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        JokerUpgradeLocations;                             // 0x3C0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FVector2D                             Arc1_numJokerUpgrades;                             // 0x3D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                          RegionsThisRun;                                    // 0x3D8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UGoalBase_C*>                   SpawnedGoals;                                      // 0x3E8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FVector2D                             Arc2_numJokerUpgrades;                             // 0x3F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             Arc3_numJokerUpgrades;                             // 0x400(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             Arc4_numJokerUpgrades;                             // 0x408(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             Arc5_numJokerUpgrades;                             // 0x410(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                          JokerUpgradeRegions;                               // 0x418(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        JokerUpgradeTally;                                 // 0x428(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SendLateJoinersToHost;                             // 0x42C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6C35[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  DEBUGONLY_NextLevelNameDay5;                       // 0x430(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AStandaloneJoker_UpgradeStation_BP_C*> AllStandaloneJokers;                               // 0x438(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                         LateJoin_GrantInvincibility;                       // 0x448(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6C37[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSoftClassPtr<class UGoalBase_C>>     ProgressPin_Estimate_Day1_Soft;                    // 0x450(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftClassPtr<class UGoalBase_C>>     ProgressPin_Estimate_Day2_Soft;                    // 0x460(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftClassPtr<class UGoalBase_C>>     ProgressPin_Estimate_Day3_Soft;                    // 0x470(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftClassPtr<class UGoalBase_C>>     ProgressPin_Estimate_Day4_Soft;                    // 0x480(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftClassPtr<class UGoalBase_C>>     ProgressPin_Estimate_Day5_Soft;                    // 0x490(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                        StartTime;                                         // 0x4A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DEBUGONLY_Is_Mid_Run;                              // 0x4A4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6C38[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  DEBUGONLY_NextLevelNameDay4;                       // 0x4A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<enum class EQtnLootType_Enum, struct FVector2D> LevelLootTotals_Day5;                              // 0x4B0(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  CurrentRejection;                                  // 0x500(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class UGoalBase_C*                           DEBUGONLY_LastGoalToReportRejection;               // 0x518(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnArcChangeEvent;                                  // 0x520(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FQtnRangedInt>                 NumJokerUpgrades;                                  // 0x530(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         R_playRulebookFTUX;                                // 0x540(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6C3B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CachedPlayerCount_RulebookFTUX;                    // 0x544(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         StopCheckingFTUXStatus_Rulebook;                   // 0x548(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         ThisRunHasFTUXRulebook;                            // 0x549(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6C3D[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AQtnPlayerPawn*>                ReportedPlayers_Rulebook;                          // 0x550(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	class ALoot_Rulebook_Parent_Frob_C*          FTUXRulebook;                                      // 0x560(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQtnGoal*                              FTUXRulebookGoal;                                  // 0x568(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFTUXManager_C*                        R_FTUXManager;                                     // 0x570(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UQtnGoalManagerBase_C* GetDefaultObj();

	void Spawn_FTUXRulebook_Server_Only(class UQtnGoal_Day1_CE_RulebookFTUX_C* K2Node_DynamicCast_AsQtn_Goal_Day_1_CE_Rulebook_FTUX, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue, const struct FTransform& CallFunc_GetTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ALoot_Rulebook_Parent_Frob_C* CallFunc_FinishSpawningActor_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsServer_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void Insert_Rulebook_FTUXGoal_Server_Only(bool CallFunc_IsServer_ReturnValue);
