#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x38 (0x60 - 0x28)
// Class QtnGame.QtnAchievementsManager
class UQtnAchievementsManager : public UObject
{
public:
	class UQtnGameInstance*                      M_pOwningGameInstance;                             // 0x28(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_10B8[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UDataTable*                            AchievementsDataTable;                             // 0x50(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                            UnlocksDataTable;                                  // 0x58(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAchievementsManager* GetDefaultObj();

};

// 0xB0 (0x300 - 0x250)
// Class QtnGame.QtnActorContentSlot
class AQtnActorContentSlot : public AActor
{
public:
	uint8                                        Pad_10BB[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bEnabled : 1;                                      // Mask: 0x1, PropSize: 0x10x258(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_A0 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_10BC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ContentType;                                       // 0x260(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AActor>                  DefaultActor;                                      // 0x270(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, TSoftClassPtr<class AActor>> ContentMap;                                        // 0x298(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	class AActor*                                CurrentActor;                                      // 0x2E8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            DebugDisplayEvent;                                 // 0x2F0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AQtnActorContentSlot* GetDefaultObj();

	void UseDefaultAppearance();
	void SetContent(class FString& ContentId);
	void ServerSetContent(class FString& ContentId);
	void OnDebugDisplay(class UQtnDebugWrapper* DebugWrapper);
	void OnContentSpawned(class AActor* NewActorObject);
	void MulticastSetContent(class FString& ContentId);
	void ClearContent();
};

// 0x58 (0x80 - 0x28)
// Class QtnGame.QtnActorPoolManager
class UQtnActorPoolManager : public UObject
{
public:
	TMap<TSubclassOf<class AQtnPoolableActor>, struct FQtnActorPool> M_WorldActorPools;                                 // 0x28(0x50)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_10D2[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnActorPoolManager* GetDefaultObj();

	void WarmUp_ServerOnly(class UObject* WorldContextObject, TSubclassOf<class AQtnPoolableActor> ActorClass, int32 Count);
	void Reclaim_ServerOnly(class AQtnPoolableActor* PActor);
	bool IsActorPoolingEnabled();
	class UQtnActorPoolManager* GetInstance(class UObject* PWorldReference);
	void Cleanup_ServerOnly();
	class AQtnPoolableActor* Acquire_ServerOnly(class UObject* WorldContextObject, TSubclassOf<class AQtnPoolableActor> ActorClass, struct FTransform& Transform, class AActor* Owner, class APawn* Instigator);
};

// 0x150 (0x178 - 0x28)
// Class QtnGame.QtnAIBarkManager
class UQtnAIBarkManager : public UObject
{
public:
	TArray<class UObject*>                       M_idleBarkInhibitors;                              // 0x28(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<class UClass*, float>                   M_nextClassExclusiveBarkTimes;                     // 0x38(0x50)(Transient, NativeAccessSpecifierPrivate)
	TMap<class FName, float>                     M_nextTagBarkTimes;                                // 0x88(0x50)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_10D8[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, float>                     M_barkInhibitionTimers;                            // 0x128(0x50)(Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnAIBarkManager* GetDefaultObj();

};

// 0x10 (0x260 - 0x250)
// Class QtnGame.QtnAIJobActorBaseNative
class AQtnAIJobActorBaseNative : public AActor
{
public:
	TArray<int32>                                ValidArcs;                                         // 0x250(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AQtnAIJobActorBaseNative* GetDefaultObj();

	bool IsJobActorViableNative(bool IsComponentEmploymentOpen);
};

// 0x100 (0x128 - 0x28)
// Class QtnGame.QtnAIJobCluster
class UQtnAIJobCluster : public UObject
{
public:
	class UQtnAIJobManager*                      M_pCachedJobManager;                               // 0x28(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, class UQtnAIJobRole*>      M_jobRoles;                                        // 0x30(0x50)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	bool                                         M_isClusterEmploymentOpen;                         // 0x80(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1133[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnAIJobComponent*                    OwningAIJobComponent;                              // 0x88(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  JobClusterID;                                      // 0x90(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBehaviorTree*                         JobBehavior;                                       // 0x98(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQtnAIJobFilter                       JobFilter;                                         // 0xA0(0x50)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	enum class EQtnSalaryTier                    SalaryTier;                                        // 0xF0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1135[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AutoEmploymentRange;                               // 0xF4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQtnRangedFloat                       AutoEmploymentCooldown;                            // 0xF8(0x8)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         IsCombatCluster;                                   // 0x100(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1137[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnAIEmployed;                                      // 0x108(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAIUnEmployed;                                    // 0x118(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAIJobCluster* GetDefaultObj();

	void SetClusterEmploymentOpen(bool WantEmploymentOpen);
	void QtnAIClusterEmployEvent__DelegateSignature(class UQtnAIJobRole* AiJobRole, class FName RoleID, class AQtnBodyController* AIController, class UBlackboardComponent* BlackboardComponent);
	bool IsClusterEmploymentOpen();
	bool IsAIJobClusterViable_ServerOnly(class AQtnPawn* Pawn, bool ForInitialAdoption);
	class UQtnAIJobRole* GetJobRole(class FName JobRoleID);
	void GetCurrentlyEmployedJobRoles(TArray<class UQtnAIJobRole*>* EmployedJobRoles);
	void GetAllJobRoles(TArray<class UQtnAIJobRole*>* JobRoles);
	float GetAIJobClusterHeuristic(class AQtnPawn* UnemployedPawn);
	class UQtnAIJobRole* AddJobRole(class FName JobRoleID, struct FQtnAIJobRoleDefinition& JobRoleDef);
};

// 0x188 (0x3B0 - 0x228)
// Class QtnGame.QtnAIJobComponent
class UQtnAIJobComponent : public USceneComponent
{
public:
	class UQtnAIJobManager*                      M_pCachedJobManager_ServerOnly;                    // 0x228(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, class UQtnAIJobCluster*>   M_combatJobClusters;                               // 0x230(0x50)(ExportObject, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class UQtnAIJobCluster*>   M_ambientJobClusters;                              // 0x280(0x50)(ExportObject, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                         M_isComponentEmploymentOpen;                       // 0x2D0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_haveDefaultClustersBeenAdded_ServerOnly;         // 0x2D1(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1194[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AQtnBodyPawn*>                  M_employedBodies;                                  // 0x2D8(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                         StartComponentWithOpenEmployment;                  // 0x2E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1196[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, struct FQtnAIJobClusterDefinition> CombatJobClusters;                                 // 0x2F0(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, struct FQtnAIJobClusterDefinition> AmbientJobClusters;                                // 0x340(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAIEmployed;                                      // 0x390(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAIUnEmployed;                                    // 0x3A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAIJobComponent* GetDefaultObj();

	void SetComponentEmploymentOpen(bool WantEmploymentOpen);
	void QtnAIEmployEvent__DelegateSignature(class UQtnAIJobRole* AiJobRole, class FName ClusterID, class FName RoleID, class AQtnBodyController* AIController, class UBlackboardComponent* BlackboardComponent, bool IsCombatJob);
	bool IsComponentEmploymentOpen();
	bool IsAIJobViable_ServerOnly(class AQtnPawn* Pawn, bool ForInitialAdoption);
	class UQtnAIJobCluster* GetJobCluster(class FName JobClusterID, bool ForCombat);
	TArray<class AQtnBodyPawn*> GetEmployedBodies_ServerOnly();
	void GetCurrentlyEmployedJobRoles(TArray<class UQtnAIJobRole*>* EmployedJobRoles, bool ForCombat);
	void GetAllJobRoles(TArray<class UQtnAIJobRole*>* JobRoles, bool ForCombat);
	void GetAllJobClusters(TArray<class UQtnAIJobCluster*>* JobClusters, bool ForCombat);
	class UQtnAIJobCluster* AddJobCluster(class FName JobClusterID, bool ForCombat, struct FQtnAIJobClusterDefinition& JobClusterDefinition);
};

// 0x0 (0x3B0 - 0x3B0)
// Class QtnGame.QtnAIJobComponentBaseNative
class UQtnAIJobComponentBaseNative : public UQtnAIJobComponent
{
public:

	static class UClass* StaticClass();
	static class UQtnAIJobComponentBaseNative* GetDefaultObj();

};

// 0x130 (0x158 - 0x28)
// Class QtnGame.QtnAIJobManager
class UQtnAIJobManager : public UObject
{
public:
	TArray<class UQtnAIJobComponent*>            M_knownAIJobComponents;                            // 0x28(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	int32                                        M_aiJobComponentIndex;                             // 0x38(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_119C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AQtnBodyController*>            M_knownBodyControllers;                            // 0x40(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	int32                                        M_bodyControllerIndex;                             // 0x50(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_119D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AQtnBodyController*>            M_pendingCombatJobSeekers;                         // 0x58(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class AQtnBodyController*>            M_pendingAmbientJobSeekers;                        // 0x68(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UQtnAIJobRole*>                 M_openAmbientJobRoles;                             // 0x78(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UQtnAIJobRole*>                 M_openCombatJobRoles;                              // 0x88(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FQtnAIJobBoard>                M_openCombatJobBoards;                             // 0x98(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FQtnAIJobBoard>                M_openAmbientJobBoards;                            // 0xA8(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UQtnAIJobCluster>, int32> JobClusterTickets;                                 // 0xB8(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UQtnAIJobCluster>, struct FQtnAIJobClusterTicketRecord> M_jobClusterTicketRecords;                         // 0x108(0x50)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnAIJobManager* GetDefaultObj();

};

// 0x58 (0x80 - 0x28)
// Class QtnGame.QtnAIJobRole
class UQtnAIJobRole : public UObject
{
public:
	class UQtnAIJobManager*                      M_pCachedJobManager;                               // 0x28(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnBodyController*                    M_pEmployedAIController;                           // 0x30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnBodyController*                    M_pPendingAIController;                            // 0x38(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_nextEmploymentAllowedTime;                       // 0x40(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_isRoleEmploymentOpen;                            // 0x44(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_11CC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  JobRoleID;                                         // 0x4C(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11CD[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnAIJobCluster*                      OwningAIJobCluster;                                // 0x58(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAIEmployed;                                      // 0x60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAIUnEmployed;                                    // 0x70(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAIJobRole* GetDefaultObj();

	void SetRoleEmploymentOpen(bool WantEmploymentOpen);
	bool RequestAIUnEmployment();
	void QtnAIRoleEmployEvent__DelegateSignature(class AQtnBodyController* AIController, class UBlackboardComponent* BlackboardComponent);
	bool IsRoleEmploymentOpen();
	bool IsAIJobRoleViable_ServerOnly(class AQtnPawn* Pawn, bool ForInitialAdoption);
	class AActor* GetOwningActor_ServerOnly();
	class AQtnBodyPawn* GetEmployedBodyPawn();
	class AQtnBodyController* GetEmployedBodyController();
	class UBlackboardComponent* GetEmployedBlackboard();
	bool ForceAIEmployment(class AQtnBodyController* AIController);
};

// 0x48 (0x70 - 0x28)
// Class QtnGame.QtnAINoiseFX
class UQtnAINoiseFX : public UObject
{
public:
	bool                                         M_bIsActive;                                       // 0x28(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_11D9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AQtnPawn*                              M_pNoiseCulpritPawn;                               // 0x30(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                M_pNoisyActor;                                     // 0x38(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_noiseOrigin;                                     // 0x40(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_nextPlayNoiseTime;                               // 0x4C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsLooping;                                        // 0x50(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11DC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeBetweenNoises;                                 // 0x54(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnNoiseEnum                     NoiseType;                                         // 0x58(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11DF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnNoiseConfig                       CustomNoiseConfig;                                 // 0x5C(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_11E0[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAINoiseFX* GetDefaultObj();

};

// 0x160 (0x320 - 0x1C0)
// Class QtnGame.QtnAIPerceptionComponent
class UQtnAIPerceptionComponent : public UAIPerceptionComponent
{
public:
	class AQtnBodyController*                    M_pOwningController;                               // 0x1C0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class AQtnPawn*, struct FQtnPerceptionInfo> M_pawnPerceptions;                                 // 0x1C8(0x50)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class AQtnPawn*, float>                 M_psychicAwareness;                                // 0x218(0x50)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FQtnPerceptionConfig                  PerceptionConfig;                                  // 0x268(0x44)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	float                                        MinVisibilityRatioPerception;                      // 0x2AC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_usePerceptionOverride;                           // 0x2B0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1219[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnPerceptionConfig                  M_perceptionOverride;                              // 0x2B4(0x44)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                        M_nonPawnTargets;                                  // 0x2F8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class FName                                  AggregationKey;                                    // 0x308(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RoundRobinBucketSize;                              // 0x310(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_121D[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAIPerceptionComponent* GetDefaultObj();

	bool IsObstructedByDeepSnow(class AQtnPawn* OtherPawn);
	void HandleTargetPerceptionUpdated(class AActor* PActor, const struct FAIStimulus& Stimulus);
	void GetPerceivedLocation(class AQtnPawn* OtherPawn, enum class EQtnSensoryEvidenceCategory SenseCategory, struct FVector* PerceivedLocation, float* AwarenessRatio);
	void GetAllKnownEnemies(TArray<class AQtnPawn*>* KnownEnemies);
};

// 0x0 (0x130 - 0x130)
// Class QtnGame.QtnAIPerceptionSystem
class UQtnAIPerceptionSystem : public UAIPerceptionSystem
{
public:

	static class UClass* StaticClass();
	static class UQtnAIPerceptionSystem* GetDefaultObj();

};

// 0x70 (0xF0 - 0x80)
// Class QtnGame.QtnAISense_Hearing
class UQtnAISense_Hearing : public UAISense
{
public:
	TArray<struct FQtnAINoiseEvent>              M_pendingNoiseEvents;                              // 0x80(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	float                                        M_cachedSpeedOfSoundReciprocal;                    // 0x90(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1232[0x54];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SpeedOfSound;                                      // 0xE8(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttenuationSilenceThreshold;                       // 0xEC(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAISense_Hearing* GetDefaultObj();

};

// 0x10 (0x58 - 0x48)
// Class QtnGame.QtnAISenseConfig_Hearing
class UQtnAISenseConfig_Hearing : public UAISenseConfig
{
public:
	TSubclassOf<class UQtnAISense_Hearing>       Implementation;                                    // 0x48(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HearingRange;                                      // 0x50(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAISenseAffiliationFilter             DetectionByAffiliation;                            // 0x54(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAISenseConfig_Hearing* GetDefaultObj();

};

// 0xD0 (0x200 - 0x130)
// Class QtnGame.QtnAISystem
class UQtnAISystem : public UAISystem
{
public:
	uint8                                        Pad_124E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UWorld*                                M_pWorld;                                          // 0x138(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnGameInstance*                      M_pGameInstance;                                   // 0x140(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnGameState*                         M_pGameState;                                      // 0x148(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                       M_aiCognitionInhibitors;                           // 0x150(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	int32                                        CorpsePopulationCap;                               // 0x160(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1252[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AQtnBodyPawn*>                  M_registeredAICorpses;                             // 0x168(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UQtnAISystemSettings*                  M_pAISystemSettings;                               // 0x178(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1253[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnPatrolManager*                     M_pPatrolManager;                                  // 0x1D0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnTicketManager*                     M_pTicketManager;                                  // 0x1D8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnAIBarkManager*                     M_pAIBarkManager;                                  // 0x1E0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnAIJobManager*                      M_pAIJobManager;                                   // 0x1E8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnAllyBotManager*                    M_pAllyBotManager;                                 // 0x1F0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnDangerManager*                     M_pDangerManager;                                  // 0x1F8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAISystem* GetDefaultObj();

	void RemoveAICognitionInhibitor(class UObject* Inhibitor);
	class UQtnAISystem* GetQtnAISystem_ServerOnly(class UObject* WorldContextObject);
	void AddAICognitionInhibitor(class UObject* Inhibitor);
};

// 0x20 (0x48 - 0x28)
// Class QtnGame.QtnAISystemSettings
class UQtnAISystemSettings : public UObject
{
public:
	TSubclassOf<class UQtnAIJobManager>          AIJobManagerClass;                                 // 0x28(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQtnRangedFloat                       ThreatLevelRange;                                  // 0x30(0x8)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                             NeglectDistance;                                   // 0x38(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQtnAllyBotManager>        AllyBotManagerClass;                               // 0x40(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAISystemSettings* GetDefaultObj();

};

// 0x70 (0x98 - 0x28)
// Class QtnGame.QtnAllyBotManager
class UQtnAllyBotManager : public UObject
{
public:
	class AQtnGameState*                         M_pOwningGameState;                                // 0x28(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UQtnHintVolumeComponent*>       M_deepSnowVolumes;                                 // 0x30(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class AQtnBodyPawn*>                  M_spawnedBots;                                     // 0x40(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class AQtnBodyPawn*                          M_currentRequestingBody;                           // 0x50(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AQtnBodyPawn*>                  M_pendingRequestingBodies;                         // 0x58(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                       M_allyBotInhibitors;                               // 0x68(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UQtnNavigationSystem*                  M_pNavSys;                                         // 0x78(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12A2[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        M_currentDeepSnowIndex;                            // 0x90(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                       M_asyncQueryID;                                    // 0x94(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnAllyBotManager* GetDefaultObj();

	class AQtnBodyPawn* SpawnAllyBot_ServerOnly(TSubclassOf<class AQtnBodyPawn> botClass, const struct FVector& Location, struct FRotator& Rotation);
	void RequestPathableDeepSnow_ServerOnly(class AQtnBodyPawn* RequestingBody);
	void RemoveAllyBotInhibitor_ServerOnly(class UObject* Inhibitor);
	void OnToggleBots(bool Inhibited);
	void OnInitAllyBotManager_ServerOnly(class AQtnGameState* OwningGameState);
	void OnDeepSnowRequestComplete(bool Success, class AQtnBodyPawn* RequestingBody, struct FVector& DeepSnowLocation);
	void OnDebugDisplay(class UQtnDebugWrapper* DebugWrapper);
	void OnBotDestroy(class AQtnBodyPawn* DestroyedBot);
	void HandleBotDestroyed(class AActor* PDestroyedActor);
	TArray<class AQtnBodyPawn*> GetSpawnedBots_ServerOnly();
	class AQtnGameState* GetOwningGameState();
	class UQtnAllyBotManager* GetAllyBotManager_ServerOnly(class UObject* WorldContextObject);
	bool AreAllyBotsInhibited();
	bool AreAllyBotsInCombat();
	void AddAllyBotInhibitor_ServerOnly(class UObject* Inhibitor);
};

// 0x0 (0x38 - 0x38)
// Class QtnGame.QtnAnimNotify
class UQtnAnimNotify : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UQtnAnimNotify* GetDefaultObj();

	void OnVerbNotify(class AQtnPawn* AffectedPawn, class UQtnVerb* EncompassingVerb);
};

// 0x10 (0x68 - 0x58)
// Class QtnGame.QtnAnimNotify_PlaySound
class UQtnAnimNotify_PlaySound : public UAnimNotify_PlaySound
{
public:
	float                                        M_lastTriggerTime;                                 // 0x58(0x4)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        RetriggerDelay;                                    // 0x5C(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         LocalPlayerOnly;                                   // 0x60(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         RequirePlayerControl;                              // 0x61(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12B0[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAnimNotify_PlaySound* GetDefaultObj();

};

// 0x30 (0x68 - 0x38)
// Class QtnGame.QtnAnimNotifyBeginEffect
class UQtnAnimNotifyBeginEffect : public UAnimNotify
{
public:
	TSubclassOf<class AQtnFXActor>               FxClass;                                           // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LocationOverride;                                  // 0x40(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RotationOverride;                                  // 0x4C(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                  SocketOverride;                                    // 0x58(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAttachmentRule                   LocationRule;                                      // 0x60(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAttachmentRule                   RotationRule;                                      // 0x61(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAttachmentRule                   ScaleRule;                                         // 0x62(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12B6[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAnimNotifyBeginEffect* GetDefaultObj();

};

// 0x30 (0x60 - 0x30)
// Class QtnGame.QtnAnimNotifyDurationEffect
class UQtnAnimNotifyDurationEffect : public UAnimNotifyState
{
public:
	TSubclassOf<class AQtnFXActor>               FxClass;                                           // 0x30(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LocationOverride;                                  // 0x38(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RotationOverride;                                  // 0x44(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                  SocketOverride;                                    // 0x50(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAttachmentRule                   LocationRule;                                      // 0x58(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAttachmentRule                   RotationRule;                                      // 0x59(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAttachmentRule                   ScaleRule;                                         // 0x5A(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12BB[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAnimNotifyDurationEffect* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class QtnGame.QtnAnimNotifyEndEffect
class UQtnAnimNotifyEndEffect : public UAnimNotify
{
public:
	TSubclassOf<class AQtnFXActor>               FxClass;                                           // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAnimNotifyEndEffect* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class QtnGame.QtnAnimNotifyEvent
class UQtnAnimNotifyEvent : public UQtnAnimNotify
{
public:
	struct FGameplayTag                          M_eventType;                                       // 0x38(0x8)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAnimNotifyEvent* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class QtnGame.QtnAnimNotifyItemAction
class UQtnAnimNotifyItemAction : public UQtnAnimNotify
{
public:
	enum class EQtnEquipSlot                     EquipSlot;                                         // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnItemUseAction                 UseAction;                                         // 0x39(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12C8[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAnimNotifyItemAction* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class QtnGame.QtnAnimNotifyItemEquip
class UQtnAnimNotifyItemEquip : public UQtnAnimNotify
{
public:
	enum class EQtnEquipSlot                     EquipSlot;                                         // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12CE[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAnimNotifyItemEquip* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class QtnGame.QtnAnimNotifyItemUnEquip
class UQtnAnimNotifyItemUnEquip : public UQtnAnimNotify
{
public:
	enum class EQtnEquipSlot                     EquipSlot;                                         // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12D3[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAnimNotifyItemUnEquip* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class QtnGame.QtnAnimNotifyRagdoll
class UQtnAnimNotifyRagdoll : public UQtnAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UQtnAnimNotifyRagdoll* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class QtnGame.QtnAnimNotifyVO
class UQtnAnimNotifyVO : public UQtnAnimNotify
{
public:
	class FName                                  M_voEvent;                                         // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          M_voEventType;                                     // 0x40(0x8)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAnimNotifyVO* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class QtnGame.QtnAnimWindow
class UQtnAnimWindow : public UAnimNotifyState
{
public:

	static class UClass* StaticClass();
	static class UQtnAnimWindow* GetDefaultObj();

	void OnVerbWindowEnd(class AQtnPawn* AffectedPawn, class UQtnVerb* EncompassingVerb, bool Interrupted);
	void OnVerbWindowBegin(class AQtnPawn* AffectedPawn, class UQtnVerb* EncompassingVerb, float TotalDuration);
};

// 0x8 (0x38 - 0x30)
// Class QtnGame.QtnAnimWindowAITrackingImmunity
class UQtnAnimWindowAITrackingImmunity : public UQtnAnimWindow
{
public:
	float                                        LingerDuration;                                    // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_130F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAnimWindowAITrackingImmunity* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class QtnGame.QtnAnimWindowAllowCancel
class UQtnAnimWindowAllowCancel : public UQtnAnimWindow
{
public:

	static class UClass* StaticClass();
	static class UQtnAnimWindowAllowCancel* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class QtnGame.QtnAnimWindowBlock
class UQtnAnimWindowBlock : public UQtnAnimWindow
{
public:
	struct FQtnRangedFloat                       ScaledBlockAngle;                                  // 0x30(0x8)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	float                                        BlockScaleDistance;                                // 0x38(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1315[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAnimWindowBlock* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class QtnGame.QtnAnimWindowDamageImmunity
class UQtnAnimWindowDamageImmunity : public UQtnAnimWindow
{
public:
	TArray<TSubclassOf<class UQtnDamageType>>    DamageImmunities;                                  // 0x30(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAnimWindowDamageImmunity* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class QtnGame.QtnAnimWindowInput
class UQtnAnimWindowInput : public UQtnAnimWindow
{
public:

	static class UClass* StaticClass();
	static class UQtnAnimWindowInput* GetDefaultObj();

};

// 0x58 (0x88 - 0x30)
// Class QtnGame.QtnAnimWindowMelee
class UQtnAnimWindowMelee : public UQtnAnimWindow
{
public:
	float                                        DamageMultiplier;                                  // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        KnockbackMultiplier;                               // 0x34(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnAttackMotion                  AttackMotion;                                      // 0x38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnWeaponSocketLocation          WeaponSocketLocation;                              // 0x39(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1324[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  MeleeSocketBaseName;                               // 0x3C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  MeleeSocketTipName;                                // 0x44(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ColliderRadius;                                    // 0x4C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UseActorSpaceMath;                                 // 0x50(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1327[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               BaseSocketOffset;                                  // 0x54(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               TipSocketOffset;                                   // 0x60(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  FXSetKey;                                          // 0x6C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnHitStopResponse               HitStopResponse;                                   // 0x74(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CausesKnockdown;                                   // 0x75(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1329[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        KnockdownDuration;                                 // 0x78(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CanBeParried;                                      // 0x7C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CanBeBlocked;                                      // 0x7D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1332[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SharedMeleeIndex;                                  // 0x80(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1334[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAnimWindowMelee* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class QtnGame.QtnAnimWindowParry
class UQtnAnimWindowParry : public UQtnAnimWindow
{
public:
	struct FQtnRangedFloat                       ScaledParryAngle;                                  // 0x30(0x8)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	float                                        ParryScaleDistance;                                // 0x38(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1340[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAnimWindowParry* GetDefaultObj();

};

// 0x90 (0xC0 - 0x30)
// Class QtnGame.QtnAnimWindowRotation
class UQtnAnimWindowRotation : public UQtnAnimWindow
{
public:
	float                                        MaxRotation;                                       // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1343[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    RotationCurve;                                     // 0x38(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAnimWindowRotation* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class QtnGame.QtnAnimWindowTransition
class UQtnAnimWindowTransition : public UQtnAnimWindow
{
public:

	static class UClass* StaticClass();
	static class UQtnAnimWindowTransition* GetDefaultObj();

};

// 0x1B8 (0x1E8 - 0x30)
// Class QtnGame.QtnAnimWindowTranslation
class UQtnAnimWindowTranslation : public UQtnAnimWindow
{
public:
	float                                        TranslationDistanceForward;                        // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_134B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    TranslationCurveForward;                           // 0x38(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	float                                        DistanceMultiplierWithoutTarget;                   // 0xC0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TranslationDistanceUp;                             // 0xC4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                    TranslationCurveUp;                                // 0xC8(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	float                                        TranslationDistanceRight;                          // 0x150(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_134F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    TranslationCurveRight;                             // 0x158(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	float                                        StrikingDistance;                                  // 0x1E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         TrackTargetZ;                                      // 0x1E4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1351[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAnimWindowTranslation* GetDefaultObj();

};

// 0x28 (0x4A0 - 0x478)
// Class QtnGame.QtnAssetManager
class UQtnAssetManager : public UAssetManager
{
public:
	int32                                        LastInitialChunkId;                                // 0x478(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_135E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class UQtnPakChunk>>      PakChunkArchetypes;                                // 0x480(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FQtnDLCPakChunkArray>          DLCPakChunkArrays;                                 // 0x490(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnAssetManager* GetDefaultObj();

	bool IsFullGameInstalled();
};

// 0x40 (0x70 - 0x30)
// Class QtnGame.QtnAsyncInterpolateValue
class UQtnAsyncInterpolateValue : public UBlueprintAsyncActionBase
{
public:
	class UObject*                               WorldContext;                                      // 0x30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_136F[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_StartValue;                                      // 0x40(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_TargetValue;                                     // 0x44(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_RunTime;                                         // 0x48(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_CurrentRunTime;                                  // 0x4C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_            Tick;                                              // 0x50(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            Completed;                                         // 0x60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAsyncInterpolateValue* GetDefaultObj();

	void TickTask();
	void QtnFloatOutputPin__DelegateSignature(float Value);
	void CompleteTask();
	class UQtnAsyncInterpolateValue* AsyncInterpolateValue(class UObject* WorldContextObject, float StartValue, float TargetValue, float Duration, struct FTimerHandle& OptionalTimerHandle);
};

// 0x40 (0x70 - 0x30)
// Class QtnGame.QtnAsyncInterpolateValueRealtime
class UQtnAsyncInterpolateValueRealtime : public UBlueprintAsyncActionBase
{
public:
	class UObject*                               WorldContext;                                      // 0x30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1387[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_StartValue;                                      // 0x40(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_TargetValue;                                     // 0x44(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_RunTime;                                         // 0x48(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_CurrentRunTime;                                  // 0x4C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_            Tick;                                              // 0x50(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            Completed;                                         // 0x60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAsyncInterpolateValueRealtime* GetDefaultObj();

	bool TickTask(float Delta);
	void QtnFloatOutputPin__DelegateSignature(float Value);
	void CompleteTask();
	class UQtnAsyncInterpolateValueRealtime* AsyncInterpolateValueRealtime(class UObject* WorldContextObject, float StartValue, float TargetValue, float Duration, struct FDelegateHandleBlueprint& OptionalHandle);
};

// 0x0 (0x28 - 0x28)
// Class QtnGame.DelegateHandleBlueprintLibrary
class UDelegateHandleBlueprintLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UDelegateHandleBlueprintLibrary* GetDefaultObj();

	void ClearAndInvalidateDelegateHandleBlueprint(struct FDelegateHandleBlueprint& Handle, class UObject* WorldContextObject);
};

// 0x28 (0x58 - 0x30)
// Class QtnGame.QtnAsyncWaitUntilMaterialFullyStreamed
class UQtnAsyncWaitUntilMaterialFullyStreamed : public UBlueprintAsyncActionBase
{
public:
	class UObject*                               WorldContext;                                      // 0x30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1398[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInterface*                    M_pTargetMaterial;                                 // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_            Completed;                                         // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAsyncWaitUntilMaterialFullyStreamed* GetDefaultObj();

	void TickTask();
	void QtnExecuteOutputPin__DelegateSignature();
	void CompleteTask();
	class UQtnAsyncWaitUntilMaterialFullyStreamed* AsyncWaitUntilMaterialFullyStreamed(class UObject* WorldContextObject, class UMaterialInterface* TargetMaterial, struct FTimerHandle& OptionalTimerHandle);
};

// 0xA8 (0xD0 - 0x28)
// Class QtnGame.QtnAttribute
class UQtnAttribute : public UObject
{
public:
	uint8                                        Pad_13B3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        R_currentValue;                                    // 0x2C(0x4)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_oldValue;                                        // 0x30(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        R_currentMin;                                      // 0x34(0x4)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        R_currentMax;                                      // 0x38(0x4)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_locked;                                          // 0x3C(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_13B4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               M_pOwningObject;                                   // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnBodyPawn*                          M_pAffectedBody;                                   // 0x48(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_nextTickTime;                                    // 0x50(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_13B5[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                M_pReferenceActor;                                 // 0x60(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  M_name;                                            // 0x68(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                        M_defaultValue;                                    // 0x80(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnAttributeRounding             M_rounding;                                        // 0x84(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnAttributeReplication          M_replication;                                     // 0x85(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnAttributeTick                 M_tick;                                            // 0x86(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13B7[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_tickRate;                                        // 0x88(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_clampMin;                                        // 0x8C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13B8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_defaultMin;                                      // 0x90(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_clampMax;                                        // 0x94(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13B9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_defaultMax;                                      // 0x98(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_useModifiedValuesForEvents;                      // 0x9C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13BA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FQtnAttributeTrigger>          M_triggers;                                        // 0xA0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnValueChangedEvent;                               // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAttributePreRemovedEvent;                        // 0xC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAttribute* GetDefaultObj();

	float OverrideSetCurrentValue(float NewValue);
	void OnTriggerHit(int32 Index, float Threshold, enum class EQtnAttributeThresholdDirection Direction);
	void OnTick(float DeltaTime);
	void OnRep_CurrentValue();
	void OnRemoved();
	void OnIncreased(float AmountIncreased);
	void OnDecreased(float AmountDecreased);
	void OnAdded();
	void HasAuthority(enum class EQtnOutputAuthorityEnum* OutputPin);
	void GetRange(bool UseDefaultRange, float* MinValue, float* MaxValue);
	class UObject* GetOwningObject();
	TScriptInterface<class IQtnAttributeContainerInterface> GetOwningInterface();
	float GetCurrentValue(bool ApplyModifiers);
	float GetCurrentRatio(bool ApplyModifiers);
	class AQtnBodyPawn* GetAffectedBody();
};

// 0x2A0 (0x380 - 0xE0)
// Class QtnGame.QtnAttributeComponent
class UQtnAttributeComponent : public UActorComponent
{
public:
	uint8                                        Pad_13C7[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnAttributeContainer                R_attributeContainer;                              // 0xF0(0x258)(Edit, Net, DisableEditOnInstance, RepNotify, NativeAccessSpecifierPrivate)
	bool                                         M_areAttributesSafeToTick;                         // 0x348(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13C8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnAttributeAddedEvent;                             // 0x350(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAttributeRemovedEvent;                           // 0x360(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            DebugDisplayEvent;                                 // 0x370(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAttributeComponent* GetDefaultObj();

	void OnRep_AttributeContainer();
	void OnDebugDisplay(class UQtnDebugWrapper* DebugWrapper);
};

// 0x0 (0x28 - 0x28)
// Class QtnGame.QtnAttributeContainerInterface
class IQtnAttributeContainerInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IQtnAttributeContainerInterface* GetDefaultObj();

	void UnTriggerModifierEvent(TSubclassOf<class UQtnAttributeModifierEvent> AttributeModifierEvent);
	void UnlockAttribute(TSubclassOf<class UQtnAttribute> Attribute);
	void TriggerModifierEvent(TSubclassOf<class UQtnAttributeModifierEvent> AttributeModifierEvent);
	void SetAttributeValue(TSubclassOf<class UQtnAttribute> Attribute, float Value);
	void SetAttributeMin(TSubclassOf<class UQtnAttribute> Attribute, float NewMin);
	void SetAttributeMax(TSubclassOf<class UQtnAttribute> Attribute, float NewMax);
	void RemoveModifier(TSubclassOf<class UQtnAttributeModifier> Modifier);
	void RemoveAttribute(TSubclassOf<class UQtnAttribute> Attribute);
	void OnAttributeRemoved(TSubclassOf<class UQtnAttribute> AttributeClass, class UQtnAttribute* Attribute);
	void OnAttributeAdded(TSubclassOf<class UQtnAttribute> AttributeClass, class UQtnAttribute* Attribute);
	void LockAttribute(TSubclassOf<class UQtnAttribute> Attribute);
	bool IsModifierEventActive(TSubclassOf<class UQtnAttributeModifierEvent> AttributeModifierEvent);
	void IncreaseAttributeValue(TSubclassOf<class UQtnAttribute> Attribute, float Amount);
	bool HasModifier(TSubclassOf<class UQtnAttributeModifier> Modifier);
	bool HasDefaultAttribute(TSubclassOf<class UQtnAttribute> Attribute);
	bool HasAttribute(TSubclassOf<class UQtnAttribute> Attribute);
	class AActor* GetReferenceActor();
	float GetDefaultAttributeValue(TSubclassOf<class UQtnAttribute> Attribute);
	float GetAttributeValue(TSubclassOf<class UQtnAttribute> Attribute, bool ApplyModifiers);
	TArray<class UQtnAttribute*> GetAttributes(TArray<TSubclassOf<class UQtnAttribute>>& Attributes);
	struct FQtnRangedFloat GetAttributeRange(TSubclassOf<class UQtnAttribute> Attribute, bool* ClampedMin, bool* ClampedMax);
	float GetAttributeMin(TSubclassOf<class UQtnAttribute> Attribute);
	float GetAttributeMax(TSubclassOf<class UQtnAttribute> Attribute);
	TSubclassOf<class UQtnAttribute> GetAttributeClassByName(class FName AttributeName);
	class UQtnAttribute* GetAttribute(TSubclassOf<class UQtnAttribute> Attribute);
	TArray<class UQtnAttribute*> GetAllAttributes();
	void DecreaseAttributeValue(TSubclassOf<class UQtnAttribute> Attribute, float Amount);
	float ApplyModifiersToEnumAttributeValue(enum class EQtnAttributeEnum EnumAttribute, float Value);
	float ApplyModifiersToAttributeValue(TSubclassOf<class UQtnAttribute> Attribute, float Value);
	void AdjustAttributeValue(TSubclassOf<class UQtnAttribute> Attribute, float Amount);
	void AddModifier(TSubclassOf<class UQtnAttributeModifier> Modifier);
	class UQtnAttribute* AddAttribute(TSubclassOf<class UQtnAttribute> Attribute);
};

// 0x8 (0xD8 - 0xD0)
// Class QtnGame.QtnAttributeHitReactionThreshold
class UQtnAttributeHitReactionThreshold : public UQtnAttribute
{
public:
	float                                        RecoveryRate;                                      // 0xD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ShowLog;                                           // 0xD4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14A8[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAttributeHitReactionThreshold* GetDefaultObj();

};

// 0x20 (0x48 - 0x28)
// Class QtnGame.QtnAttributeModifier
class UQtnAttributeModifier : public UObject
{
public:
	TSubclassOf<class UQtnAttributeModifierEvent> M_event;                                           // 0x28(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQtnAttribute>             M_attribute;                                       // 0x30(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnAttributeEnum                 M_enumAttribute;                                   // 0x38(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnAttributeModifierFunction     M_function;                                        // 0x39(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14B1[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_value;                                           // 0x3C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnAttributeModifierReplication  M_replication;                                     // 0x40(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14B3[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAttributeModifier* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class QtnGame.QtnAttributeModifierEvent
class UQtnAttributeModifierEvent : public UObject
{
public:
	enum class EQtnAttributeModifierEventReplication M_replication;                                     // 0x28(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14BA[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnAttributeModifierEvent* GetDefaultObj();

};

// 0x10 (0xE0 - 0xD0)
// Class QtnGame.QtnAttributePinkEye
class UQtnAttributePinkEye : public UQtnAttribute
{
public:
	float                                        ReducePinkEyePerSecond;                            // 0xD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14C1[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UQtnStatusEffect>          StatusEffect;                                      // 0xD8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAttributePinkEye* GetDefaultObj();

};

// 0x70 (0x2D0 - 0x260)
// Class QtnGame.QtnAttributePipWidget
class UQtnAttributePipWidget : public UUserWidget
{
public:
	class UMaterialInstanceDynamic*              M_pAttributePipMaterial;                           // 0x260(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UQtnAttribute*                         M_pAssociatedAttribute;                            // 0x268(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bHasMetAttributeThreshold;                       // 0x270(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bIsVisible;                                      // 0x271(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14E1[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  M_AttributeRadialPropertyName;                     // 0x274(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  M_AttributeBGColorPropertyName;                    // 0x27C(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  M_AttributeIconFlipbookPropertyName;               // 0x284(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  M_IsActivePropertyName;                            // 0x28C(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  M_IconColorPropertyName;                           // 0x294(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14E4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnRequestVisibilityEvent;                          // 0x2A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnClearVisibilityEvent;                            // 0x2B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRequestRemovalEvent;                             // 0x2C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnAttributePipWidget* GetDefaultObj();

	void QtnAttributePipWidgetEvent__DelegateSignature(class UQtnAttributePipWidget* SourceWidget);
	void QtnAttributePipClassWidgetEvent__DelegateSignature(class UQtnAttributePipWidget* SourceWidget, TSubclassOf<class UQtnAttribute> AttributeClass);
	void OnAttributeValueMetThreshold(class UQtnAttribute* Attribute, float Value);
	void OnAttributeValueDepleted(class UQtnAttribute* Attribute, float Value);
	void OnAttributeValueChanged(class UQtnAttribute* Attribute, float Value);
	void OnAttributeRemoved(class UQtnAttribute* Attribute);
	void InitializeAttributePipWidget(struct FQtnAttributePipInitializationParameters& InitializationParameters);
	class UQtnAttribute* GetAssociatedAttribute();
};

// 0x8 (0xD8 - 0xD0)
// Class QtnGame.QtnAttributeRage
class UQtnAttributeRage : public UQtnAttribute
{
public:
	bool                                         R_Upgrade_Ragaholic;                               // 0xD0(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_14FB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        R_Ragaholic_Scaler;                                // 0xD4(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnAttributeRage* GetDefaultObj();

	void SetUpgrade_Ragaholic(bool NewValue);
	void SetRagaholic_Scaler(float NewValue);
	bool GetUpgrade_Ragaholic();
	float GetRagaholic_Scaler();
};

// 0x28 (0xF8 - 0xD0)
// Class QtnGame.QtnAttributeStamina
class UQtnAttributeStamina : public UQtnAttribute
{
public:
	float                                        ExhaustionDuration;                                // 0xD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RegenPerSecondDuringVerb;                          // 0xD4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RegenPerSecondWhileIdle;                           // 0xD8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExhaustionTimer;                                   // 0xDC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnStaminaChanged;                                  // 0xE0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AQtnBodyPawn*                          M_owningBodyPawn;                                  // 0xF0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnAttributeStamina* GetDefaultObj();

};

// 0x20 (0x100 - 0xE0)
// Class QtnGame.QtnAuraComponent
class UQtnAuraComponent : public UActorComponent
{
public:
	class AQtnPawn*                              OwningPawn;                                        // 0xE0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SquaredRadius;                                     // 0xE8(0x4)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_150B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AQtnPawn*>                      AppliedPawns;                                      // 0xF0(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnAuraComponent* GetDefaultObj();

	void RemoveEffect(class AQtnPawn* Target);
	void CleanupAppliedEffects();
	void ApplyEffectToPawns(TArray<class AQtnPawn*>& PlayerAndAllyPawns);
	void ApplyEffect(class AQtnPawn* Target);
};

// 0x0 (0x2C8 - 0x2C8)
// Class QtnGame.QtnBehaviorTreeComponent
class UQtnBehaviorTreeComponent : public UBehaviorTreeComponent
{
public:

	static class UClass* StaticClass();
	static class UQtnBehaviorTreeComponent* GetDefaultObj();

};

// 0x0 (0x1E8 - 0x1E8)
// Class QtnGame.QtnBlackboardComponent
class UQtnBlackboardComponent : public UBlackboardComponent
{
public:

	static class UClass* StaticClass();
	static class UQtnBlackboardComponent* GetDefaultObj();

};

// 0x38 (0x2F0 - 0x2B8)
// Class QtnGame.QtnBodyAnimInstance
class UQtnBodyAnimInstance : public UAnimInstance
{
public:
	class AQtnBodyPawn*                          M_pOwningBodyPawn;                                 // 0x2B8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnLocoIntentionEnum             LocoIntention;                                     // 0x2C0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnBodyStance                    bodyStance;                                        // 0x2C1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EMovementMode                     MovementMode;                                      // 0x2C2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1516[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LocoDirection;                                     // 0x2C4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LocoThrottle;                                      // 0x2C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AimYaw;                                            // 0x2CC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AimPitch;                                          // 0x2D0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LeanRoll;                                          // 0x2D4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsLeftHandUp;                                      // 0x2D8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsLeftHandEquipped;                                // 0x2D9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsRightHandUp;                                     // 0x2DA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsRightHandEquipped;                               // 0x2DB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UseHeadAim;                                        // 0x2DC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_151A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LookAimRatio;                                      // 0x2E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NormalizedTime;                                    // 0x2E4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsLocalPlayer;                                     // 0x2E8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsPlayerControlled;                                // 0x2E9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_151D[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnBodyAnimInstance* GetDefaultObj();

};

// 0xF8 (0x3E8 - 0x2F0)
// Class QtnGame.QtnBodyAnimGraphTP
class UQtnBodyAnimGraphTP : public UQtnBodyAnimInstance
{
public:
	class UAimOffsetBlendSpace1D*                LeanBlendTP;                                       // 0x2F0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace*                  UpperBodyAimBlendTP;                               // 0x2F8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                           HeadAimBlendTP;                                    // 0x300(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace1D*                         AimPitchBlend;                                     // 0x308(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UseAimPitchBlend;                                  // 0x310(0x1)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1526[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBlendSpace*                           UprightLocoBlendTP;                                // 0x318(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                           SearchUprightLocoBlendTP;                          // 0x320(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                           CombatUprightLocoBlendTP;                          // 0x328(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                           FleeLocoBlendTP;                                   // 0x330(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                           SprintLocoBlendTP;                                 // 0x338(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                           LeftArmAimBlendTP;                                 // 0x340(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                         LeftArmEquippedPoseTP;                             // 0x348(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                           RightArmAimBlendTP;                                // 0x350(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                         RightArmEquippedPoseTP;                            // 0x358(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                         JumpIntro;                                         // 0x360(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                         JumpLoop;                                          // 0x368(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                         JumpOutro;                                         // 0x370(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LeftFootIKEffectorLocation;                        // 0x378(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LeftFootIKTargetLocation;                          // 0x384(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LeftFootIKInfluence;                               // 0x390(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               RightFootIKEffectorLocation;                       // 0x394(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               RightFootIKTargetLocation;                         // 0x3A0(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RightFootIKInfluence;                              // 0x3AC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               RightHandIKEffectorLocation;                       // 0x3B0(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               RightHandIKTargetLocation;                         // 0x3BC(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RightHandIKInfluence;                              // 0x3C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LeftHandIKEffectorLocation;                        // 0x3CC(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LeftHandIKTargetLocation;                          // 0x3D8(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LeftHandIKInfluence;                               // 0x3E4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnBodyAnimGraphTP* GetDefaultObj();

};

// 0x2B8 (0x608 - 0x350)
// Class QtnGame.QtnBodyController
class AQtnBodyController : public AAIController
{
public:
	float                                        LocoSpeedMultipliers[0x3];                         // 0x350(0xC)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       RelaxedThinkInterval;                              // 0x35C(0x8)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       BackgroundCombatThinkInterval;                     // 0x364(0x8)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       ActiveCombatThinkInterval;                         // 0x36C(0x8)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                         M_thinkInduced;                                    // 0x374(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_isCurrentlyDoingThink;                           // 0x375(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1682[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_timeUntilNextForcedThinkInduction;               // 0x378(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_timeSinceLastThought;                            // 0x37C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnGameState*                         M_pCachedGameState;                                // 0x380(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_readyForGameplayPending;                         // 0x388(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1688[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               M_homeLocation;                                    // 0x38C(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_generalSearchLocation;                           // 0x398(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_168B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UQtnVerb>                  M_pendingCheatVerbClass;                           // 0x3A8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UQtnVerb>                  M_knownDodgeVerbClass;                             // 0x3B0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_            BodyControllerOccupied;                            // 0x3B8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, BlueprintAuthorityOnly, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            BodyControllerUnOccupied;                          // 0x3C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, BlueprintAuthorityOnly, NativeAccessSpecifierProtected)
	struct FQtnPawnIntentions                    M_bodyIntentionsFromAI;                            // 0x3D8(0x78)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class AQtnBodyPawn*                          M_pPossessedPawn;                                  // 0x450(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AbleToSenseDangerVolumes;                          // 0x458(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1693[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AQtnDangerVolume*                      M_pLastAcknowledgedDangerVolume;                   // 0x460(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_wantsAIToDodge;                                  // 0x468(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceFlee;                                         // 0x469(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_169C[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnPathFollowingComponent*            M_pPathFollowingComponent;                         // 0x470(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnAIPerceptionComponent*             M_pPerceptionComponent;                            // 0x478(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThreatLevel;                                       // 0x480(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReactionTimeBeforeThreatIsInvalid;                 // 0x484(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlackboardData*                       SystemicBlackboardAsset;                           // 0x488(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnMentalStateCombat*                 M_pCombatState;                                    // 0x490(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnMentalStateFollowAlly*             M_pFollowAllyState;                                // 0x498(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnMentalStateFlee*                   M_pFleeState;                                      // 0x4A0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnMentalStateInvestigate*            M_pInvestigateState;                               // 0x4A8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnMentalStatePatrol*                 M_pPatrolState;                                    // 0x4B0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnMentalStatePlayerControlled*       M_pPlayerControlledState;                          // 0x4B8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnMentalStateScriptedAction*         M_pScriptedActionState;                            // 0x4C0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnMentalStateScriptedBT*             M_pScriptedBTState;                                // 0x4C8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnMentalStateScriptedDestination*    M_pScriptedDestinationState;                       // 0x4D0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnMentalStateSearch*                 M_pSearchState;                                    // 0x4D8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnMentalStateIncapacitated*          M_pIncapacitatedState;                             // 0x4E0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnMentalFSM*                         M_pMentalFSM;                                      // 0x4E8(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnAILOD                         M_aiLOD;                                           // 0x4F0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16AC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               M_pUpperBodyScriptedActionCaller;                  // 0x4F8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_upperBodyScriptedActionTimer;                    // 0x500(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_upperBodyScriptedActionOverridesCombat;          // 0x504(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16AD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_perceptionOverrideTimer;                         // 0x508(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_cognitiveFunctionsDelay;                         // 0x50C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EQtnSensoryEvidenceCategory       M_reasonForInvestigate;                            // 0x510(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16B2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                M_pTetherAnchor;                                   // 0x518(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnSkirmish*                          M_pOwningSkirmish;                                 // 0x520(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       M_tetherRadii;                                     // 0x528(0x8)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	float                                        M_tetherVerticalRatio;                             // 0x530(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16B7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AQtnBodyPawn*                          M_pRoamingTarget;                                  // 0x538(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnBodyPawn*                          M_pBodyToDefend;                                   // 0x540(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class AActor>>            M_ignoredEmployerArchetypes;                       // 0x548(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class AQtnWaypoint*                          M_pAdoptedWaypoint;                                // 0x558(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnBodyPawn*                          M_pAllyInNeedOfHelp;                               // 0x560(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_cachedNearestAllyDestination;                    // 0x568(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_cachedNarrowestAllyDestination;                  // 0x574(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_nearestAllyDestinationNeedsRefresh;              // 0x580(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16BF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UObject*>                       M_aiJobInhibitors;                                 // 0x588(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UQtnAISystem*                          M_pCachedAISystem;                                 // 0x598(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAIEmployed;                                      // 0x5A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAIUnEmployed;                                    // 0x5B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FQtnRangedFloat                       RoamingPatience;                                   // 0x5C0(0x8)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FQtnRangedFloat                       DefaultTetherRadii;                                // 0x5C8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                        MinCombatAvoidanceRange;                           // 0x5D0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         NeverHideFromEnemy;                                // 0x5D4(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IgnoreForegroundTickets;                           // 0x5D5(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IgnoreAttackTickets;                               // 0x5D6(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CanTeleportToDestination;                          // 0x5D7(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         PreferAttacksFromDestinations;                     // 0x5D8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16C7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnMentalSubStateReviveTactics*       M_pSystemicReviveTactics;                          // 0x5E0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         OnlyAcceptFilteredAIJobs;                          // 0x5E8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         NeverAcceptAnyAIJob;                               // 0x5E9(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16C9[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AQtnPlayerPawn*                        M_pOccupyingPlayerPawn;                            // 0x5F0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnPlayerPawn*                        M_pLastKnownOccupyingPlayerPawn;                   // 0x5F8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_isWaitingForOccupy;                              // 0x600(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16CC[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AQtnBodyController* GetDefaultObj();

	void TempPsychicAwareness_Server(float Time, class AQtnBodyPawn* Target, float MinAwarenessRatio);
	void SetTetheredPatrolRouteComponent(class UQtnPatrolRouteComponent* PatrolRouteComponent);
	void SetTetherAnchor(class AActor* TetherAnchor, struct FQtnRangedFloat& TetherRadii, float TetherVerticalRatio);
	void SetScriptedDestinationManually(const struct FVector& Position, const struct FRotator& Rotation, enum class EQtnLocoSpeedEnum LocoSpeed, enum class EQtnBodyStance bodyStance, bool OverrideCombat, float TimeBeforeGivingUp, bool FinishUponReachingDestination);
	void SetScriptedDestination(class AActor* DestinationActor, enum class EQtnLocoSpeedEnum LocoSpeed, enum class EQtnBodyStance bodyStance, bool OverrideCombat, float TimeBeforeGivingUp, bool FinishUponReachingDestination);
	void SetScriptedAction(class UObject* ScriptedActionCaller, struct FQtnActionIntention& ActionIntention, bool OverrideCombat, float Duration, class AActor* LookFocus, bool InterruptCombat);
	void SetRoamingTarget(class AQtnBodyPawn* RoamingTarget);
	void SetPerceptionOverride(struct FQtnPerceptionConfig& PerceptionOverride, float Duration);
	void SetHomeLocation(struct FVector& HomeLocation);
	void SetHearingVisionOverride(bool WantHearing, bool WantVision, float Duration);
	void SetGeneralSearchLocation(struct FVector& GeneralSearchLocation);
	void SetCheatVerbClass(TSubclassOf<class UQtnVerb> CheatVerbClass);
	void ReturnForegroundTicket();
	void ReturnAttackTicket();
	void RemovePsychicAwareness(class AQtnPawn* Perpetrator);
	void RemoveIgnoredEmployer(TSubclassOf<class AActor> EmployerArchetype);
	void RemoveAIJobInhibitor(class UObject* JobInhibitor);
	void QtnBodyControllerEmployEvent__DelegateSignature(class UQtnAIJobRole* AiJobRole, class FName ClusterID, class FName RoleID, class UQtnAIJobComponent* JobComponent, bool IsCombatJob);
	void PushScriptedAction(struct FQtnActionIntention& NonLoopingActionIntention);
	void OnThink(float TimeSinceLastThought);
	void OnQtnReadyForGameplay(class AQtnBodyPawn* bodyPawn);
	void OnDebugDisplay(class UQtnDebugWrapper* DebugWrapper);
	void OnBodyControllerUnOccupied(class AQtnPlayerPawn* OccupyingPlayerPawn);
	void OnBodyControllerOccupied(class AQtnPlayerPawn* OccupyingPlayerPawn);
	bool IsUsingScriptedDestination(class AActor** DestinationActor);
	bool IsUsingScriptedAction(class UObject** ScriptedActionCaller);
	bool IsTrackingEnemyForCombat();
	bool IsReadyForGameplay();
	bool IsOccupiedAndUnsuppressed();
	bool IsInActiveCombatPursuit();
	bool IsEmployerIgnored(class AActor* JobComponentOwner);
	bool IsCurrentlyOnPatrol();
	bool HasForegroundTicket();
	bool HasAttackTicket();
	void HandleInventoryItemRemoved(class AQtnItem* PRemovedItem);
	void HandleInventoryItemAdded(class AQtnItem* PAddedItem);
	class UQtnPatrolRouteComponent* GetTetheredPatrolRouteComponent();
	struct FVector GetTetherAnchorLocation();
	class AActor* GetTetherAnchor();
	class AQtnBodyPawn* GetRoamingTarget();
	class AQtnPawn* GetRelevantEnemy();
	class UQtnAIPerceptionComponent* GetQtnPerceptionComponent();
	class UQtnPathFollowingComponent* GetQtnPathFollowingComponent();
	struct FVector GetPerceivedTargetLocation();
	class AQtnSkirmish* GetOwningSkirmish();
	struct FVector GetNearestFormationParticipantDestination(struct FVector& ReferenceLocation, struct FVector* NearestBasedOnAngle);
	struct FVector GetLastNavLocation();
	struct FVector GetHomeLocation();
	struct FVector GetGeneralSearchLocation();
	class AActor* GetFormationTarget();
	class UQtnVerb* GetFavoriteAttackVerb();
	float GetFavoriteAttackRange(bool* IsRangedCombatant);
	class UQtnNavLinkCustomComponent* GetCurrentNavLink(bool* IsMovingForward);
	float GetCombatAvoidanceRange();
	class AQtnBodyPawn* GetClosestPlayer();
	class AQtnBodyPawn* GetBodyPawn();
	class AQtnBodyPawn* GetAllyInNeedOfHelp();
	void GetAllBodyControllers(class UObject* SelfReference, TArray<class AQtnBodyController*>* FoundBodyControllers, class FName ActorTagFilter, class FName SpawnerRegionFilter);
	class UQtnAIJobRole* GetAIJobRole();
	void ForgetEverything();
	void FindAllyToHelp();
	void DefendOtherBody(class AQtnBodyPawn* bodyToDefend);
	void ClearPerceptionOverride();
	void ClearAllIgnoredEmployers();
	class AQtnBodyPawn* ChooseAllyToHelp(TArray<class AQtnBodyPawn*>& AllyBodies);
	void CancelScriptedDestination();
	void CancelScriptedAction(class UObject* ScriptedActionCaller);
	void AddPsychicAwarenessOfAllPlayers_ServerOnly(bool bBotsToo, float MinAwarenessRatio);
	void AddPsychicAwareness(class AQtnPawn* Perpetrator, float MinAwarenessRatio);
	void AddIgnoredEmployer(TSubclassOf<class AActor> EmployerArchetype);
	void AddAIJobInhibitor(class UObject* JobInhibitor);
};

// 0xF8 (0x120 - 0x28)
// Class QtnGame.QtnDataBag
class UQtnDataBag : public UObject
{
public:
	bool                                         M_hasBeenLoaded;                                   // 0x28(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1720[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<TSubclassOf<class UQtnDataBag>, class UQtnDataBag*> M_dataBagInstances;                                // 0x30(0x50)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UQtnDataBag>, struct FQtnDataBagBytes> M_dataBagBytes;                                    // 0x80(0x50)(SaveGame, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class UQtnDataBag>>       ChildDataBags;                                     // 0xD0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UQtnSaveData*                          M_pOwningSaveData;                                 // 0xE0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UQtnDataBag*                           M_pParentDataBag;                                  // 0xE8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FQtnVersion                           M_storedDataBagVersion;                            // 0xF0(0xC)(SaveGame, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FQtnVersion                           DeprecatedDataBagVersion;                          // 0xFC(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FQtnVersion                           LatestDataBagVersion;                              // 0x108(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FQtnVersion                           M_currentDataBagVersion;                           // 0x114(0xC)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnDataBag* GetDefaultObj();

	void PreSaveDataBP(class UQtnSaveData* SaveData, class AQtnBodyPawn* LocalOriginalBody);
	void PreLoadDataBP(class UQtnSaveData* SaveData, class AQtnBodyPawn* LocalOriginalBody);
	void PostSaveDataBP(class UQtnSaveData* SaveData, bool Success, class AQtnBodyPawn* LocalOriginalBody);
	void PostLoadDataBP(class UQtnSaveData* SaveData, bool Success, class AQtnBodyPawn* LocalOriginalBody);
	void OnReadyForGameplay(class AQtnPlayerController* LocalPlayerController, class AQtnPlayerUI* LocalPlayerUI, class AQtnBodyPawn* LocalOccupiedBodyPawn);
	void OnDebugDisplay(class UQtnDebugWrapper* DebugWrapper);
	bool HasValidBagData();
	class UQtnDataBag* GetParentDataBag();
	class UQtnDataBag* GetChildDataBag(TSubclassOf<class UQtnDataBag> DatabagArchetype);
};

// 0x8 (0x128 - 0x120)
// Class QtnGame.QtnBodyDataBag
class UQtnBodyDataBag : public UQtnDataBag
{
public:
	class AQtnBodyPawn*                          M_pAssociatedBodyPawn;                             // 0x120(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnBodyDataBag* GetDefaultObj();

	void OnBodyDataBagUnOccupy(class AQtnBodyPawn* OccupiedBodyPawn);
	void OnBodyDataBagOccupy(class AQtnBodyPawn* OccupiedBodyPawn);
};

// 0x5E0 (0xAD0 - 0x4F0)
// Class QtnGame.QtnPawn
class AQtnPawn : public ACharacter
{
public:
	uint8                                        Pad_191D[0x40];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UActorComponent*>               M_pawnLODComponents;                               // 0x530(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                       M_clientAdjustmentInhibitors;                      // 0x540(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UQtnTeam*                              R_pCachedTeam;                                     // 0x550(0x8)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnTeam*                              L_pCachedTeam;                                     // 0x558(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_191F[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         M_readyForGameplayPending;                         // 0x570(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1920[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               M_respawnLocation;                                 // 0x574(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        M_numTimesOutOfWorld;                              // 0x580(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_lastOutOfWorldSafeLocation;                      // 0x584(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        M_numTimesLastSafeLocationUsed;                    // 0x590(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                              M_originalMeshRelativeRotation;                    // 0x594(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FVector                               M_originalMeshRelativeLocation;                    // 0x5A0(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_originalMeshScale;                               // 0x5AC(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_targetPawnScale;                                 // 0x5B8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1922[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnPendingVerbRequest                R_pendingVerbRequest;                              // 0x5C0(0x18)(Net, Transient, RepNotify, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FQtnPendingVerbRequest                L_pendingVerbRequest;                              // 0x5D8(0x18)(Transient, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class FText                                  DisplayName;                                       // 0x5F0(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_            OnDisplayNameChangedEvent;                         // 0x608(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x618(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                        OnScreenLODMovementTickRate;                       // 0x630(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1924[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AQtnGameState*                         M_pCachedGameState;                                // 0x638(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UQtnCameraComponent*                   CameraComponent;                                   // 0x640(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UObject*>                       M_onlyRenderInSceneCaptureRequestors;              // 0x648(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class AActor*                                M_pLastBlockingActor;                              // 0x658(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FQtnPawnIntentions                    R_pawnIntentions;                                  // 0x660(0x78)(Net, Transient, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	enum class EQtnPawnLOD                       M_pawnLOD;                                         // 0x6D8(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1927[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AQtnBodyPawn*                          M_pBodyToBlame;                                    // 0x6E0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UQtnCarryComponent*                    M_pCarryComponent;                                 // 0x6E8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AQtnPawn*>                      M_overlappingPawns;                                // 0x6F0(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                        M_overlappingNonPawns;                             // 0x700(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                        M_overlappingDroppedActors;                        // 0x710(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                        M_recentlyTouchedActors;                           // 0x720(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	float                                        M_recentlyHitActorResetCountdown;                  // 0x730(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ActorRetouchDelay;                                 // 0x734(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UQtnHintVolumeComponent*>       M_encompassingDeepSnowVolumes;                     // 0x738(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	float                                        LaunchSlipperyDuration;                            // 0x748(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        M_slipperyTimer;                                   // 0x74C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            ReadyForGameplayEvent;                             // 0x750(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnTouchOtherActor;                                 // 0x760(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnStatusEffectStart;                               // 0x770(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnStatusEffectEnd;                                 // 0x780(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnMovementBlocked;                                 // 0x790(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            HijackStartEvent;                                  // 0x7A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            HijackStopEvent;                                   // 0x7B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        FrobDistance;                                      // 0x7C0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VisibilityDistanceOverride;                        // 0x7C4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseNavWalkingIfPreferred;                         // 0x7C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanEverLeaveNavWalking;                           // 0x7C9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1933[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_movementPredictionCertainty;                     // 0x7CC(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MovementPredictionInterval;                        // 0x7D0(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_movementPredictionTimer;                         // 0x7D4(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_lastKnownVelocity;                               // 0x7D8(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_canTrustCachedTouchingGroundResult;              // 0x7E4(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_cachedTouchingGroundResult;                      // 0x7E5(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_canTrustCachedIsOnNavMeshResult;                 // 0x7E6(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_cachedIsOnNavMeshResult;                         // 0x7E7(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                       M_combatTargetingInhibitors_serverOnly;            // 0x7E8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<class UObject*, float>                  M_aggroContributors_ServerOnly;                    // 0x7F8(0x50)(Transient, NativeAccessSpecifierPrivate)
	float                                        M_calculatedAggro_ServerOnly;                      // 0x848(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_queuedLaunchVelocity;                            // 0x84C(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQtnTeam>                  DefaultTeamClass;                                  // 0x858(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnTeamChangedEvent;                                // 0x860(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Faction;                                           // 0x870(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnJumpEvent;                                       // 0x878(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnLandedEvent;                                     // 0x888(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnLaunchedEvent;                                   // 0x898(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnWalkOffLedgeEvent;                               // 0x8A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UQtnDamageReceptorComponent*           M_pDamageReceptor;                                 // 0x8B8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class UObject*, float>                  M_attackDamageMultipliers;                         // 0x8C0(0x50)(Transient, Protected, NativeAccessSpecifierProtected)
	float                                        R_aggregateAttackDamageMultiplier;                 // 0x910(0x4)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        M_remainingAITrackingImmunity;                     // 0x914(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            OnOutgoingDamage;                                  // 0x918(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnKilledSomething;                                 // 0x928(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         R_markedForCleanup;                                // 0x938(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         ImmuneToCleanup;                                   // 0x939(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1942[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FQtnVerbRequest>               M_localVerbRequests;                               // 0x940(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<enum class EQtnUIBodyActionEnum>      M_verbInputsWaitingForRelease;                     // 0x950(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UQtnVerbComponent*                     M_pVerbComponent;                                  // 0x960(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnAttributeComponent*                M_pAttributeComponent;                             // 0x968(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnLootManagementComponent*           M_pLootManagementComponent;                        // 0x970(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnUnlocksComponent*                  M_pUnlocksComponent;                               // 0x978(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          M_activeBullshitTag;                               // 0x980(0x8)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            VerbStartEvent;                                    // 0x988(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            VerbStopEvent;                                     // 0x998(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            AnimWindowBeginEvent;                              // 0x9A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            AnimWindowEndEvent;                                // 0x9B8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            AnimNotifyEvent;                                   // 0x9C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FName                                  PawnSocketLeftGrip;                                // 0x9D8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  PawnSocketRightGrip;                               // 0x9E0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  PawnSocketVision;                                  // 0x9E8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  PawnSocketCamera;                                  // 0x9F0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FQtnDefaultTicket>             DefaultTickets;                                    // 0x9F8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnQtnTeleport;                                     // 0xA08(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        M_teleportCountdown;                               // 0xA18(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_194C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UQtnCarryComponent*>            M_managedCarryComponents;                          // 0xA20(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class AActor*                                M_pCarryingActor;                                  // 0xA30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        R_timeDilation;                                    // 0xA38(0x4)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_194E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class UObject*, struct FQtnTimeDilationInfo> M_timeDilators_ServerOnly;                         // 0xA40(0x50)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_194F[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AllyNameFontScale;                                 // 0xAA0(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FColor                                AllyNameFontColor;                                 // 0xAA4(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MinHUDRenderingDistance;                           // 0xAA8(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MaxHUDRenderingDistance;                           // 0xAAC(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MinHUDRenderingAlpha;                              // 0xAB0(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1953[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                R_HudLabel;                                        // 0xAB8(0x10)(Net, ZeroConstructor, Transient, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UQtnDamageType>            GracefulDespawnDamageType;                         // 0xAC8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AQtnPawn* GetDefaultObj();

	bool WasThirdPersonRecentlyRendered(float Recently);
	void WaitForReadyForGameplay(class AQtnPawn* Pawn, const struct FLatentActionInfo& LatentInfo, class AQtnPawn** ReadyPawn);
	void UnSetActiveBullshit(class UObject* Caller);
	float TestSlidePawnToLocation(const struct FVector& StartLocation, const struct FVector& DesiredLocation, struct FVector* OutReachedLocation);
	void TeleportQtnPawnToActor(class AActor* DestinationActor);
	void TeleportQtnPawn(struct FVector& Destination, struct FRotator& Orientation);
	void StopVerbByInstance_LocalOnly(class UQtnVerb* PVerbInstance);
	void StartVerbByClass_LocalOnly(TSubclassOf<class UQtnVerb> VerbClass, class UObject* IntendedTarget);
	class AQtnProjectile* SpawnProjectileFromPawn_ServerOnly(TSubclassOf<class AQtnProjectile> ProjectileClass, class AActor* SourceActor, class UQtnVerb* SourceVerb, const struct FVector& MuzzlePosition, const struct FVector& ProjectileVelocity, class AQtnPawn* Culprit);
	void SpawnProjectileFromPawn_LocalOnly(TSubclassOf<class AQtnProjectile> ProjectileClass, class AActor* SourceActor, class UQtnVerb* SourceVerb, const struct FVector& MuzzlePosition, const struct FVector& ProjectileVelocity);
	float SlidePawnToLocation(const struct FVector& DesiredLocation, struct FHitResult* HitResult, bool SendImpactEvents);
	bool ShouldUseNavWalking();
	void SetTeam_ServerOnly(TSubclassOf<class UQtnTeam> NewTeamClass);
	void SetPawnScale(float TargetScale);
	void SetHUDLabel_ServerOnly(class FString& HudLabel);
	void SetDisplayName(class FText NewDisplayName);
	void SetBodyToBlame(class AQtnBodyPawn* bodyPawn);
	void SetActiveBullshit(const struct FGameplayTag& ActiveBullshitTag, class UObject* Caller);
	void ServerTeleportQtnPawn(const struct FVector& Destination, const struct FRotator& Orientation);
	void ServerSpawnProjectileFromPawn(TSubclassOf<class AQtnProjectile> ProjectileClass, class AActor* SourceActor, class UQtnVerb* SourceVerb, const struct FVector& MuzzlePosition, const struct FVector& ProjectileVelocity);
	void ServerSetRootMotionSmoothMoveToDynamicLocation(const struct FVector& TargetLocation, class FName InstanceName);
	void ServerSetRootMotionInstantMoveToDynamicLocation(const struct FVector& TargetLocation, class FName InstanceName);
	void ServerSetPendingVerbAndTarget(class UQtnVerb* PPendingVerb, class UObject* PPendingVerbTarget);
	void ServerSetCharacterMovementMode(enum class EMovementMode MovementMode);
	void ServerOutgoingPlayerDamage(class UQtnDamageReceptorComponent* PDamageRecipient, const struct FQtnDamageInfo& DamageInfo);
	void ServerGenerateAINoise(class AActor* EmittingActor, enum class EQtnNoiseEnum NoiseType, float NoiseStrength);
	void ServerEndRootMotion(class FName InstanceName);
	void ServerDropOtherActor(class AActor* OtherActor, bool DestroyAfterDrop);
	void ServerBeginRootMotionSmoothMoveToDynamic(const struct FVector& StartLocation, const struct FVector& EndLocation, float Duration, bool ZeroVelocityWhenFinished, class FName InstanceName, float ClientTimeStamp, bool FromVerb);
	void ServerBeginRootMotionSmoothMoveTo(const struct FVector& StartLocation, const struct FVector& EndLocation, float Duration, bool ZeroVelocityWhenFinished, class FName InstanceName, float ClientTimeStamp, bool FromVerb);
	void ServerBeginRootMotionInstantMoveToDynamic(const struct FVector& TargetLocation, float Duration, bool OverrideVelocity, bool ZeroVelocityWhenFinished, class FName InstanceName, float ClientTimeStamp, bool FromVerb);
	void ServerBeginRootMotionImpulse(const struct FVector& Impulse, bool OverrideVelocity, class FName InstanceName, float ClientTimeStamp);
	void ServerBeginRootMotionConstantForce(const struct FVector& Direction, float Strength, float Duration, bool ZeroVelocityWhenFinished, class FName InstanceName, float ClientTimeStamp, bool FromVerb);
	void ServerAddAndRequestVerb(const struct FQtnVerbRequest& VerbRequest);
	void RequestVerb_ServerOnly(struct FQtnVerbRequest& VerbRequest, bool AddIfMissing);
	void RequestVerb_LocalOnly(struct FQtnVerbRequest& VerbRequest, bool AddIfMissing);
	void RemoveTimeDilation_ServerOnly(class UObject* TimeDilator);
	void RemoveDamageImmunity(TSubclassOf<class UQtnDamageType> DamageTypeClass);
	void RemoveCombatTargetingInhibitor_ServerOnly(class UObject* Inhibitor);
	void RemoveAttackDamageMultiplier_ServerOnly(class UObject* SourceObject);
	void RemoveAggro_ServerOnly(class UObject* AggroCauser);
	void RegisterPawnLODComponent(class UActorComponent* PActorComponent);
	void QueueLaunch(const struct FVector& LaunchVelocity);
	void QtnWalkOffLedgeSignature__DelegateSignature(class AQtnPawn* Pawn, struct FVector& PreviousFloorImpactNormal, struct FVector& PreviousFloorContactNormal, struct FVector& PreviousLocation);
	void QtnTeleportEvent__DelegateSignature(const struct FVector& OldLocation, const struct FRotator& OldRotation, const struct FVector& NewLocation, const struct FRotator& NewRotation);
	void QtnStatusEffectEvent__DelegateSignature(class UQtnStatusEffect* StatusEffect);
	void QtnPawnVerbEvent__DelegateSignature(class UQtnVerb* Verb, bool IsServer);
	void QtnPawnTouchEvent__DelegateSignature(class AQtnPawn* SelfPawn, class AActor* OtherActor, struct FVector& TouchLocation, struct FVector& TouchNormal);
	void QtnPawnTeamChangeEvent__DelegateSignature(class UQtnTeam* OldTeam, class UQtnTeam* NewTeam);
	void QtnPawnAnimNotifyEvent__DelegateSignature(class UQtnAnimNotify* AnimNotify);
	void QtnOutgoingDamageEvent__DelegateSignature(class AActor* DamagedActor, struct FQtnDamageInfo& DamageInfo, struct FQtnHitReactionInfo& HitReactionInfo, bool IsServer);
	void QtnOnReadyForGameplayEvent__DelegateSignature(class AQtnPawn* ReadyPawn);
	void QtnOnDisplayNameChangedEvent__DelegateSignature(class FText NewDisplayName);
	void QtnMovementBlockedEvent__DelegateSignature(struct FHitResult& Impact);
	void QtnLaunchedSignature__DelegateSignature(class AQtnPawn* Pawn, struct FVector& LaunchVelocity);
	void QtnLandedSignature__DelegateSignature(class AQtnPawn* Pawn, struct FHitResult& Hit);
	void QtnKilledSomethingEvent__DelegateSignature(class AQtnPawn* Culprit, class AActor* KilledActor, bool IsServer);
	void QtnJumpSignature__DelegateSignature(class AQtnPawn* Pawn);
	void QtnAnimWindowEndEvent__DelegateSignature(class UQtnAnimWindow* AnimWindow);
	void QtnAnimWindowBeginEvent__DelegateSignature(class UQtnAnimWindow* AnimWindow, float TotalDuration);
	void OnRep_PendingVerbRequest();
	void OnRep_PawnIntentionsSimulatedProxy();
	void OnRep_HudLabel();
	void OnRep_DisplayName();
	void OnRep_CachedTeam();
	void OnQtnReadyForGameplay();
	void OnManualStartedVerbEvent(struct FQtnPawnMontage& VerbAction, float PlayRate, float StartTime);
	void OnManualFinishedVerbEvent(struct FQtnPawnMontage& VerbAction, bool JumpToOutro);
	void OnDebugDisplay(class UQtnDebugWrapper* DebugWrapper);
	void OnCheatVerbRequested(const struct FQtnVerbRequest& VerbRequest);
	void OnAnimWindowEnd(class UQtnAnimWindow* AnimWindow);
	void OnAnimWindowBegin(class UQtnAnimWindow* AnimWindow, float TotalDuration);
	void OnAnimNotify(class UQtnAnimNotify* AnimNotify);
	void MulticastTeleportQtnPawn(const struct FVector& Destination, const struct FRotator& Orientation);
	void MulticastOutgoingPlayerDamage(class UQtnDamageReceptorComponent* PDamageRecipient, const struct FQtnDamageInfo& DamageInfo);
	void MulticastFX(TSubclassOf<class AQtnFXActor> FxClass);
	void MulticastDamageNonReplicatedActor(class UQtnDamageReceptorComponent* PDamageReceptor, const struct FQtnDamageInfo& DamageInfo);
	void MarkForCleanup_ServerOnly();
	void ManuallyTickVerbInstance(class UQtnVerb* PVerbInstance, float DeltaSeconds);
	void LocalSetRootMotionSmoothMoveToDynamicLocation(const struct FVector& TargetLocation, class FName InstanceName);
	void LocalSetRootMotionInstantMoveToDynamicLocation(const struct FVector& TargetLocation, class FName InstanceName);
	void LocalSetDefaultCharacterMovementMode();
	void LocalSetCharacterMovementMode(enum class EMovementMode MovementMode);
	void LocalGenerateAINoise(class AActor* EmittingActor, enum class EQtnNoiseEnum NoiseType, float NoiseStrength);
	void LocalEndRootMotion(class FName InstanceName);
	void LocalDropOtherActor(class AActor* OtherActor, bool DestroyAfterDrop);
	void LocalBeginRootMotionSmoothMoveToDynamic(const struct FVector& StartLocation, const struct FVector& EndLocation, float Duration, bool ZeroVelocityWhenFinished, class FName InstanceName, bool FromVerb);
	void LocalBeginRootMotionSmoothMoveTo(const struct FVector& StartLocation, const struct FVector& EndLocation, float Duration, bool ZeroVelocityWhenFinished, class FName InstanceName, bool FromVerb);
	void LocalBeginRootMotionInstantMoveToDynamic(const struct FVector& TargetLocation, float Duration, bool OverrideVelocity, bool ZeroVelocityWhenFinished, class FName InstanceName, bool FromVerb);
	void LocalBeginRootMotionImpulse(const struct FVector& Impulse, bool OverrideVelocity, class FName InstanceName);
	void LocalBeginRootMotionConstantForce(const struct FVector& Direction, float Strength, float Duration, bool ZeroVelocityWhenFinished, class FName InstanceName, bool FromVerb);
	bool IsTouchingGround();
	bool IsReadyForGameplay();
	bool IsPawnOnNavMesh();
	bool IsNeutral(class AActor* OtherActor);
	bool IsMarkedForCleanup();
	bool IsLocallyControlledPlayer();
	bool IsInDeepSnow();
	bool IsImmuneToAITracking();
	bool IsHitReactingOrKnockedDown();
	bool IsHero();
	bool IsEnemy(class AActor* OtherActor);
	bool IsCarrying(class AActor* OtherActor);
	bool IsAnyHitStopActive();
	bool IsAlly(class AActor* OtherActor);
	bool IsAliveAndConscious();
	void IgnoreVerbInputUntilRelease(enum class EQtnUIBodyActionEnum InputAction);
	void IgnoreOverlappingPawnsAfterTeleport(class AActor* FreshlyTeleportedActor);
	void IgnoreActorUntilOverlapEnds(class AActor* FreshlyTeleportedActor);
	bool HasTeamAttitude(class AActor* OtherActor, enum class EQtnTeamAttitude TeamAttitude);
	bool HasJustTeleported();
	bool HasDamageImmunity(TSubclassOf<class UQtnDamageType> DamageTypeClass, bool* PermanentlyImmune);
	void HandleVerbEquipChange(class UQtnVerb* AffectedVerb, bool IsEquipped, bool IsServer);
	void HandleOverlapEnd(class UPrimitiveComponent* POverlappedComponent, class AActor* POtherActor, class UPrimitiveComponent* POtherComp, int32 OtherBodyIndex);
	void HandleOverlapBegin(class UPrimitiveComponent* POverlappedComponent, class AActor* POtherActor, class UPrimitiveComponent* POtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void HandleOutgoingDamage(class AActor* DamagedActor, struct FQtnDamageInfo& DamageInfo, struct FQtnHitReactionInfo& HitReactionInfo, bool IsServer);
	void HandleKilledSomething(class AActor* KilledActor);
	void HandleDifficultyChange_ServerOnly(enum class EQtnDifficulty NewDifficulty);
	void HandleCarryStart(class UQtnCarryComponent* CarryComponent, class AActor* CarryingActor, struct FQtnCarrySettings& CarrySettings, bool IsServer);
	void HandleCarryEnd(class UQtnCarryComponent* CarryComponent, class AActor* CarryingActor, bool IsServer);
	void HandleCapsuleHit(class UPrimitiveComponent* PHitComp, class AActor* POtherActor, class UPrimitiveComponent* POtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void GracefulDespawn();
	class UQtnVerbComponent* GetVerbComponent();
	class UQtnUnlocksComponent* GetUnlocksComponent();
	TSubclassOf<class UQtnTeam> GetTeam();
	enum class EQtnTeamAttitude GetQtnTeamAttitudeTowards(class AActor* OtherActor);
	class UQtnMovementComponent* GetQtnMovementComponent();
	class UQtnCameraComponent* GetQtnCameraComponent();
	void GetPostRenderInfo(class AQtnPlayerController* OtherPlayerController, bool* SkipThisFrame, class FString* HudLabel, struct FColor* FontColor);
	float GetPawnVisibilityRatioBP(struct FLinearColor* VisibilityColor);
	float GetPawnScale();
	enum class EQtnPawnLOD GetPawnLOD();
	struct FVector GetPawnHeadLocation();
	struct FVector GetPawnGravity();
	struct FVector GetPawnForwardVectorAlongGround();
	struct FVector GetPawnFeetLocation();
	struct FVector GetPawnCapsuleTop();
	class AQtnSpawner* GetOwningSpawner();
	TArray<class AQtnPawn*> GetOverlappingPawns();
	TArray<class AActor*> GetOverlappingNonPawns();
	struct FRotator GetOriginalRelativeMeshRotation();
	struct FVector GetOriginalRelativeMeshLocation();
	class AQtnPlayerUI* GetOccupyingPlayerUI();
	class AQtnPlayerController* GetOccupyingLocalPlayerController();
	TArray<class UQtnCarryComponent*> GetManagedCarryComponents();
	class UQtnLootManagementComponent* GetLootManagementComponent();
	struct FQtnPawnIntentions GetIntentions();
	void GetIntendedEquippedWeapons(class AQtnItem** RangedWeapon, class AQtnItem** MeleeWeapon);
	class AQtnItem* GetIntendedEquippedWeapon(bool Ranged);
	void GetHealth(float* Health, float* MaxHealth);
	struct FGameplayTag GetFaction();
	class UQtnVerb* GetExistingVerb(TSubclassOf<class UQtnVerb> VerbClass);
	TArray<class UQtnHintVolumeComponent*> GetEncompassingDeepSnowVolumes();
	class FText GetDisplayName();
	class UQtnDamageReceptorComponent* GetDamageReceptor();
	class UQtnVerb* GetCurrentActiveVerb();
	class AQtnPlayerPawn* GetControllingPlayerPawn();
	class AActor* GetCarryingActor();
	class UQtnCarryComponent* GetCarryComponent();
	class AQtnBodyPawn* GetBodyToBlame();
	class UQtnAttributeComponent* GetAttributeComponent();
	float GetAttackDamageMultiplier();
	void GetAllEquippedVerbs(TArray<class UQtnVerb*>* PawnVerbs);
	void DropAllCarriedPawns_ServerOnly();
	void DoHitStop(struct FQtnHitStopRequest& HitStopRequest);
	void DoForceFeedbackCameraShakeIfLocalPlayer(class UForceFeedbackEffect* ForceFeedbackEffect, TSubclassOf<class UCameraShakeBase> CameraShake, float CameraShakeScale);
	void ClientSetAutonomousProxyIntentions(const struct FQtnPawnIntentions& Intentions);
	void ClientRequestVerb(const struct FQtnVerbRequest& VerbRequest);
	class UQtnVerb* ChooseBestVerb(enum class EQtnUIBodyActionEnum bodyActionEnum, class UObject* IntendedTarget);
	class UQtnVerb* ChooseBestAttackVerb(class UObject* IntendedTarget);
	bool CanBeTargetedForCombat_ServerOnly(class AQtnPawn* OtherPawn);
	void ApplyPawnDamage(struct FQtnDamageInfo& DamageInfo);
	float ApplyKnockback(class AQtnPawn* Culprit, struct FVector& SourceLocation, float HorizontalDistance, float ApexHeight, float AimAssistDegrees);
	void AdjustLocationForGeo();
	void AddTimeDilation_ServerOnly(class UObject* TimeDilator, float TimeDilation, float DurationBeforeDecay, float DecayDuration);
	void AddDamageImmunity(TSubclassOf<class UQtnDamageType> DamageTypeClass);
	void AddCombatTargetingInhibitor_ServerOnly(class UObject* Inhibitor);
	void AddAttackDamageMultiplier_ServerOnly(class UObject* SourceObject, float Multiplier);
	void AddAggro_ServerOnly(class UObject* AggroCauser, float AggroContribution);
};

// 0x700 (0x11D0 - 0xAD0)
// Class QtnGame.QtnBodyPawn
class AQtnBodyPawn : public AQtnPawn
{
public:
	uint8                                        Pad_1A44[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnCloudOptionsSaveData*              M_pCachedCloudOptionsSaveData;                     // 0xAD8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_bIsHeroArchetype;                                // 0xAE0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_bIsBossArchetype;                                // 0xAE1(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A45[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  FootSocketLeft;                                    // 0xAE4(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  FootSocketRight;                                   // 0xAEC(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          M_pawnTag;                                         // 0xAF4(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         WantsSpawnAnimation;                               // 0xAFC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A46[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnHintVolumeComponent*               M_pFloodControlHint;                               // 0xB00(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_lookInterpolationRatio;                          // 0xB08(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       LODNeglectDistance;                                // 0xB0C(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         M_hasBeenCheckedForRelevance;                      // 0xB14(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A48[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   EntityRPGData;                                     // 0xB18(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FQtnAIDebugInfo                       R_aiDebugInfo;                                     // 0xB28(0x28)(Net, Transient, NativeAccessSpecifierPublic)
	struct FQtnAIClientInfo                      R_aiClientInfo;                                    // 0xB50(0x1)(Net, Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A4A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnAICombatBegin_ServerOnly;                        // 0xB58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AQtnBodyController*                    M_pPossessingController;                           // 0xB68(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnPlayerPawn*                        R_pOccupyingPlayerPawn;                            // 0xB70(0x8)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnPlayerPawn*                        L_pOccupyingPlayerPawn;                            // 0xB78(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnPlayerPawn*                        M_pOccupyEventPawn;                                // 0xB80(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         R_databagOccupyHappened;                           // 0xB88(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A4E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            BodyPawnOccupiedEvent;                             // 0xB90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            BodyPawnUnOccupiedEvent;                           // 0xBA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class UQtnBodyAnimGraphTP*                   M_charAnimInstanceTP;                              // 0xBB0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace1D*                LeanBlendFP;                                       // 0xBB8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlendSpace*                           SwimLocoBlendFP;                                   // 0xBC0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAimOffsetBlendSpace1D*                SwimAimBlendFP;                                    // 0xBC8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimSequence*                         LeftArmEquippedPoseFP;                             // 0xBD0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAimOffsetBlendSpace1D*                LeftArmAimBlendFP;                                 // 0xBD8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimSequence*                         RightArmEquippedPoseFP;                            // 0xBE0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAimOffsetBlendSpace1D*                RightArmAimBlendFP;                                // 0xBE8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAimOffsetBlendSpace1D*                LeanBlendTP;                                       // 0xBF0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAimOffsetBlendSpace*                  UpperBodyAimBlendTP;                               // 0xBF8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlendSpace*                           HeadAimBlendTP;                                    // 0xC00(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A51[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBlendSpace*                           LocoBlendPerBodyStance[0x5];                       // 0xC58(0x28)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlendSpace*                           LeftArmAimBlendTP;                                 // 0xC80(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimSequence*                         LeftArmEquippedPoseTP;                             // 0xC88(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlendSpace*                           RightArmAimBlendTP;                                // 0xC90(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimSequence*                         RightArmEquippedPoseTP;                            // 0xC98(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimSequence*                         JumpIntroTP;                                       // 0xCA0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimSequence*                         JumpLoopTP;                                        // 0xCA8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimSequence*                         JumpOutroTP;                                       // 0xCB0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A54[0x90];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         M_bUpdateFootstepTracer;                           // 0xD48(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A55[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  SoundParam_Name_FootstepSurface;                   // 0xD4C(0x8)(Edit, ZeroConstructor, Config, EditConst, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  SoundParam_Float_FootstepLoudness;                 // 0xD54(0x8)(Edit, ZeroConstructor, Config, EditConst, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  SoundParam_Name_FootstepCharacter;                 // 0xD5C(0x8)(Edit, ZeroConstructor, Config, EditConst, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  FootstepCharacterSwitchValue;                      // 0xD64(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A57[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            FootstepEvent;                                     // 0xD70(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	class UAudioComponent*                       FootstepAudioComponent;                            // 0xD80(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                       SlideAudioComponent;                               // 0xD88(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRuntimeFloatCurve                    SlideVolumeBySpeedCurve;                           // 0xD90(0x88)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                        M_timeOfLastAIFootstepNoise;                       // 0xE18(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_lastFootstepNoiseLoudness;                       // 0xE1C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_lastFootstepAudioLoudness;                       // 0xE20(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  SoundParam_Bool_Crouch;                            // 0xE24(0x8)(Edit, ZeroConstructor, Config, EditConst, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A5C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  KOedNotDiscoveredInfo;                             // 0xE30(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FText                                  KOedDiscoveredInfo;                                // 0xE48(0x18)(Edit, NativeAccessSpecifierPrivate)
	enum class EQtnBodyAliveness                 R_bodyAliveness;                                   // 0xE60(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EQtnBodyAliveness                 L_bodyAliveness;                                   // 0xE61(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A5D[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                R_pBodyAlivenessInstigator;                        // 0xE68(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class UQtnFullBodyState>> FullBodyStates;                                    // 0xE70(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class UQtnUpperBodyState>> UpperBodyStates;                                   // 0xE80(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UQtnFullBodyFSM*                       M_pFullBodyFSM;                                    // 0xE90(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnUpperBodyFSM*                      M_pUpperBodyFSM;                                   // 0xE98(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnFullBodyStateLocomotion*           M_pFullLocomotionState;                            // 0xEA0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnFullBodyStateAction*               M_pFullActionState;                                // 0xEA8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnFullBodyStateVerb*                 M_pFullVerbState;                                  // 0xEB0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnFullBodyStateHitReaction*          M_pFullHitReactionState;                           // 0xEB8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnFullBodyStateJumpFall*             M_pFullJumpFallState;                              // 0xEC0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnFullBodyStateMantle*               M_pFullMantleState;                                // 0xEC8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnFullBodyStateEngaged*              M_pFullEngagedState;                               // 0xED0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnFullBodyStateDead*                 M_pFullDeadState;                                  // 0xED8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnFullBodyStateKnockedDown*          M_pFullKnockedDownState;                           // 0xEE0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnUpperBodyStateReady*               M_pUpperReadyState;                                // 0xEE8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnUpperBodyStateEquipping*           M_pUpperEquippingState;                            // 0xEF0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnUpperBodyStateAction*              M_pUpperActionState;                               // 0xEF8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnUpperBodyStateVerb*                M_pUpperVerbState;                                 // 0xF00(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnUpperBodyStateFrobbing*            M_pUpperFrobbingState;                             // 0xF08(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnUpperBodyStateIndisposed*          M_pUpperIndisposedState;                           // 0xF10(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnUpperBodyStateClimbing*            M_pUpperClimbingState;                             // 0xF18(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshSocket*                   M_pSkeletalVisionSocket;                           // 0xF20(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnCarryComponent*                    BodyCarryComponent;                                // 0xF28(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceOnscreenNPCPawnLOD;                           // 0xF30(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A63[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            BodyAliveChangeEvent;                              // 0xF38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UQtnPerkComponent*                     CharacterPerkComponent;                            // 0xF48(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnUpgradeComponent*                  CharacterUpgradeComponent;                         // 0xF50(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FQtnTagPresence>               DescriptiveTags;                                   // 0xF58(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FQtnUpgradeSlotConfiguration>  BodyUpgradeSlots;                                  // 0xF68(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UQtnUpgradeSlot*>               R_UpgradeSlots;                                    // 0xF78(0x10)(ExportObject, Net, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class AQtnPlayerPawn*                        M_pHijackingPlayerPawn;                            // 0xF88(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_asyncLeftHandWallDetected;                       // 0xF90(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_asyncRightHandWallDetected;                      // 0xF91(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_asyncLeanWallDetected;                           // 0xF92(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A64[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_remainingJumpInputBuffer;                        // 0xF94(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A66[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UObject*>                       M_jumpInhibitors_serveronly;                       // 0xFC8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	bool                                         R_isJumpInhibited;                                 // 0xFD8(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A67[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnInventoryComponent*                M_pBodyInventory;                                  // 0xFE0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnItem*                              R_pActualEquippedRangedWeapon;                     // 0xFE8(0x8)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AQtnItem*                              R_pActualEquippedMeleeWeapon;                      // 0xFF0(0x8)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AQtnItem*                              M_pHiddenRangedWeaponToRestore;                    // 0xFF8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AQtnItem*                              M_pHiddenMeleeWeaponToRestore;                     // 0x1000(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                       M_EmptyHandsRequests;                              // 0x1008(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnItemEquipEvent;                                  // 0x1018(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnItemUnEquipEvent;                                // 0x1028(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FQtnBodyRotationLockInfo              M_bodyRotationLockInfo;                            // 0x1038(0x40)(Transient, NativeAccessSpecifierPrivate)
	float                                        M_standingHeight;                                  // 0x1078(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_crouchHeight;                                    // 0x107C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_lastRepulsionInput;                              // 0x1080(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FQtnMantleConfig                      MantleConfig;                                      // 0x108C(0x18)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                        LandingRecoveryMinDuration;                        // 0x10A4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RepulsionScale;                                    // 0x10A8(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BaseLocomotionSpeed;                               // 0x10AC(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQtnFrobAccumulatorComponent*          M_pCurrentlyEngagedFrobAccumulator;                // 0x10B0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        R_remainingKnockdownTime;                          // 0x10B8(0x4)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A69[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnFrobbableComponent*                R_pCurrentEngagementTarget;                        // 0x10C0(0x8)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        R_mantleSpeedMultiplier;                           // 0x10C8(0x4)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A6A[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            BodyPawnVisibilityChangedEvent;                    // 0x10E0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UObject*>                       M_localBodyHiders;                                 // 0x10F0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FQtnAIBodyAppearance>          M_AIBodyAppearances;                               // 0x1100(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class USkeletalMeshComponent*>        M_customizationMeshes;                             // 0x1110(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UQtnCharacterAppearanceComponent*      M_BodyAppearanceComponent;                         // 0x1120(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                M_pLastMantleWallActor;                            // 0x1128(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   M_pLastMantleWallComponent;                        // 0x1130(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                M_pLastMantleCeilingActor;                         // 0x1138(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   M_pLastMantleCeilingComponent;                     // 0x1140(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                M_pLastMantleDepthActor;                           // 0x1148(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   M_pLastMantleDepthComponent;                       // 0x1150(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UObject*, struct FLinearColor>    M_persistentLightingColors;                        // 0x1158(0x50)(Transient, NativeAccessSpecifierPrivate)
	float                                        StealthBonusWhenCrouching;                         // 0x11A8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                          M_corpseVisibilityColor;                           // 0x11AC(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bShouldEverUpdateSlideAudio;                       // 0x11BC(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanEverUseHeadAim;                                // 0x11BD(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A6B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  AggregationKey;                                    // 0x11C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RoundRobinBucketSize;                              // 0x11C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInfiniteRage;                                     // 0x11CC(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInfiniteSprint;                                   // 0x11CD(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A6C[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AQtnBodyPawn* GetDefaultObj();

	void UpdateAppearance();
	void UnlockBodyYaw(class UObject* RequestingObject);
	void SetMantleSpeedMultiplier_ServerOnly(float DesiredMultiplier);
	void SetLocoBlendOverride(class UObject* OverridingObject, class UBlendSpace* LocoBlendOverride, enum class EQtnLocoOverridePriority Priority);
	void SetLockedBodyYaw(float WorldYaw);
	void SetAimPitchBlend(class UBlendSpace1D* AimPitchBlend1D);
	void ServerSetScriptedAction(const struct FQtnActionIntention& ActionIntention);
	void ServerSetBodyAliveness(enum class EQtnBodyAliveness bodyAliveness, class AActor* AlivenessInstigator);
	void ServerRequestScriptedVOForThisPlayer(class AActor* PSpeaker, const struct FGameplayTag& ScriptedId, bool PreferToPlayOnBody, int32 PrescribedVariant, int32 PriorityOverride);
	void ServerRequestMantle(const struct FVector& MantleDirection, const struct FVector& LedgePoint, const struct FVector& TargetPoint, const struct FVector& StartingLocation, bool Vault);
	void ServerRequestJump(bool CanMantle, bool IntentionalJump, float TopZ, bool AirControl);
	void ServerRequestItemUse(class AQtnItem* PItem, class AActor* PIntendedTarget, bool AltUse, enum class EQtnItemUseIntent UseIntent);
	void ServerRequestFrob(class UQtnFrobbableComponent* PFrobTarget);
	void ServerPushScriptedAction(const struct FQtnActionIntention& NonLoopingActionIntention);
	void ServerMarkDataBagOccupy();
	void ServerFinishCurrentFullBodyState();
	void ServerDisengageFrob();
	void ServerCancelScriptedAction();
	void ServerBodyUnOccupy(class AQtnPlayerPawn* POccupyingPlayer);
	void RemoveStatusEffect_ServerOnly(TSubclassOf<class UQtnStatusEffect> StatusEffectClass);
	void RemoveJumpInhibitor_ServerOnly(class UObject* JumpInhibitor);
	void RemoveEmptyHandsInducer(class UObject* Culprit);
	void QtnItemEquipEvent__DelegateSignature(class AQtnItem* Item);
	void QtnBodyPawnFootstepEvent__DelegateSignature(enum class EPhysicalSurface PhysicalSurface, struct FVector& ImpactLocation, struct FVector& ImpactNormal, float FootstepLoudness);
	void QtnBodyAliveChangeEvent__DelegateSignature(class AQtnBodyPawn* bodyPawn, class AActor* AlivenessInstigator, enum class EQtnBodyAliveness OldBodyAliveness, enum class EQtnBodyAliveness bodyAliveness, bool IsServer);
	void QtnAICombatBeginEvent__DelegateSignature(class AQtnBodyPawn* AiBody);
	class UAudioComponent* PlaySound(class USoundBase* Sound, bool Spatialize);
	void OnStanceChanged();
	void OnRep_OccupyingPlayerPawn();
	void OnRep_BodyAliveness();
	void OnBodyPawnUnOccupied(class AQtnPlayerPawn* OccupyingPlayerPawn);
	void OnBodyPawnOccupied(class AQtnPlayerPawn* OccupyingPlayerPawn);
	void OnAIBodyAppearanceUpdated();
	void MulticastRequestMantle(const struct FVector& MantleDirection, const struct FVector& LedgePoint, const struct FVector& TargetPoint, const struct FVector& StartingLocation, bool Vault);
	void MulticastRequestJump(bool CanMantle, bool IntentionalJump, float TopZ, bool AirControl);
	void MulticastRequestItemUse(class AQtnItem* PItem, class AActor* PIntendedTarget, bool AltUse, enum class EQtnItemUseIntent UseIntent);
	void MulticastRequestFrob(class UQtnFrobbableComponent* PFrobTarget);
	void MulticastPushScriptedAction(const struct FQtnActionIntention& ActionIntention);
	void MulticastFinishCurrentFullBodyState();
	void MulticastDisengageFrob();
	void LockBodyYaw(class UObject* RequestingObject);
	void LocalSetScriptedAction(struct FQtnActionIntention& ActionIntention);
	void LocalSetMeleeWeaponVisible();
	void LocalSetBodyHidden(bool Hidden, class UObject* bodyHider);
	void LocalRequestDodge();
	void LocalPushScriptedAction(struct FQtnActionIntention& NonLoopingActionIntention);
	void LocalCancelScriptedAction();
	bool IsTryingToJump();
	bool IsOccupiedByPlayer();
	bool IsKnockedDown();
	bool IsJumpInhibited();
	bool IsHitReacting();
	bool IsDoingScriptedAction(bool* FullBody);
	bool IsDoingQueuedAction();
	bool IsDead(bool* CanBeRevived);
	bool IsBoss();
	bool IsBodyIdle(bool RequireStandingStill);
	bool IsAirborne(bool IncludeVerbs);
	void InduceEmptyHands(bool WantEmptyHands);
	bool HasUpgrade(TSubclassOf<class UQtnUpgrade> UpgradeClass, bool UseInheritance);
	bool HasStatusEffect(TSubclassOf<class UQtnStatusEffect> StatusEffectClass);
	void HandleLandFootstep(class AQtnPawn* TargetPawn, struct FHitResult& HitResult);
	void HandleInventoryItemRemoved(class AQtnItem* PRemovedItem);
	TArray<class UQtnUpgradeSlot*> GetUpgradeSlots();
	class UQtnStatusEffect* GetStatusEffect(TSubclassOf<class UQtnStatusEffect> StatusEffectClass);
	class AActor* GetStartActor_ServerOnly();
	class AQtnPlayerState* GetOccupyingPlayerState();
	class AQtnPlayerPawn* GetOccupyingPlayerPawn();
	TArray<class AQtnBodyPawn*> GetNearbyFriendBodies();
	void GetLocoThrottleAndDirection(float* LocoThrottle, float* LocoDirectionDegrees);
	class AQtnPlayerPawn* GetHijackingPlayerPawn();
	class AQtnBodyPawn* GetHijackingBodyPawn();
	class UQtnUpperBodyState* GetExistingUpperBodyState(TSubclassOf<class UQtnUpperBodyState> UpperBodyStateClass);
	class UQtnFullBodyState* GetExistingFullBodyState(TSubclassOf<class UQtnFullBodyState> FullBodyStateClass);
	struct FQtnEntityTuningDataRow GetEntityTuningData();
	class UQtnUpperBodyState* GetCurrentUpperBodyState();
	TArray<class UQtnUpgrade*> GetCurrentUpgradesArray();
	int32 GetCurrentUpgrades(TArray<class UQtnUpgrade*>& CurrentUpgrades);
	class AActor* GetCurrentlyTargetedActor(bool IncludePerceptionResults);
	class UQtnFrobbableComponent* GetCurrentlyFrobbedObject();
	class UQtnFullBodyState* GetCurrentFullBodyState();
	class UQtnInventoryComponent* GetBodyInventory();
	struct FVector GetBodyIntentionWorldMovement();
	struct FVector GetBodyIntentionLocalMovement();
	class AQtnBodyController* GetBodyController();
	class UQtnCharacterAppearanceComponent* GetBodyAppearanceComponent();
	class AActor* GetBodyAlivenessInstigator();
	enum class EQtnBodyAliveness GetBodyAliveness();
	TArray<class UQtnStatusEffect*> GetAllStatusEffects();
	TArray<struct FQtnTagPresence> GetAllBodyTagDescriptions(TArray<struct FQtnTagPresence>& TagDescriptions);
	void GetAllBodyPawns(class UObject* SelfReference, TArray<class AQtnBodyPawn*>* FoundBodyPawns, class FName ActorTagFilter, class FName SpawnerRegionFilter);
	class AQtnItem* GetActualEquippedItem(bool Ranged);
	class UQtnUpgradeSlot* FindUpgrade(TSubclassOf<class UQtnUpgrade> UpgradeClass, bool UseInheritance);
	void DisengageFrob();
	void ClientRequestJump(bool CanMantle, bool IntentionalJump, float TopZ, bool AirControl);
	bool CanSeeThisActor(class AActor* ActorToCheck, float VisionConeDistance, float VisionConeYawDegrees, float VisionConePitchDegrees);
	bool CanBeRevived(class AQtnPawn* OtherPawn);
	bool AreHandsEmpty();
	class UQtnStatusEffect* AddStatusEffect_ServerOnly(TSubclassOf<class UQtnStatusEffect> StatusEffectClass, class AQtnPawn* StatusInstigator);
	void AddJumpInhibitor_ServerOnly(class UObject* JumpInhibitor);
	void AddEmptyHandsInducer(class UObject* Culprit);
};

// 0x8 (0x30 - 0x28)
// Class QtnGame.QtnFSMState
class UQtnFSMState : public UObject
{
public:
	bool                                         M_isStateActive;                                   // 0x28(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A83[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnFSMState* GetDefaultObj();

	bool IsStateActive();
};

// 0x80 (0xB0 - 0x30)
// Class QtnGame.QtnBodyState
class UQtnBodyState : public UQtnFSMState
{
public:
	class AQtnBodyPawn*                          M_pOwningPawn;                                     // 0x30(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UQtnAnimWindow*>                M_pendingAnimWindows;                              // 0x38(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                         M_hasTickedAtLeastOnceSinceEntering;               // 0x48(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1AA9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            EnterBodyStateEvent;                               // 0x50(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            TickBodyStateEvent;                                // 0x60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            ExitBodyStateEvent;                                // 0x70(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            AnimWindowBeginEvent;                              // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            AnimWindowEndEvent;                                // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            AnimNotifyEvent;                                   // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnBodyState* GetDefaultObj();

	void QtnTickBodyStateEvent__DelegateSignature(class UQtnBodyState* SelfBodyState, float DeltaSeconds);
	void QtnExitBodyStateEvent__DelegateSignature(class UQtnBodyState* SelfBodyState, TSubclassOf<class UQtnBodyState> NextBodyStateClass);
	void QtnEnterBodyStateEvent__DelegateSignature(class UQtnBodyState* SelfBodyState, class UQtnBodyState* PreviousBodyState);
	void QtnBodyStateAnimNotifyEvent__DelegateSignature(class UQtnAnimNotify* AnimNotify);
	void QtnAnimWindowEndEvent__DelegateSignature(class UQtnAnimWindow* AnimWindow, bool Interrupted);
	void QtnAnimWindowBeginEvent__DelegateSignature(class UQtnAnimWindow* AnimWindow, float TotalDuration);
	void OnTickBodyState(float DeltaSeconds);
	void OnInitBodyState();
	void OnExitBodyState(TSubclassOf<class UQtnBodyState> NextBodyStateClass);
	void OnEnterBodyState(class UQtnBodyState* PreviousBodyState);
	void OnDebugDisplay(class UQtnDebugWrapper* DebugWrapper);
	void OnAnimWindowEnd(class UQtnAnimWindow* AnimWindow, bool Interrupted);
	void OnAnimWindowBegin(class UQtnAnimWindow* AnimWindow, float TotalDuration);
	void OnAnimNotify(class UQtnAnimNotify* AnimNotify);
	class AQtnBodyPawn* GetOwningPawn();
};

// 0x10 (0x260 - 0x250)
// Class QtnGame.QtnBPActor
class AQtnBPActor : public AActor
{
public:
	TArray<TSoftObjectPtr<class AActor>>         LinkedActors;                                      // 0x250(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AQtnBPActor* GetDefaultObj();

	void OnEditorSelected(bool IsSelected);
	void OnEditorPropertyChange(class FName PropertyName);
	void OnEditorLinkedActorDeleted(class AActor* LinkedActor);
	void OnEditorCheckForErrors();
	void OnEditorActorMoved(bool Finished);
};

// 0x0 (0xE0 - 0xE0)
// Class QtnGame.QtnBPActorProxyComponent
class UQtnBPActorProxyComponent : public UActorComponent
{
public:

	static class UClass* StaticClass();
	static class UQtnBPActorProxyComponent* GetDefaultObj();

};

// 0x1A8 (0x288 - 0xE0)
// Class QtnGame.QtnBreadCrumbComponent
class UQtnBreadCrumbComponent : public UActorComponent
{
public:
	float                                        MaxCornerDistance;                                 // 0xE0(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_maxCornerDistSq;                                 // 0xE4(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        HeightOffset;                                      // 0xE8(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1ACC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AQtnGameState*                         M_pCachedGameState;                                // 0xF0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                M_pOwningActor;                                    // 0xF8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_implementsNavHelperInterface;                    // 0x100(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1ACD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AQtnBodyPawn*                          M_pTrackedLocalPlayerBody;                         // 0x108(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_currentPlayerLocation;                           // 0x110(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_currentDestination;                              // 0x11C(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_projectionBounds;                                // 0x128(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_suggestedWaypoint;                               // 0x134(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_isAtDestination;                                 // 0x140(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_needsRefresh;                                    // 0x141(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_repathSuggested;                                 // 0x142(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_isCurrentResultReliable;                         // 0x143(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1AD0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnNavigationSystem*                  M_pNavSys;                                         // 0x148(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNavigationPath*                       M_pLastGoodPathResult;                             // 0x150(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1AD2[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint32                                       M_asyncQueryID;                                    // 0x168(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_trackIsPending;                                  // 0x16C(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1AD3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnPathBuilt;                                       // 0x170(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                        MaxSearchNodes;                                    // 0x180(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         LockToDestination;                                 // 0x184(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1AD6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnOnScreen_Texture                  OnScreen_Indicator;                                // 0x188(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FQtnOffScreen_Texture                 OffScreen_Indicator;                               // 0x1B0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FQtnIndicatorType                     IndicatorType;                                     // 0x1D0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FQtnEffects                           Indicator_Effects;                                 // 0x1D8(0xB0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnBreadCrumbComponent* GetDefaultObj();

	void StopLocalPlayerTracking();
	bool StartLocalPlayerTracking();
	void QtnOnPathBuiltEvent__DelegateSignature(bool IsCurrentResultReliable);
	bool IsAtDestination();
	void HandleLocalPlayerTeleport(const struct FVector& OldLocation, const struct FRotator& OldRotation, const struct FVector& NewLocation, const struct FRotator& NewRotation);
	struct FVector GetSuggestedWaypoint(bool* IsCurrentResultReliable, bool* IsAtDestination);
	void GetPathResult(class UNavigationPath** LastGoodResult, bool* IsCurrentResultReliable);
};

// 0x0 (0x68 - 0x68)
// Class QtnGame.QtnBTDecorator
class UQtnBTDecorator : public UBTDecorator
{
public:

	static class UClass* StaticClass();
	static class UQtnBTDecorator* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class QtnGame.QtnBTDecoratorCompareBool
class UQtnBTDecoratorCompareBool : public UQtnBTDecorator
{
public:
	struct FBlackboardKeySelector                BoolKey;                                           // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)
	bool                                         ContinueIf;                                        // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1AE0[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnBTDecoratorCompareBool* GetDefaultObj();

};

// 0x8 (0x70 - 0x68)
// Class QtnGame.QtnBTDecoratorEnemyPerceived
class UQtnBTDecoratorEnemyPerceived : public UQtnBTDecorator
{
public:
	float                                        AcceptableAbsenceDuration;                         // 0x68(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         VisualPerceptionOnly;                              // 0x6C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1AE2[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnBTDecoratorEnemyPerceived* GetDefaultObj();

};

// 0x0 (0x68 - 0x68)
// Class QtnGame.QtnBTDecoratorInterestedInHiding
class UQtnBTDecoratorInterestedInHiding : public UQtnBTDecorator
{
public:

	static class UClass* StaticClass();
	static class UQtnBTDecoratorInterestedInHiding* GetDefaultObj();

};

// 0x0 (0x68 - 0x68)
// Class QtnGame.QtnBTDecoratorInterestedInSniping
class UQtnBTDecoratorInterestedInSniping : public UQtnBTDecorator
{
public:

	static class UClass* StaticClass();
	static class UQtnBTDecoratorInterestedInSniping* GetDefaultObj();

};

// 0x10 (0x80 - 0x70)
// Class QtnGame.QtnBTTask
class UQtnBTTask : public UBTTaskNode
{
public:
	uint8                                        Pad_1AE4[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnBTTask* GetDefaultObj();

};

// 0x0 (0x80 - 0x80)
// Class QtnGame.QtnBTTaskBP
class UQtnBTTaskBP : public UQtnBTTask
{
public:

	static class UClass* StaticClass();
	static class UQtnBTTaskBP* GetDefaultObj();

	void TickBPTask(class AQtnBodyController* bodyController, class UBlackboardComponent* BlackboardComponent, float DeltaSeconds, float ElapsedTime);
	void StartBPTask(class AQtnBodyController* bodyController, class UBlackboardComponent* BlackboardComponent);
	bool IsBPTaskFinished(class AQtnBodyController* bodyController, class UBlackboardComponent* BlackboardComponent, float ElapsedTime, bool* Success);
	class FString GetDescription();
	void EndBPTask(class AQtnBodyController* bodyController, class UBlackboardComponent* BlackboardComponent, bool Success);
};

// 0x8 (0x88 - 0x80)
// Class QtnGame.QtnBTTaskEnableAttacks
class UQtnBTTaskEnableAttacks : public UQtnBTTask
{
public:
	bool                                         WantAttacksEnabled;                                // 0x80(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1AF9[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnBTTaskEnableAttacks* GetDefaultObj();

};

// 0x38 (0xB8 - 0x80)
// Class QtnGame.QtnBTTaskFrob
class UQtnBTTaskFrob : public UQtnBTTask
{
public:
	struct FBlackboardKeySelector                FrobTargetKey;                                     // 0x80(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       RandomDuration;                                    // 0xA8(0x8)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       SecondsBeforeGivingUp;                             // 0xB0(0x8)(Edit, NoDestructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnBTTaskFrob* GetDefaultObj();

};

// 0x8 (0x88 - 0x80)
// Class QtnGame.QtnBTTaskInduceEmptyHands
class UQtnBTTaskInduceEmptyHands : public UQtnBTTask
{
public:
	bool                                         WantEmptyHands;                                    // 0x80(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1AFC[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnBTTaskInduceEmptyHands* GetDefaultObj();

};

// 0x40 (0xC0 - 0x80)
// Class QtnGame.QtnBTTaskMoveTo
class UQtnBTTaskMoveTo : public UQtnBTTask
{
public:
	struct FBlackboardKeySelector                DestinationKey;                                    // 0x80(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       RandomDuration;                                    // 0xA8(0x8)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                         MoveWithinAttackRange;                             // 0xB0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1AFD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             Leeway;                                            // 0xB4(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1AFE[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnBTTaskMoveTo* GetDefaultObj();

};

// 0x80 (0x100 - 0x80)
// Class QtnGame.QtnBTTaskPawnAction
class UQtnBTTaskPawnAction : public UQtnBTTask
{
public:
	struct FQtnPawnMontage                       PawnAction;                                        // 0x80(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                TargetActorKey;                                    // 0x90(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                LookFocusActorKey;                                 // 0xB8(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       RandomStartTime;                                   // 0xE0(0x8)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       RandomPlayRate;                                    // 0xE8(0x8)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       RandomDuration;                                    // 0xF0(0x8)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       SecondsBeforeGivingUp;                             // 0xF8(0x8)(Edit, NoDestructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnBTTaskPawnAction* GetDefaultObj();

};

// 0x0 (0x80 - 0x80)
// Class QtnGame.QtnBTTaskQuitJob
class UQtnBTTaskQuitJob : public UQtnBTTask
{
public:

	static class UClass* StaticClass();
	static class UQtnBTTaskQuitJob* GetDefaultObj();

};

// 0x60 (0xE0 - 0x80)
// Class QtnGame.QtnBTTaskRequestVerb
class UQtnBTTaskRequestVerb : public UQtnBTTask
{
public:
	TSubclassOf<class UQtnVerb>                  VerbClass;                                         // 0x80(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                VerbArchetypeKey;                                  // 0x88(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                VerbTargetKey;                                     // 0xB0(0x28)(Edit, NativeAccessSpecifierPrivate)
	bool                                         AddVerbOnDemand;                                   // 0xD8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         RemoveOtherAddedVerbs;                             // 0xD9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1B0B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SecondsBeforeGivingUp;                             // 0xDC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnBTTaskRequestVerb* GetDefaultObj();

};

// 0x98 (0x118 - 0x80)
// Class QtnGame.QtnBTTaskSetTether
class UQtnBTTaskSetTether : public UQtnBTTask
{
public:
	TArray<struct FBlackboardKeySelector>        TetherKeys;                                        // 0x80(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                InnerRadiusKey;                                    // 0x90(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                OuterRadiusKey;                                    // 0xB8(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       TetherRadii;                                       // 0xE0(0x8)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                VerticalRatioKey;                                  // 0xE8(0x28)(Edit, NativeAccessSpecifierPrivate)
	float                                        TetherVerticalRatio;                               // 0x110(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1B10[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnBTTaskSetTether* GetDefaultObj();

};

// 0x38 (0xB8 - 0x80)
// Class QtnGame.QtnBTTaskWaitForVerb
class UQtnBTTaskWaitForVerb : public UQtnBTTask
{
public:
	TSubclassOf<class UQtnVerb>                  VerbClass;                                         // 0x80(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                VerbArchetypeKey;                                  // 0x88(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       SecondsBeforeGivingUp;                             // 0xB0(0x8)(Edit, NoDestructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnBTTaskWaitForVerb* GetDefaultObj();

};

// 0x80 (0xA8 - 0x28)
// Class QtnGame.QtnBullshit
class UQtnBullshit : public UObject
{
public:
	uint8                                        Pad_1B22[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnBullshitManagerComponent*          R_pOwningBullshitManager;                          // 0x38(0x8)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnBullshitManagerComponent*          L_pOwningBullshitManager;                          // 0x40(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnPawn*                              R_pCulprit;                                        // 0x48(0x8)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>             IconForUI;                                         // 0x50(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  FriendlyName;                                      // 0x78(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x90(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnBullshit* GetDefaultObj();

	void OnRep_OwningBullshitManager();
	void OnDebugDisplay(class UQtnDebugWrapper* DebugWrapper);
	void OnBullshitTick(float DeltaSeconds);
	void OnBullshitStop();
	void OnBullshitStart();
	void OnBullshitLocalInit(class UQtnBullshitManagerComponent* OwningBullshitManager);
	bool IsServer();
	class UWorld* GetWorld();
	class UQtnBullshitManagerComponent* GetOwningBullshitManager();
	class UTexture2D* GetIconForUI();
	class AQtnPawn* GetCulprit();
	class UQtnBullshit* GetBullshitArchetype(TSubclassOf<class UQtnBullshit> bullshitClass);
	void FinishBullshit_ServerOnly();
};

// 0x70 (0x150 - 0xE0)
// Class QtnGame.QtnBullshitManagerComponent
class UQtnBullshitManagerComponent : public UActorComponent
{
public:
	uint8                                        Pad_1B34[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UQtnBullshit*>                  R_bullshitInstances;                               // 0xE8(0x10)(ExportObject, Net, ZeroConstructor, Transient, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UQtnBullshit*>                  L_bullshitInstances;                               // 0xF8(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	bool                                         M_checkForBullshitDeltasPending;                   // 0x108(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1B36[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UQtnBullshit*>                  M_lastStartedBullshit;                             // 0x110(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UQtnBullshit*>                  M_lastStoppedBullshit;                             // 0x120(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_            BullshitStartEvent;                                // 0x130(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            BullshitStopEvent;                                 // 0x140(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnBullshitManagerComponent* GetDefaultObj();

	void RemoveBullshit_ServerOnly(TSubclassOf<class UQtnBullshit> bullshitClass, class AQtnPawn* Culprit);
	void QtnBullshitEvent__DelegateSignature(TArray<class UQtnBullshit*>& bullshitArray);
	void OnRep_BullshitInstances();
	void OnDebugDisplay(class UQtnDebugWrapper* DebugWrapper);
	bool IsBullshitActive(TSubclassOf<class UQtnBullshit> bullshitClass, class AQtnPawn* Culprit);
	class UQtnBullshitManagerComponent* GetBullshitManager(class UObject* WorldContextObject);
	TArray<class UQtnBullshit*> GetAllActiveBullshits();
	class UQtnBullshit* GetActiveBullshit(TSubclassOf<class UQtnBullshit> bullshitClass, class AQtnPawn* Culprit);
	class UQtnBullshit* AddBullshit_ServerOnly(TSubclassOf<class UQtnBullshit> bullshitClass, class AQtnPawn* Culprit);
};

// 0xC8 (0xF0 - 0x28)
// Class QtnGame.QtnCameraBehavior
class UQtnCameraBehavior : public UObject
{
public:
	class UQtnCameraComponent*                   M_pOwningCameraComponent;                          // 0x28(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AQtnPawn*                              M_pOwningPawn;                                     // 0x30(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UObject*>                       M_requestors;                                      // 0x38(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	enum class EQtnCameraBlendState              M_camBlendState;                                   // 0x48(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1B4C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_currentBlendTimer;                               // 0x4C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        M_cachedFOVScale;                                  // 0x50(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        M_cachedBaseFOV;                                   // 0x54(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        M_cachedScaledFOV;                                 // 0x58(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SweepSize;                                         // 0x5C(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ObstructionLerpSpeed;                              // 0x60(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EQtnCameraPriority                CameraPriority;                                    // 0x64(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1B51[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BlendInTime;                                       // 0x68(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BlendOutTime;                                      // 0x6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Cut;                                               // 0x70(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UseFOVScale;                                       // 0x71(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B54[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  UILabel;                                           // 0x78(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  UIDescription;                                     // 0x90(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FName                                  CameraSocketName;                                  // 0xA8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraSocketOffsetUp;                              // 0xB0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraSocketOffsetRight;                           // 0xB4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraSocketOffsetForward;                         // 0xB8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultStickLookScale;                             // 0xBC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultMouseLookScale;                             // 0xC0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ShouldUseHeadAim;                                  // 0xC4(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ControlLookIntentions;                             // 0xC5(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B57[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnRangedFloat                       LookPitchRange;                                    // 0xC8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               TargetLocation;                                    // 0xD0(0xC)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              TargetRotation;                                    // 0xDC(0xC)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        TargetFOV;                                         // 0xE8(0x4)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B5D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnCameraBehavior* GetDefaultObj();

	void OnCameraBehaviorTick(float DeltaSeconds);
	void OnCameraBehaviorInit();
	void OnCameraBehaviorFadeOutEnd();
	void OnCameraBehaviorFadeInStart();
	float GetStickLookScale();
	class AQtnPawn* GetOwningPawn();
	class UQtnCameraComponent* GetOwningCameraComponent();
	float GetMouseLookScale();
};

// 0x40 (0x130 - 0xF0)
// Class QtnGame.QtnCameraBehaviorAim
class UQtnCameraBehaviorAim : public UQtnCameraBehavior
{
public:
	struct FVector                               M_pivotLocation;                                   // 0xF0(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_dollyLength;                                     // 0xFC(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_lastHitDistance;                                 // 0x100(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_obstructionLerpRatio;                            // 0x104(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnPlayerController*                  M_pLocalPlayerControllerToAimWith;                 // 0x108(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        PivotLocationInterpSpeed;                          // 0x110(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        LookInterpSpeed;                                   // 0x114(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        RearOffset;                                        // 0x118(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQtnRangedFloat                       VerticalOffsetRange;                               // 0x11C(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                        VerticalOffsetMaxDistance;                         // 0x124(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AimFOV;                                            // 0x128(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AllowSpinWhenIdle;                                 // 0x12C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UseAimSensitivity;                                 // 0x12D(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B68[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnCameraBehaviorAim* GetDefaultObj();

};

// 0x30 (0x120 - 0xF0)
// Class QtnGame.QtnCameraBehaviorAnimOverride
class UQtnCameraBehaviorAnimOverride : public UQtnCameraBehavior
{
public:
	struct FVector                               M_rootLocation;                                    // 0xF0(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_dollyLength;                                     // 0xFC(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        RearOffset;                                        // 0x100(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                             LateralOffset;                                     // 0x104(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        AnimFOV;                                           // 0x10C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DollyLengthInterpSpeed;                            // 0x110(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        LocationInterpSpeed;                               // 0x114(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_obstructionLerpRatio;                            // 0x118(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_lastHitDistance;                                 // 0x11C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnCameraBehaviorAnimOverride* GetDefaultObj();

};

// 0x18 (0x108 - 0xF0)
// Class QtnGame.QtnCameraBehaviorFirstPerson
class UQtnCameraBehaviorFirstPerson : public UQtnCameraBehavior
{
public:
	class AQtnBodyPawn*                          M_pOwningBodyPawn;                                 // 0xF0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_lerpingNeck;                                     // 0xF8(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1B6C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_neckOffsetLength;                                // 0xFC(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MaxNeckOffset;                                     // 0x100(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1B6D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnCameraBehaviorFirstPerson* GetDefaultObj();

};

// 0x90 (0x180 - 0xF0)
// Class QtnGame.QtnCameraBehaviorTether
class UQtnCameraBehaviorTether : public UQtnCameraBehavior
{
public:
	class AQtnBodyPawn*                          M_pOwningBodyPawn;                                 // 0xF0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnPlayerUI*                          M_pCachedPlayerUI;                                 // 0xF8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_tetherLength;                                    // 0x100(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_additiveFOVOffsetTarget;                         // 0x104(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_effectiveSprintTetherMultiplier;                 // 0x108(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_additiveFOVOffset;                               // 0x10C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_isUsingMouseAndKeyboard;                         // 0x110(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1B6F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_sprintTimer;                                     // 0x114(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_pivotLocation;                                   // 0x118(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_tetheredCamComponentLocation;                    // 0x124(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        PivotLocationInterpSpeed;                          // 0x130(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        TetherHorizontalLeeway;                            // 0x134(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MaxTetherLength;                                   // 0x138(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       VerticalOffsetRange;                               // 0x13C(0x8)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	float                                        VerticalOffsetMaxDistance;                         // 0x144(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MaxAdditiveSprintFOV;                              // 0x148(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SpeedRatioUponWhichFOVIsAffected;                  // 0x14C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FQtnRangedFloat                       SprintFOVEscalationDuration;                       // 0x150(0x8)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	float                                        MaxSprintSpeed;                                    // 0x158(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SprintTetherMultiplier;                            // 0x15C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        LookSmoothingInterpSpeed;                          // 0x160(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        TetherLengthInterpSpeed;                           // 0x164(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        FOVAccelerationSpeed;                              // 0x168(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        FOVDecelerationSpeed;                              // 0x16C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_obstructionLerpRatio;                            // 0x170(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_lastHitDistance;                                 // 0x174(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         AllowSpinWhenIdle;                                 // 0x178(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         StrafeMovementStick;                               // 0x179(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         StrafeMovementMouse;                               // 0x17A(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B74[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnCameraBehaviorTether* GetDefaultObj();

};

// 0xC0 (0x8C0 - 0x800)
// Class QtnGame.QtnCameraComponent
class UQtnCameraComponent : public UCameraComponent
{
public:
	class AQtnPawn*                              M_pOwningPawn;                                     // 0x800(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UQtnCameraBehavior*>            M_cameraBehaviorStack;                             // 0x808(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UQtnCameraBehavior>, class UQtnCameraBehavior*> M_managedCameraBehaviors;                          // 0x818(0x50)(ExportObject, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FQtnCameraContribution>        M_cameraContributions;                             // 0x868(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UQtnCameraBehavior*>            M_pendingCameraBehaviors;                          // 0x878(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UQtnCameraBehavior*                    M_pActiveCameraBehavior;                           // 0x888(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UQtnCameraBehavior*                    M_pAmbientCameraBehavior;                          // 0x890(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               M_targetLocation;                                  // 0x898(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                              M_targetRotation;                                  // 0x8A4(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                        M_targetFOV;                                       // 0x8B0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_pendingCut;                                      // 0x8B4(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1B7D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UQtnCameraBehavior>        AmbientCameraBehavior;                             // 0x8B8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnCameraComponent* GetDefaultObj();

	void UnRequestCameraBehavior(TSubclassOf<class UQtnCameraBehavior> CamBehaviorClass, class UObject* Requestor);
	void SetAmbientCameraBehavior(TSubclassOf<class UQtnCameraBehavior> CamBehaviorClass);
	class UQtnCameraBehavior* RequestCameraBehavior(TSubclassOf<class UQtnCameraBehavior> CamBehaviorClass, class UObject* Requestor);
	struct FRotator GetTargetRotation();
	struct FVector GetTargetLocation();
	float GetTargetFOV();
	struct FVector GetRelativeNeckOffset();
	class UQtnCameraBehavior* GetActiveCameraBehavior();
};

// 0x10 (0x58 - 0x48)
// Class QtnGame.QtnCameraModifierFullBodyEngagement
class UQtnCameraModifierFullBodyEngagement : public UCameraModifier
{
public:
	class AQtnBodyPawn*                          M_pEngagingPawn;                                   // 0x48(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UQtnFrobbableComponent*                M_pFrobTarget;                                     // 0x50(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnCameraModifierFullBodyEngagement* GetDefaultObj();

};

// 0x588 (0x5D0 - 0x48)
// Class QtnGame.QtnCameraModifierThirdPersonMontage
class UQtnCameraModifierThirdPersonMontage : public UCameraModifier
{
public:
	class AQtnBodyPawn*                          M_pOccupiedPawn;                                   // 0x48(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FQtnThirdPersonCameraParams           M_cameraParams;                                    // 0x50(0x18)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	float                                        M_FOV;                                             // 0x68(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1B88[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPostProcessSettings                  M_postProcessSettings;                             // 0x70(0x560)(Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnCameraModifierThirdPersonMontage* GetDefaultObj();

};

// 0xA8 (0x188 - 0xE0)
// Class QtnGame.QtnCarryComponent
class UQtnCarryComponent : public UActorComponent
{
public:
	uint8                                        Pad_1BAD[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                L_pCarryingActor;                                  // 0xE8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                R_pCarryingActor;                                  // 0xF0(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FQtnCarrySettings                     R_carrySettings;                                   // 0xF8(0x40)(Net, Transient, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	float                                        M_lerpTimer;                                       // 0x138(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               M_startingLocation;                                // 0x13C(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              M_startingRotation;                                // 0x148(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               M_detachedActorScale;                              // 0x154(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_doLerping;                                       // 0x160(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_carryActorRefreshPending;                        // 0x161(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_carryActorRefreshInProgress;                     // 0x162(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         M_hasBeenReadyForGameplay;                         // 0x163(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldBeTargetedWhileCarried;                     // 0x164(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPrecludeOtherTargetingWhileCarried;               // 0x165(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1BB6[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            CarryStartEvent;                                   // 0x168(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            CarryEndEvent;                                     // 0x178(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnCarryComponent* GetDefaultObj();

	void SetCarryingActor_ServerOnly(class AActor* CarryingActor, struct FQtnCarrySettings& CarrySettings);
	void QtnCarryStartEvent__DelegateSignature(class UQtnCarryComponent* CarryComponent, class AActor* CarryingActor, struct FQtnCarrySettings& CarrySettings, bool IsServer);
	void QtnCarryEndEvent__DelegateSignature(class UQtnCarryComponent* CarryComponent, class AActor* CarryingActor, bool IsServer);
	void OnRep_CarryingActor();
	class AActor* GetCarryingActor();
	void ClearCarryingActor_ServerOnly(bool DestroyCarriedActor);
};

// 0x0 (0x28 - 0x28)
// Class QtnGame.QtnCarryingActorInterface
class IQtnCarryingActorInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IQtnCarryingActorInterface* GetDefaultObj();

	bool ShouldDropCarriedObjects();
	void RemoveManagedCarryComponent(class UQtnCarryComponent* CarryComponent);
	void AddManagedCarryComponent(class UQtnCarryComponent* CarryComponent, struct FQtnCarrySettings& CarrySettings);
};

// 0x1F0 (0x2D0 - 0xE0)
// Class QtnGame.QtnCharacterAppearanceComponent
class UQtnCharacterAppearanceComponent : public UActorComponent
{
public:
	uint8                                        Pad_1C0C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnCharacterDefaultAppearance        DefaultCharacterAppearanceData;                    // 0xE8(0x60)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                        DefaultCharacterVoice;                             // 0x148(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        R_CharacterVoiceType;                              // 0x14C(0x4)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnPlayerState*                       M_pOwningPlayerState;                              // 0x150(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AQtnBodyPawn*                          M_pOwningBodyPawn;                                 // 0x158(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                OverrideEntityMesh;                                // 0x160(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsNonBodyPawnEntity;                               // 0x168(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_pendingAppearanceUpdate;                         // 0x169(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1C0D[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnCharacterAppearance               R_CharacterAppearanceData;                         // 0x170(0x30)(Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class UQtnVerb>>          R_equippedEmoteVerbs;                              // 0x1A0(0x10)(Net, ZeroConstructor, Transient, RepNotify, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class FString>                        R_vaultCosmeticsData;                              // 0x1B0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	TArray<class FString>                        R_vaultEmotesData;                                 // 0x1C0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                M_pBodyMesh;                                       // 0x1D0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                M_pHatMesh;                                        // 0x1D8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                M_pHairMesh;                                       // 0x1E0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                M_pCapeMesh;                                       // 0x1E8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                M_pHeadMesh;                                       // 0x1F0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                M_pHeadAccessoryMesh;                              // 0x1F8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class USkeletalMeshComponent*>        M_customizationMeshes;                             // 0x200(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class FString                                M_desiredBody;                                     // 0x210(0x10)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                M_desiredHat;                                      // 0x220(0x10)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                M_desiredHair;                                     // 0x230(0x10)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                M_desiredCape;                                     // 0x240(0x10)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                M_desiredHead;                                     // 0x250(0x10)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                M_desiredHeadAccessory;                            // 0x260(0x10)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FString>                        M_desiredEmotes;                                   // 0x270(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            OnUpdateAppearanceEvent;                           // 0x280(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCosmeticsVaultUpdated;                           // 0x290(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEmotesVaultUpdated;                              // 0x2A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEquippedEmotesUpdated;                           // 0x2B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            DebugDisplayEvent;                                 // 0x2C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnCharacterAppearanceComponent* GetDefaultObj();

	void UpdateAppearance();
	void SetupComponentForDefaults(class AQtnBodyPawn* POwnerBodypawn);
	void SetDesiredEmotes(TArray<class FString>& DesiredEmotes);
	void SetDesiredCosmetics(class FString& DesiredBody, class FString& DesiredHat, class FString& DesiredHair, class FString& DesiredCape, class FString& DesiredHead, class FString& DesiredHeadAccessory);
	void SetCharacterVisibility(bool bNewVisibility);
	void ServerUnsetEmote(int32 EmoteSlot);
	void ServerUnsetCosmetic(enum class EQtnAppearanceSlot AppearanceSlot);
	void ServerSetEmote(int32 EmotesIndex, int32 EmoteSlot);
	void ServerSetCosmetic(int32 CosmeticsIndex, enum class EQtnAppearanceSlot AppearanceSlot);
	void ServerAddAvailableItem(class FString& ItemId, bool IsEmote);
	void ServerAddAvailableEmotes(TArray<class FString>& Emotes);
	void ServerAddAvailableEmote(class FString& Emote);
	void ServerAddAvailableCosmetics(TArray<class FString>& Cosmetics);
	void ServerAddAvailableCosmetic(class FString& Cosmetic);
	TArray<class USkeletalMesh*> PreloadDefaultMeshesForClass(TSubclassOf<class AActor> ActorClass);
	void OnRep_VaultEmotesData();
	void OnRep_VaultCosmeticsData();
	void OnRep_EquippedEmoteVerbs();
	void OnRep_CharacterAppearanceData();
	void OnDebugDisplay(class UQtnDebugWrapper* DebugWrapper);
	void LocalUnsetCosmetic(enum class EQtnAppearanceSlot AppearanceSlot);
	void LocalSetUnownedCosmetic(enum class EQtnAppearanceSlot AppearanceSlot, class FString& CosmeticsId);
	void LocalSetEmote(int32 EmotesIndex, int32 EmoteSlot);
	void LocalSetCosmetic(int32 CosmeticsIndex, enum class EQtnAppearanceSlot AppearanceSlot);
	int32 LocalFindCosmeticIndex(class FString& CosmeticItemToFind);
	void LocalCopyCosmeticsFromTarget(class UQtnCharacterAppearanceComponent* TargetAppearanceComponent);
	TArray<class FString> GetVaultEmotesData();
	TArray<class FString> GetVaultCosmeticsData();
	class USkeletalMeshComponent* GetHeadComponent();
	class USkeletalMeshComponent* GetHeadAccessoryComponent();
	class USkeletalMeshComponent* GetHatComponent();
	class USkeletalMeshComponent* GetHairComponent();
	TArray<TSubclassOf<class UQtnVerb>> GetEquippedEmotes();
	TArray<class FString> GetEquippedCosmetics();
	struct FQtnCharacterAppearance GetCharacterAppearanceData();
	class USkeletalMeshComponent* GetCapeComponent();
	class USkeletalMeshComponent* GetBodyComponent();
	class USkeletalMeshComponent* AddAndUpdateMeshSlot(class USkeletalMeshComponent* PParentMesh, class UQtnCharacterBodyMesh* PCharacterMesh, class FName& AttachmentSocket);
};

// 0x8 (0x30 - 0x28)
// Class QtnGame.QtnCharacterAppearanceSettings
class UQtnCharacterAppearanceSettings : public UObject
{
public:
	class UDataTable*                            MasterCosmeticDataTable;                           // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnCharacterAppearanceSettings* GetDefaultObj();

	TSubclassOf<class UQtnVerb> GetEmoteVerbClass(const class FString& EmoteVerbName, bool* Success, class UObject* WorldContextObject);
	void GetCharacterAppearanceDisplayText(const class FString& CatalogId, const class FString& ItemId, class FText* OutDisplayName, class FText* OutDescription, class UObject* WorldContextObject);
	TSubclassOf<class UQtnCharacterBodyMesh> GetBodyMeshClass(const class FString& bodyMeshName, bool* Success, class UObject* WorldContextObject);
};

// 0x50 (0x78 - 0x28)
// Class QtnGame.QtnCharacterBodyMesh
class UQtnCharacterBodyMesh : public UObject
{
public:
	class FName                                  PlayFabItemId;                                     // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  AttachToSocket;                                    // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ApplyMorphTarget;                                  // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         BypassClothBakeRestriction;                        // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnAppearanceSlot                SlotType;                                          // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C1C[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class USkeletalMesh>          DefaultBodyMesh;                                   // 0x40(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FQtnMaterialOverrideParameter> MeshMaterialOverrideParameters;                    // 0x68(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnCharacterBodyMesh* GetDefaultObj();

	void OnBodyMeshAcquired(class USkeletalMeshComponent* ComponentAdded);
};

// 0x8 (0x90 - 0x88)
// Class QtnGame.QtnCheatManager
class UQtnCheatManager : public UCheatManager
{
public:
	class AQtnPlayerController*                  M_pOwningPlayerController;                         // 0x88(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UQtnCheatManager* GetDefaultObj();

	void QtnSetControllerId(int32 ControllerId);
	void QtnAutomatedReports();
	bool AreCheatsLocked();
};

// 0x1A8 (0x1D0 - 0x28)
// Class QtnGame.QtnSaveData
class UQtnSaveData : public USaveGame
{
public:
	struct FQtnVersion                           M_storedSaveDataVersion;                           // 0x28(0xC)(SaveGame, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1C33[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnSaveLoadState*                     M_pDrivingSaveLoadState;                           // 0x38(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                M_slotName;                                        // 0x40(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UQtnDataBag>, struct FQtnDataBagBytes> M_dataBagBytes;                                    // 0x50(0x50)(SaveGame, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UQtnDataBag>, class UQtnDataBag*> M_dataBagInstances;                                // 0xA0(0x50)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UQtnDataBag>, class UQtnDataBag*> M_customDataBags;                                  // 0xF0(0x50)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<uint8>                                M_storedBytes;                                     // 0x140(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class UQtnDataBag>>       CustomDataBags;                                    // 0x150(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FQtnVersion                           DeprecatedSaveDataVersion;                         // 0x160(0xC)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FQtnVersion                           LatestSaveDataVersion;                             // 0x16C(0xC)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FQtnVersion                           M_currentSaveDataVersion;                          // 0x178(0xC)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1C36[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UQtnSaveLoadManager*                   M_pOwningSaveLoadManager;                          // 0x188(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            PreSaveEvent;                                      // 0x190(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            PostSaveEvent;                                     // 0x1A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            PreLoadEvent;                                      // 0x1B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            PostLoadEvent;                                     // 0x1C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UQtnSaveData* GetDefaultObj();

	void QtnPreSaveLoadDataEvent__DelegateSignature(class AQtnBodyPawn* LocalOriginalBody);
	void QtnPostSaveLoadDataEvent__DelegateSignature(bool Success, class AQtnBodyPawn* LocalOriginalBody);
	void OnDebugDisplay(class UQtnDebugWrapper* DebugWrapper);
	bool HasValidSaveData();
	struct FQtnVersion GetLatestSaveDataVersion();
	class UQtnDataBag* GetCustomDataBag(TSubclassOf<class UQtnDataBag> DatabagArchetype);
	struct FQtnVersion GetCurrentSaveDataVersion();
};

// 0x78 (0x248 - 0x1D0)
// Class QtnGame.QtnCloudOptionsSaveData
class UQtnCloudOptionsSaveData : public UQtnSaveData
{
public:
	class UQtnInputDataBag*                      M_pInputDataBag;                                   // 0x1D0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UQtnInputDataBag>          InputDataBagArchetype;                             // 0x1D8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AQtnPlayerPawn*                        M_pCachedLocalPlayerPawn;                          // 0x1E0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         SavedInvertMouseLookY;                             // 0x1E8(0x1)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SavedInvertStickLookY;                             // 0x1E9(0x1)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C77[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SavedStickLookSpeed;                               // 0x1EC(0x4)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SavedStickAimSpeed;                                // 0x1F0(0x4)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SavedMouseLookSpeed;                               // 0x1F4(0x4)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SavedMouseAimSpeed;                                // 0x1F8(0x4)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SavedGyroAiming;                                   // 0x1FC(0x1)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C79[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SavedGyroSensitivity;                              // 0x200(0x4)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SavedForceFeedback;                                // 0x204(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C7B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SavedFOVScaleRatio;                                // 0x208(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EQtnGamepadGlyphStyle             SavedGamepadGlyphStyle;                            // 0x20C(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C7D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SavedAudioMasterVolume;                            // 0x210(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SavedAudioMusicVolume;                             // 0x214(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SavedAudioSFXVolume;                               // 0x218(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SavedAudioAmbienceVolume;                          // 0x21C(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SavedAudioSpeechVolume;                            // 0x220(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C7F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                SavedLanguage;                                     // 0x228(0x10)(ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          SavedVOLanguage;                                   // 0x238(0x8)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SavedTutorialsEnabled;                             // 0x240(0x1)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SavedPassiveEscape;                                // 0x241(0x1)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C80[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnCloudOptionsSaveData* GetDefaultObj();

	void SetVOLanguage(const struct FGameplayTag& VoLanguage, class UObject* WorldContextObject);
	void SetStickLookSpeed(float SpeedRatio);
	void SetStickAimSpeed(float SpeedRatio);
	void SetMouseLookSpeed(float SpeedRatio);
	void SetMouseAimSpeed(float SpeedRatio);
	void SetLanguage(const class FString& Language, class UObject* WorldContextObject);
	void SetGamepadGlyphStyle(enum class EQtnGamepadGlyphStyle GamepadGlyphStyle, class UObject* WorldContextObject);
	void SetFOVScaleRatio(float FOVScaleRatio, class UObject* WorldContextObject);
	void SetForceFeedback(bool ForceFeedback, class UObject* WorldContextObject);
	void SetAudioSpeechVolume(float Volume, class UObject* WorldContextObject);
	void SetAudioSFXVolume(float Volume, class UObject* WorldContextObject);
	void SetAudioMusicVolume(float Volume, class UObject* WorldContextObject);
	void SetAudioMasterVolume(float Volume, class UObject* WorldContextObject);
	void SetAudioAmbienceVolume(float Volume, class UObject* WorldContextObject);
	struct FGameplayTag GetVOLanguage(class UObject* WorldContextObject);
	float GetStickLookSpeedRatio();
	float GetStickAimSpeedRatio();
	float GetMouseLookSpeedRatio();
	float GetMouseAimSpeedRatio();
	class FString GetLanguage(class UObject* WorldContextObject);
	class UQtnInputDataBag* GetInputDataBag();
	enum class EQtnGamepadGlyphStyle GetGamepadGlyphStyle(class UObject* WorldContextObject);
	float GetFOVScaleRatio(class UObject* WorldContextObject);
