#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x330 (0x610 - 0x2E0)
// BlueprintGeneratedClass QtnGoal_MS_Act2_ReachEndOfStreet.QtnGoal_MS_Act2_ReachEndOfStreet_C
class UQtnGoal_MS_Act2_ReachEndOfStreet_C : public UGoalBase_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2E0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class ATravelVolume_BP_C*                    ExitGate;                                          // 0x2E8(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQtnGoal_MS_Act2_RepairCatapult_C*     CatapultGoal;                                      // 0x2F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  GoalDetail_Battle;                                 // 0x2F8(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         Inbattle;                                          // 0x310(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                        Pad_67FD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  GoalDetail_Default;                                // 0x318(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ASkirmishBase_C*                       StanSkirmish;                                      // 0x330(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStan_MainStreetActor_BP_C*            Stan;                                              // 0x338(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         FoundStan;                                         // 0x340(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_67FE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnStruct_VOLine                     VO_OnEntry;                                        // 0x348(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_67FF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FQtnStruct_VOLine>             VO_AxeThrowConversation;                           // 0x370(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ATargetLocationVolume_C*               CutsceneVolume;                                    // 0x380(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACinematicSceneArchetype_BP_C*         StanCutscene;                                      // 0x388(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  GoalDetail_AxeWarning;                             // 0x390(0x18)(Edit, BlueprintVisible)
	class FText                                  GoalTitle_GetToTheEnd;                             // 0x3A8(0x18)(Edit, BlueprintVisible)
	class FText                                  GoalTitle_Default;                                 // 0x3C0(0x18)(Edit, BlueprintVisible)
	bool                                         CutsceneComplete;                                  // 0x3D8(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                         CutsceneTriggered;                                 // 0x3D9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6800[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AMainStreetDamageVolume_BP_C*          MurderVolume;                                      // 0x3E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQtnStruct_VOLine>             VO_StanAxeTaunt;                                   // 0x3E8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         VO_playedCatapultTaunt;                            // 0x3F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6803[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABP_Catapult_C*>                Catapults;                                         // 0x400(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class FText                                  GoalDetail_Catapult;                               // 0x410(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ACartman_Actor_BP_Rep_C*               As_Cartman_Actor_BP;                               // 0x428(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AButters_Actor_BP_C*                   As_Butters_Actor_BP;                               // 0x430(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADougie_Actor_BP_C*                    As_Dougie_Actor_BP;                                // 0x438(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PlayerLanded;                                      // 0x440(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                        Pad_6804[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  GoalDetail_Roof;                                   // 0x448(0x18)(Edit, BlueprintVisible)
	class ABrokenCatapult_BP_C*                  brokenCatapult;                                    // 0x460(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UpgradeDone;                                       // 0x468(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                         SpokeDone;                                         // 0x469(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                        Pad_6805[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABodyPawnPlayer_C*>             ListOfUpgradedPlayers;                             // 0x470(0x10)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance, RepNotify, ContainsInstancedReference)
	TArray<class ABodyPawnPlayer_C*>             HoldingArray;                                      // 0x480(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	struct FQtnStruct_VOLine                     VO_OnLandedInCatapultZone;                         // 0x490(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6806[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnStruct_VOLine                     VO_DelayedCommentInFinalFight;                     // 0x4B8(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6807[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ALocationMarker_BP_C*>          DeadPlayerCheckPoints;                             // 0x4E0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                         PlayersTeleported;                                 // 0x4F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6808[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AQtnPlayerPawn*                        PlayerWhoTriggeredTeleport;                        // 0x4F8(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetLocationVolume_C*               FinalBattleTrigger;                                // 0x500(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AQtnPlayerPawn*>                PlayersInFinalBattle;                              // 0x508(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	bool                                         CheckingForDeadPlayersToTeleport;                  // 0x518(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6809[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ALocationMarker_BP_C*>          Used_DeadPlayerCheckPoints;                        // 0x520(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ALocationMarker_BP_C*                  CatapultQuestMarker;                               // 0x530(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQtnStruct_VOLine>             VO_PostAxeThrow;                                   // 0x538(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FQtnStruct_VOLine>             VO_JudgeIdles_A;                                   // 0x548(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FQtnStruct_VOLine>             VO_JudgeIdles_B;                                   // 0x558(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FQtnStruct_VOLine>             VO_JudgeIdles_C;                                   // 0x568(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                JudgeIdlesPlayed;                                  // 0x578(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         VO_PostAxeThrow_Played;                            // 0x588(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_680A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          VO_JudgeIdlesTimerHandle;                          // 0x590(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQtnStruct_VOLine>             VO_EndFinalRoofCombat;                             // 0x598(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FQtnStruct_VOLine>             VO_EndFinalRoofCombat_B;                           // 0x5A8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AGateLock_BP_C*                        Gatelock;                                          // 0x5B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  GoalDetail_UnlockedCatapult;                       // 0x5C0(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ALocationMarker_BP_C*                  CatapultQuestMarker_FirstRoof;                     // 0x5D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATargetLocationVolume_C*               ReachedRepairCatapultVolume;                       // 0x5E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQtnStruct_VOLine                     VO_OnDeath;                                        // 0x5E8(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_680B[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UQtnGoal_MS_Act2_ReachEndOfStreet_C* GetDefaultObj();

	void VO_On_Death_Server_Only(enum class EQtnGoalStatus CallFunc_GetGoalStatus_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_IsServer_ReturnValue);
