#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x420 (0x968 - 0x548)
// BlueprintGeneratedClass QtnGoal_DT_Act3_FOS_Magazine.QtnGoal_DT_Act3_FOS_Magazine_C
class UQtnGoal_DT_Act3_FOS_Magazine_C : public UQtnGoal_DT_Arc3_FOSParent_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x548(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class AMagazine_BP_C*                        Magazines;                                         // 0x550(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         MagazinesGrabbed;                                  // 0x558(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                         InFinalEncounter;                                  // 0x559(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                        Pad_6006[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ASkirmishDoor_MainStreetDumpExit_C*    SkirmishDoor;                                      // 0x560(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Timer;                                             // 0x568(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6007[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnStruct_VOLine                     VO_OnFleeReminder;                                 // 0x570(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6008[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FQtnStruct_VOLine>             VO_OnMagazineGrab;                                 // 0x598(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FQtnStruct_VOLine>             VO_OnEndFight_Butters;                             // 0x5A8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FQtnStruct_VOLine>             VO_OnEndFight_Cartman;                             // 0x5B8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         PlayersEnteredDump;                                // 0x5C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6009[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        EndFightVOIndex;                                   // 0x5CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQtnStruct_VOLine                     VO_OnExit;                                         // 0x5D0(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_600A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ADeathPlow_Dump_BP_C*                  As_Death_Plow_Dump_BP;                             // 0x5F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ADumpGenerator_BP_C*>           DumpGenerators;                                    // 0x600(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                        GeneratorsRequired;                                // 0x610(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	int32                                        GeneratorsFrobbed;                                 // 0x614(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class FText                                  GeneratorsDetail;                                  // 0x618(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ACine_MS_DumpCrane_C*                  CraneCutscene;                                     // 0x630(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         StartedInDebugMode;                                // 0x638(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_600B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                DEBUGONLY_DebugLocations;                          // 0x640(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ALocationMarker_BP_C*                  DEBUGONLY_TesterTeleport;                          // 0x650(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASkirmishBase_C*                       FinalEncounterSkirmish;                            // 0x658(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQtnStruct_VOLine>             OnDumpEntryUrge;                                   // 0x660(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FQtnStruct_VOLine                     VO_OnCraneDrop_Butters;                            // 0x670(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_600C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnStruct_VOLine                     VO_OnCraneDrop;                                    // 0x698(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_600D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  GoalDetail_Run;                                    // 0x6C0(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  GoalDetail_Slash;                                  // 0x6D8(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ALocationMarker_BP_C*                  EndGateQuestMarker;                                // 0x6F0(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADumpTrackingVolume_C*                 PlayerTrackingVolume;                              // 0x6F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACine_MS_DumpStart_C*                  StartTruckCutscene;                                // 0x700(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         VO_CraneDropped;                                   // 0x708(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                        Pad_600E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        VO_TruckDangerDistance;                            // 0x70C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQtnStruct_VOLine                     VO_OnPlowTooClose;                                 // 0x710(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_600F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          VO_CheckPlowDistanceTimerHandle;                   // 0x738(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FQtnStruct_VOLine                     VO_TruckJeers;                                     // 0x740(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6010[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         VO_ImportantVOIsPlaying;                           // 0x768(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         VO_LootReactionAvailable;                          // 0x769(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6011[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnStruct_VOLine                     VO_LootReaction;                                   // 0x770(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6012[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          VO_TruckJeerTimerHandle;                           // 0x798(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FQtnStruct_VOLine                     VO_GeneratorExplain;                               // 0x7A0(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6013[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnStruct_VOLine                     VO_GeneratorReminder;                              // 0x7C8(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6014[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnStruct_VOLine                     VO_SixthGraderCharge;                              // 0x7F0(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6015[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  GoalDetail_WaitPortopotty;                         // 0x818(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ADumpBacktrackBlocker_BP_C*            As_Dump_Backtrack_Blocker_BP;                      // 0x830(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQtnEventWindow                       VO_LootEventWindow_ServerOnly;                     // 0x838(0x58)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class ATargetLocationVolume_C*, class AGateLock_BP_C*> DoorVolumeToGateMap;                               // 0x890(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<struct FQtnStruct_VOLine>             VO_OnFirstGenerator;                               // 0x8E0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         VO_CutsceneStarted;                                // 0x8F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6016[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnStruct_VOLine                     VO_OnEntryLoreUndercut;                            // 0x8F8(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6017[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQtnStruct_VOLine                     VO_PlowInFinalArea_Reminder;                       // 0x920(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6018[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         VO_TruckStopVOPlayed;                              // 0x948(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6019[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ATargetLocationVolume_C*               PlowAccelerationVolume;                            // 0x950(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AQtnPlayerPawn*>                PlayersInFinalZone;                                // 0x958(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)

	static class UClass* StaticClass();
	static class UQtnGoal_DT_Act3_FOS_Magazine_C* GetDefaultObj();

	void AreAllPlayersInFinalZone_ServerOnly(bool* All_Players_In_Final_Zone, bool LOCAL_FoundOutlier, bool Temp_bool_True_if_break_was_hit_Variable, int32 Temp_int_Array_Index_Variable, bool CallFunc_Not_PreBool_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Not_PreBool_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class AQtnPlayerPawn*>& CallFunc_GetAllPlayerPawns_foundPlayerPawns, class AQtnPlayerPawn* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
