#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x2C (0x2C - 0x0)
// UserDefinedStruct QtnReplicatedSaveData.QtnReplicatedSaveData
struct FQtnReplicatedSaveData
{
public:
	bool                                         HasBeenReplicated_4_D88BFA344692072ED124DBBDAFAAF8D2; // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         SocialHub_HasSeenAct1Scene_6_A6580414456A96A6D50A4DA01DB79061; // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         SocialHub_HasSeenAct2Scene_7_DC1132204304F40EB4A5BDA12F8E97C2; // 0x2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         SocialHub_HasSeenAct3Scene_9_1B4D3B9147EBCD50FD2797A74E996B82; // 0x3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         SocialHub_VisitedHub_12_1062D98C40668D53322047BA97B88B5A; // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Starks_HasSeenFirstTrial_13_2EFEF6EF4A7DE20AD5B7E2903349BF5D; // 0x5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Starks_HasSeenFirstRulebook_18_8DC541DB4CA65341A52D9582F4901B40; // 0x6(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Starks_HasSeenFirstFoilpack_19_303E0D144CF7A41DCAAA26BC55104F43; // 0x7(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Starks_HasSeenStarksWaterfall_20_81B5CA714A7794E74E25179DE950A124; // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Wartable_HeardArc2Unlock_21_FE966F784F0CDE7FAC875C92416267AF; // 0x9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Wartable_HeardArc3Unlock_24_4A670880407D37803AF8378CEF0FCE81; // 0xA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Wartable_HeardArc4Unlock_25_89C4AEFD4E4ED6C2958BCCA76ECEA232; // 0xB(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                        NumFailedRuns_28_EF99826A423B270612599CBB08590290; // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Starks_HasSeenFirstJoker_31_C1521DF44031F1E5A9AE5C86E624E541; // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         HadInMissionFitcoinFTUX_33_6FF592E24FE5B0A41CFCB3B07EB734DB; // 0x11(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         HasDMPTraining_35_8AF3E80F49ED97E00E72BCAE165DD217; // 0x12(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         HasRevivalFTUX_37_60E361DB4D804EEFAABEA19132886A2D; // 0x13(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         HasBeingRevivedFTUX_39_935EFC8343D6C4F91FEFDCB83CF3A9AD; // 0x14(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Wartable_HeardArc5Unlock_41_DE38E1DD42E660C59AFFB0BC6706EDCE; // 0x15(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Starks_HasMetRandy_43_ABC09919492C644D0D8A6AA1AB7FEA00; // 0x16(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Starks_HasBattledKyle_45_4FA664A04BC10724EF90E1B17E866B63; // 0x17(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         HasPPTutorialComplete_47_C4008B9F45A12236C4D40CA4D24D659E; // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         HasSeenGateLockFTUX_49_B721219647320AD53CEA77A64E68A4F8; // 0x19(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         HasSeenBinder_51_1F85C09D4C51E9043227D2863462F047; // 0x1A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2F52[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxUnlockedArc_54_5A5F23CF464E5BA3B6F18FB9627DD115; // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HasSeenEnemyBS_Vampire_56_349D839A4094780BA35923A9610F658D; // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         HasSeenEnemyBS_LaserSword_64_B3D687814F176FB74CD38BA71506C83E; // 0x21(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         HasSeenEnemyBS_SuperSize_65_F4F066934CF99ED7083358868A4E52D9; // 0x22(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         HasSeenEnemyBS_Nerfed_66_FEA4D8B845DA8E83D7C008A54D55C009; // 0x23(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         HasSeenEnemyBS_DoOver_67_B0CED3ED44EADCA1453D0EBB1DF70012; // 0x24(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         HasSeenEnemyBS_StupidProjectiles_68_97B8713244ED08FDE16AAC8699D8C0C3; // 0x25(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         HasSeenEnemyBS_ProjectileKids_69_2794E0AE44BCA048DEB45CBB369A4419; // 0x26(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         HasSeenEnemyBS_ProjectileHailstorm_70_33EDAE9349B92A9CAA5A508DF5C31ED1; // 0x27(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                        HasHordeModeDLC_76_F306C84747415BA74062D0A6363CAEEC; // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


