#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x9 (0x9 - 0x0)
// UserDefinedStruct QtnStruct_MissionSpawnConfig.QtnStruct_MissionSpawnConfig
struct FQtnStruct_MissionSpawnConfig
{
public:
	bool                                         Active_1_94D471CB4076BB396DAA5398764B193E;         // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class EQtnEnemyType                     InitialGroupA_19_97803419464B88048D64258B1633397A; // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EQtnEnemyType                     InitialGroupB_25_3EA74610425405BDFEB5929846835D60; // 0x2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EQtnEnemyType                     Wave1_31_5408AB9F45B4702496EBE0976787C9C5;         // 0x3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EQtnEnemyType                     Wave2_32_4E3095E24E455B8E2C20B3A2F1E2A7BC;         // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EQtnEnemyType                     Wave3_33_1D02472241EE736BC33789A9047EE8CA;         // 0x5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EQtnEnemyType                     Wave4_34_2AAFAAB047860B336BD444B9385C344B;         // 0x6(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EQtnEnemyType                     Wave5_35_D9E7FA6F417BD719E22C7686FC03F845;         // 0x7(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EQtnEnemyType                     Wave6_37_CE4D4EE0425E1EA6B0DD97AA11345DBC;         // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


