#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1D9 (0x471 - 0x298)
// WidgetBlueprintGeneratedClass SystemMenuWidget.SystemMenuWidget_C
class USystemMenuWidget_C : public UQtnUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x298(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      SystemMenuStartup;                                 // 0x2A0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                               Border_Container;                                  // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CapsuleBtn_Widget_C*               Btn_Credits;                                       // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CapsuleBtn_Widget_C*               Btn_GoToHub;                                       // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CapsuleBtn_Widget_C*               Btn_MainMenu;                                      // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CapsuleBtn_Widget_C*               Btn_Options;                                       // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CapsuleBtn_Widget_C*               Btn_Quit;                                          // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CapsuleBtn_Widget_C*               Btn_Remap;                                         // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBtnClose_Widget_C*                    Button_Close;                                      // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCurrencyWallet_Widget_C*              CurrencyWallet_Widget;                             // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Text_BuildVersionNumber;                           // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Text_Header;                                       // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TextBlock_PauseStatus;                             // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          Vbox_MenuButtons;                                  // 0x308(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                  Text_Label_Build;                                  // 0x310(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  TEXT_Matchmaking;                                  // 0x328(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  TEXT_Controls;                                     // 0x340(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  TEXT_Options;                                      // 0x358(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  TEXT_QuitToDesktop;                                // 0x370(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  TEXT_QuitToMenu;                                   // 0x388(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  TEXT_Close;                                        // 0x3A0(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  TEXT_CloseGamepad;                                 // 0x3B8(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UOptionsMenuButtonWidget_C*            CurrentSelection;                                  // 0x3D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CurIndexSelection;                                 // 0x3D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_70BE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  TEXT_QuittingGame;                                 // 0x3E0(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  TEXT_AreYouSure;                                   // 0x3F8(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  TEXT_Credits;                                      // 0x410(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         ShowSessionQUit;                                   // 0x428(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_70BF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  TEXT_Loadout;                                      // 0x430(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FQtnStruct_VOLine                     VO_FTUX_EarlyExit;                                 // 0x448(0x25)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_70C0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         IsLeavingFTUX;                                     // 0x470(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class USystemMenuWidget_C* GetDefaultObj();

	void ToggleTutorialInhibitors(bool WantInhibited, bool LOCAL_WantInhibited, class UObject* Temp_object_Variable, class UObject* Temp_object_Variable_1, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue, class UUI_FTUX_TrainingMoment_Screen_C* CallFunc_GetScreen_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UUI_FTUX_Archetype_Widget_C* CallFunc_GetUserWidget_ReturnValue, bool CallFunc_IsValid_ReturnValue_1);
	class UMessagingHUD_C* GetMessagingHUD(class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue, class UMessagingHUDScreen_C* CallFunc_GetScreen_ReturnValue, class UMessagingHUD_C* CallFunc_GetUserWidget_ReturnValue);
	void RefreshPauseStatus(bool Paused, class FText Temp_text_Variable, class FText Temp_text_Variable_1, bool Temp_bool_Variable, class FText K2Node_Select_Default);
	void FTUXEarlyExit(bool* Left_early, class UQtnGoalManager* CallFunc_GetGoalManager_ReturnValue, class UQtnGoalManager_FTUX_C* K2Node_DynamicCast_AsQtn_Goal_Manager_FTUX, bool K2Node_DynamicCast_bSuccess, const class FString& CallFunc_GetCurrentLevelName_ReturnValue, class AQtnBodyPawn* CallFunc_GetLocalPlayerInformation_occupiedBodyPawn, class AQtnPlayerPawn* CallFunc_GetLocalPlayerInformation_playerPawn, class AQtnPlayerController* CallFunc_GetLocalPlayerInformation_playerController, class AQtnPlayerUI* CallFunc_GetLocalPlayerInformation_playerUI, class AQtnPlayerState* CallFunc_GetLocalPlayerInformation_qtnPlayerState, bool CallFunc_GetLocalPlayerInformation_isHosting, enum class EQtnOutputValidityEnum CallFunc_GetLocalPlayerInformation_outputPin, bool CallFunc_EqualEqual_StrStr_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UQtnLocalOptionsSaveData* CallFunc_GetSaveLoadDataBP_localOptionsSaveData, class UQtnCloudOptionsSaveData* CallFunc_GetSaveLoadDataBP_cloudOptionsSaveData, class UQtnProgressSaveData* CallFunc_GetSaveLoadDataBP_progressSaveData, enum class EQtnOutputValidityEnum CallFunc_GetSaveLoadDataBP_outputPin, class UFTUXDataBag_C* CallFunc_GetCustomDataBag_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1);
	void QuitToDesktopConfirm(bool YesQuit);
	void CheckNavIndex(int32 Index, class UOptionsMenuButtonWidget_C** SelectedButton, class UWidget* CallFunc_GetChildAt_ReturnValue, class UOptionsMenuButtonWidget_C* K2Node_DynamicCast_AsOptions_Menu_Button_Widget, bool K2Node_DynamicCast_bSuccess, enum class ESlateVisibility CallFunc_GetVisibility_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	void ButtonNavigation(bool Up, int32 Increment, int32 IndexToCheck, int32 CallFunc_GetChildrenCount_ReturnValue, class UOptionsMenuButtonWidget_C* CallFunc_CheckNavIndex_SelectedButton, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_GetChildrenCount_ReturnValue_1, bool CallFunc_GreaterEqual_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);
	void InitButtons(const class FString& TEXT_FourFingerDebugMenu, bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, enum class EQtnPlatform Temp_byte_Variable_2, enum class ESlateVisibility Temp_byte_Variable_3, enum class ESlateVisibility Temp_byte_Variable_4, enum class ESlateVisibility Temp_byte_Variable_5, enum class ESlateVisibility Temp_byte_Variable_6, enum class ESlateVisibility Temp_byte_Variable_7, enum class EQtnPlatform Temp_byte_Variable_8, bool Temp_bool_Variable_1, bool Temp_bool_Variable_2, bool Temp_bool_Variable_3, bool Temp_bool_Variable_4, bool Temp_bool_Variable_5, bool Temp_bool_Variable_6, enum class EQtnOutputYesNoEnum CallFunc_IsThisMapAMissionWorldBP_outputPin, bool K2Node_SwitchEnum_CmpSuccess, enum class EQtnSessionState CallFunc_QtnGetSessionState_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, bool CallFunc_IsShippingBuild_ReturnValue, enum class EQtnPlatform CallFunc_GetPlatform_ReturnValue, enum class ESlateVisibility K2Node_Select_Default, bool K2Node_Select_Default_1, enum class EQtnOutputYesNoEnum CallFunc_DoesThisMapSpawnBodiesBP_outputPin, bool K2Node_SwitchEnum_CmpSuccess_2, enum class EQtnOutputYesNoEnum CallFunc_IsThisMapAMissionWorldBP_outputPin_1, bool K2Node_SwitchEnum_CmpSuccess_3, enum class EQtnPlatform CallFunc_GetPlatform_ReturnValue_1, enum class ESlateVisibility K2Node_Select_Default_2);
	void ActiveButtonConfirmed(bool CallFunc_IsValid_ReturnValue);
	void SystemMenuWidgetStartup(class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void OnFailure_63490CC74114D467DF2E2C94D45CCA1D(enum class EQtnDisbandPartyResult Result);
	void OnSuccess_63490CC74114D467DF2E2C94D45CCA1D(enum class EQtnDisbandPartyResult Result);
	void OnFailure_63490CC74114D467DF2E2C947B6D04EF(enum class EQtnDisbandPartyResult Result);
	void OnSuccess_63490CC74114D467DF2E2C947B6D04EF(enum class EQtnDisbandPartyResult Result);
	void OnFailure_63490CC74114D467DF2E2C94ACDA58E7(enum class EQtnDisbandPartyResult Result);
	void OnSuccess_63490CC74114D467DF2E2C94ACDA58E7(enum class EQtnDisbandPartyResult Result);
	void OnUIScreenActionPressed(enum class EQtnUIScreenActionEnum ScreenAction);
	void CloseThisMenu();
	void CallOptions();
	void CallQuitToDesktop();
	void CallQuitToMenu();
	void OnQtnWidgetResumed(class UQtnScreen* PreviousScreen);
	void RefreshButtons();
	void Event_ConfirmQuitSession(bool Accepted);
	void SetSelection(class UOptionsMenuButtonWidget_C* Button);
	void DisconnectConfirmEvent(bool Accepted);
	void CallRemapButtons();
	void CallCredits();
	void BndEvt__SystemMenuWidget_Btn_Options_K2Node_ComponentBoundEvent_1_ButtonClicked__DelegateSignature();
	void BndEvt__SystemMenuWidget_Btn_Quit_K2Node_ComponentBoundEvent_3_ButtonClicked__DelegateSignature();
	void BndEvt__SystemMenuWidget_Btn_Remap_K2Node_ComponentBoundEvent_4_ButtonClicked__DelegateSignature();
	void BndEvt__SystemMenuWidget_Btn_GoToHub_K2Node_ComponentBoundEvent_5_ButtonClicked__DelegateSignature();
	void BndEvt__SystemMenuWidget_Btn_Credits_K2Node_ComponentBoundEvent_6_ButtonClicked__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__SystemMenuWidget_Btn_MainMenu_K2Node_ComponentBoundEvent_7_ButtonClicked__DelegateSignature();
	void BndEvt__SystemMenuWidget_Button_Close_K2Node_ComponentBoundEvent_0_ButtonClicked__DelegateSignature();
	void LeaveFTUXEarly();
	void ReturnToHubParty(bool Accepted);
	void OnQtnWidgetInitialized();
	void SimPauseEvent_Event_0(bool Paused);
	void OnQtnWidgetStarted();
	void OnQtnWidgetStopped();
	void OnInputUsageChange(bool IsUsingMouseAndKeyboard);
	void ExecuteUbergraph_SystemMenuWidget(int32 EntryPoint, enum class EQtnOutputYesNoEnum CallFunc_IsThisMapForHordeMode_outputPin, bool K2Node_SwitchEnum_CmpSuccess, const struct FQtnEventMessage& CallFunc_StaticMakeEventMessage_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const struct FQtnEventMessage& CallFunc_StaticMakeEventMessage_ReturnValue_1, enum class EQtnDisbandPartyResult K2Node_CustomEvent_Result_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, enum class EQtnDisbandPartyResult K2Node_CustomEvent_Result, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, enum class EQtnDisbandPartyResult Temp_byte_Variable, class UQtnDisbandParty* CallFunc_QtnDisbandParty_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FQtnEventMessage& CallFunc_StaticMakeEventMessage_ReturnValue_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, const struct FQtnEventMessage& CallFunc_StaticMakeEventMessage_ReturnValue_3, class UObject* Temp_object_Variable, class UObject* Temp_object_Variable_1, class UObject* Temp_object_Variable_2, class UObject* Temp_object_Variable_3, class AGameModeBase* CallFunc_GetGameMode_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UQtnDisbandParty* CallFunc_QtnDisbandParty_ReturnValue_1, enum class EQtnDisbandPartyResult Temp_byte_Variable_1, bool CallFunc_IsValid_ReturnValue_2, class UQtnDisbandParty* CallFunc_QtnDisbandParty_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, class FName CallFunc_MakeLiteralName_ReturnValue, enum class EQtnDisbandPartyResult Temp_byte_Variable_2, enum class EQtnDisbandPartyResult K2Node_CustomEvent_Result_4, class AGameModeBase* CallFunc_GetGameMode_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_4, enum class EQtnUIScreenActionEnum K2Node_Event_screenAction, bool K2Node_SwitchEnum_CmpSuccess_1, class UAudioComponent* CallFunc_SpawnSound2D_ReturnValue, class UQtnScreen* CallFunc_GetOwningScreen_ReturnValue, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue_1, class UCombinedOptionsMenuScreen_C* CallFunc_RegisterScreen_ReturnValue, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue_2, class AQtnPlayerUIArchetype_C* K2Node_DynamicCast_AsQtn_Player_UIArchetype, bool K2Node_DynamicCast_bSuccess, class UQtnScreen* K2Node_Event_previousScreen, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, class FName CallFunc_MakeLiteralName_ReturnValue_1, enum class EQtnDisbandPartyResult K2Node_CustomEvent_Result_2, const class FString& CallFunc_GetBuildLabel_ReturnValue, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue_3, const class FString& CallFunc_Conv_TextToString_ReturnValue, class UUserWidget* CallFunc_QueueModalDialog_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, bool K2Node_CustomEvent_accepted_2, class FText CallFunc_Conv_StringToText_ReturnValue, class UOptionsMenuButtonWidget_C* K2Node_CustomEvent_Button, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, bool CallFunc_IsValid_ReturnValue_5, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, bool CallFunc_MapAffectsPlayerProgress_ReturnValue, class UUserWidget* CallFunc_QueueModalDialog_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, enum class EQtnDisbandPartyResult K2Node_CustomEvent_Result_3, enum class EQtnDisbandPartyResult K2Node_CustomEvent_Result_5, bool CallFunc_IsServer_ReturnValue, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue_4, bool K2Node_CustomEvent_accepted_1, class UUserWidget* CallFunc_QueueModalDialog_ReturnValue_2, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue_5, class UControlRemappingScreen_C* CallFunc_RegisterScreen_ReturnValue_1, class UQtnGlobalRunProgress* CallFunc_GetGlobalRunProgress_ServerOnly_ReturnValue, class FName CallFunc_MakeLiteralName_ReturnValue_2, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue_6, class UCreditsScreen_C* CallFunc_RegisterScreen_ReturnValue_2, bool K2Node_Event_IsDesignTime, class AGameModeBase* CallFunc_GetGameMode_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_6, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_9, bool CallFunc_FTUXEarlyExit_left_early, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_10, class UQtnGlobalRunProgress* CallFunc_GetGlobalRunProgress_ServerOnly_ReturnValue_1, class FName CallFunc_MakeLiteralName_ReturnValue_3, bool CallFunc_DoesPartySessionExist_ReturnValue, bool CallFunc_DoesPartySessionExist_ReturnValue_1, enum class EQtnOutputYesNoEnum CallFunc_IsThisMapAMissionWorldBP_outputPin, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue_7, bool K2Node_SwitchEnum_CmpSuccess_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_11, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue_8, class UUserWidget* CallFunc_QueueModalDialog_ReturnValue_3, class UUserWidget* CallFunc_QueueModalDialog_ReturnValue_4, class UUserWidget* CallFunc_QueueModalDialog_ReturnValue_5, bool K2Node_CustomEvent_accepted, class FName CallFunc_MakeLiteralName_ReturnValue_4, class AQtnGameState* CallFunc_GetQtnGameState_ReturnValue, bool K2Node_CustomEvent_paused, class AQtnGameState* CallFunc_GetQtnGameState_ReturnValue_1, class UQtnGlobalRunProgress* CallFunc_GetGlobalRunProgress_ServerOnly_ReturnValue_2, bool CallFunc_IsSimPaused_ReturnValue, class UGlobalRunProgress_C* K2Node_DynamicCast_AsGlobal_Run_Progress, bool K2Node_DynamicCast_bSuccess_1, const struct FQtnEventMessage& CallFunc_StaticMakeEventMessage_ReturnValue_4, enum class EQtnPlatform CallFunc_GetPlatform_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_3, class UMessagingHUD_C* CallFunc_GetMessagingHUD_ReturnValue, class UMessagingHUD_C* CallFunc_GetMessagingHUD_ReturnValue_1, bool K2Node_Event_isUsingMouseAndKeyboard, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue_9, class AQtnPlayerUIArchetype_C* K2Node_DynamicCast_AsQtn_Player_UIArchetype_1, bool K2Node_DynamicCast_bSuccess_2, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue_10, class AQtnPlayerUIArchetype_C* K2Node_DynamicCast_AsQtn_Player_UIArchetype_2, bool K2Node_DynamicCast_bSuccess_3, enum class EQtnOutputYesNoEnum CallFunc_IsThisMapAMissionWorldBP_outputPin_1, bool K2Node_SwitchEnum_CmpSuccess_4, enum class EQtnOutputYesNoEnum CallFunc_IsThisMapAMissionWorldBP_outputPin_2, bool K2Node_SwitchEnum_CmpSuccess_5, bool CallFunc_IsShippingBuild_ReturnValue, enum class EQtnPlatform CallFunc_GetPlatform_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_6, enum class EQtnOutputYesNoEnum CallFunc_DoesThisMapSpawnBodiesBP_outputPin, bool K2Node_SwitchEnum_CmpSuccess_7, class AQtnPlayerUI* CallFunc_GetOwningPlayerUI_ReturnValue_11, class UUI_FTUX_TrainingMoment_Screen_C* CallFunc_GetScreen_ReturnValue, class UUI_FTUX_Archetype_Widget_C* CallFunc_GetUserWidget_ReturnValue, bool CallFunc_IsValid_ReturnValue_7);
};

}


