#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x12B (0xBD4 - 0xAA9)
// BlueprintGeneratedClass Verb_Bow_Sniper.Verb_Bow_Sniper_C
class UVerb_Bow_Sniper_C : public UVerb_Bow_ShootArchetype_C
{
public:
	uint8                                        Pad_6234[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xAB0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                         ZoomCamera;                                        // 0xAB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6235[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  Arrow;                                             // 0xAC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABow_C*                                As_Bow;                                            // 0xAC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         Upgrade_Ricochet;                                  // 0xAD0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6236[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Ricochet_MaxCount;                                 // 0xAD4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Ricochet_BaseDamage;                               // 0xAD8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6237[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                BowAimHelper_LocalOnly;                            // 0xAE0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                BowAimHelperClass;                                 // 0xAE8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                            MuzzleHit;                                         // 0xAF0(0x88)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                         Upgrade_Multishot;                                 // 0xB78(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6238[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Multishot_DamageReduction;                         // 0xB7C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Upgrade_ElvenEyes;                                 // 0xB80(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6239[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Upgrade_ElvenEyes_BonusDamageScalar;               // 0xB84(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ElvenEyes_KnockdownSeconds;                        // 0xB88(0x4)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ElvenEyes_DistanceThreshold;                       // 0xB8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Upgrade_GrossOutShot;                              // 0xB90(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_623A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GrossOutShot_Diameter;                             // 0xB94(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        GrossOutShot_Duration;                             // 0xB98(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MinimumChargeRatio;                                // 0xB9C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Upgrade_FollowUpStrike;                            // 0xBA0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_623B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FollowUp_LastHitTime;                              // 0xBA4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        FollowUp_ExplosionRadius;                          // 0xBA8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        FollowUp_ExplosionDamage;                          // 0xBAC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        FollowUp_RequiredHitTime;                          // 0xBB0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_623C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                Upgrade_FollowUpStrike_Last_Hit_Actor;             // 0xBB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQtnDangerVolume*                      DangerCapsuleForAllies_ServerOnly;                 // 0xBC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQtnRangedFloat                       DangerCapsuleRadii;                                // 0xBC8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                        DangerCapsuleLength;                               // 0xBD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UVerb_Bow_Sniper_C* GetDefaultObj();

	void ProcessFollowUpStrike(class AActor* Hit_Actor, class AActor* Hit_Actor_To_Process, int32 Temp_int_Array_Index_Variable, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, float CallFunc_GetQtnTimeSeconds_ReturnValue, bool CallFunc_IsValid_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue_1, TArray<class AActor*>& CallFunc_GatherActorsWithinRadius_otherActors, const struct FQtnDamageInfo& K2Node_MakeStruct_QtnDamageInfo, class AActor* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void GetDangerCapsuleEnds_ServerOnly(struct FVector* Start, struct FVector* End, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class AQtnPawn* CallFunc_GetOwningPawn_ReturnValue, const struct FQtnPawnIntentions& CallFunc_GetIntentions_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FVector& CallFunc_GetForwardVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue);
	void Init_UpgradesOnSpawnedProjectile(class UObject* SpawnedProjectile, class AProjectile_ArrowBase_C* LOCAL_SpawnedArrow, class AProjectile_ArrowBase_C* K2Node_DynamicCast_AsProjectile_Arrow_Base, bool K2Node_DynamicCast_bSuccess, class AProjectile_Arrow_Bonus_C* K2Node_DynamicCast_AsProjectile_Arrow_Bonus, bool K2Node_DynamicCast_bSuccess_1, float CallFunc_Multiply_FloatFloat_ReturnValue, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UPerk_Deadeye_C* CallFunc_FindPerk_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, float CallFunc_GetValueOfPerk_ReturnValue);
	void Was_Fully_Charged(bool* IsFullyHeld, bool CallFunc_Was_Fully_Charged_IsFullyHeld);
	void ServerOnly_Upgrade_ElvenEyes(class UObject* DamagedActor, bool IsServer, struct FQtnDamageInfo& QtnDamageInfo, class AQtnPawn* CallFunc_GetOwningPawn_ReturnValue, class AQtnBodyPawn* K2Node_DynamicCast_AsQtn_Body_Pawn, bool K2Node_DynamicCast_bSuccess, class UQtnDamageReceptorComponent* CallFunc_GetDamageReceptor_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class UStatusEffect_ElvenEyesKnockdown_C* CallFunc_AddStatusEffect_ServerOnly_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1);
	void PresentChargedShotFillRatio(float ActualChargeRatio, float PresentedChargeRatio, bool Temp_bool_Variable, float Temp_float_Variable, float Temp_float_Variable_1, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue_1, bool CallFunc_Greater_FloatFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue, class AQtnPawn* CallFunc_GetOwningPawn_ReturnValue, float CallFunc_GetTotalHoldTime_OutHoldTimeSeconds, float K2Node_Select_Default, float CallFunc_Divide_FloatFloat_ReturnValue_1);
	void TickAimArc(bool Temp_bool_Variable, float Temp_float_Variable, bool CallFunc_Greater_FloatFloat_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const struct FVector& CallFunc_GetWorldGravity_ReturnValue, float K2Node_Select_Default);
	void ResetHeldTime();
	void HandleFullChargeReached(class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue);
	void CheckMuzzleAimAgainstCamera(bool* OutDrawHelper, struct FVector* OutHelperLocation, struct FVector* OutHelperHitNormal, const struct FVector& HelperHitNormal, const struct FVector& HelperLocation, bool DrawHelper, const TArray<struct FHitResult>& CameraHits, const TArray<struct FHitResult>& MuzzleHits, int32 CallFunc_Array_Length_ReturnValue, const struct FHitResult& CallFunc_Array_Get_Item, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue_1, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, class AQtnPawn* K2Node_DynamicCast_AsQtn_Pawn, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Get_Projectile_Aim_muzzleInsideWall, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, TArray<struct FHitResult>& CallFunc_SphereTrace_hits, bool CallFunc_SphereTrace_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit_1, bool CallFunc_BreakHitResult_bInitialOverlap_1, float CallFunc_BreakHitResult_Time_1, float CallFunc_BreakHitResult_Distance_1, const struct FVector& CallFunc_BreakHitResult_Location_1, const struct FVector& CallFunc_BreakHitResult_ImpactPoint_1, const struct FVector& CallFunc_BreakHitResult_Normal_1, const struct FVector& CallFunc_BreakHitResult_ImpactNormal_1, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_1, class AActor* CallFunc_BreakHitResult_HitActor_1, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_1, class FName CallFunc_BreakHitResult_HitBoneName_1, int32 CallFunc_BreakHitResult_HitItem_1, int32 CallFunc_BreakHitResult_ElementIndex_1, int32 CallFunc_BreakHitResult_FaceIndex_1, const struct FVector& CallFunc_BreakHitResult_TraceStart_1, const struct FVector& CallFunc_BreakHitResult_TraceEnd_1, bool CallFunc_LessEqual_FloatFloat_ReturnValue, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue, class UQtnCameraComponent* CallFunc_GetQtnCameraComponent_ReturnValue, const struct FVector& CallFunc_GetForwardVector_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, TArray<struct FHitResult>& CallFunc_SphereTrace_hits_1, bool CallFunc_SphereTrace_ReturnValue_1);
	void GetMuzzleComponent(class USceneComponent** OutMuzzleComponent, class USceneComponent* CallFunc_GetMuzzleComponent_OutMuzzleComponent, class AQtnItem* CallFunc_GetOwningItem_ReturnValue, class ABow_C* K2Node_DynamicCast_AsBow, bool K2Node_DynamicCast_bSuccess);
	void Get_Projectile_Aim(bool* MuzzleInsideWall, class AQtnPawn* CallFunc_GetOwningPawn_ReturnValue, float CallFunc_GetSpeeds_MinimumSpeed, float CallFunc_GetSpeeds_MaximumSpeed, float CallFunc_GetTotalHoldTime_OutHoldTimeSeconds, class USceneComponent* CallFunc_GetMuzzleComponent_OutMuzzleComponent, float CallFunc_MapRangeClamped_ReturnValue, const struct FQtnCameraVerbAim& CallFunc_GetVerbLocalProjectileAim_ReturnValue, bool CallFunc_AdjustMuzzlePositionForWalls_wallDetected, const struct FVector& CallFunc_AdjustMuzzlePositionForWalls_ReturnValue);
	void OnVerbStop(enum class EQtnStopReason StopReason, bool IsServer);
	void OnMontageCompleted(class UAnimMontage* Montage, bool Interrupted);
	void OnVerbStart(class UObject* IntendedTarget, bool IsServer);
	void StartChargedShoot();
	void ResetChargedShoot();
	void OnAnimNotify(class UQtnAnimNotify* AnimNotify, bool IsServer);
	void OnActiveVerbTicked(struct FQtnPawnIntentions& PawnIntentions, float DeltaSeconds, float ElapsedTime, bool IsServer);
	void OnVerbProjectileHitTarget(class AActor* Target);
	void HandleOutgoingDamage(class AActor* DamagedActor, struct FQtnDamageInfo& DamageInfo, struct FQtnHitReactionInfo& HitReactionInfo, bool IsServer);
	void OnVerbInit(bool IsServer);
	void MULTI_FollowUpStrikeExplosion(class AActor* TargetActor, const struct FVector& LocationOverride);
	void OnProjectileSpawned(class AQtnProjectile* SpawnedProjectile, bool IsServer);
	void StartRepeatingShoot_1();
	void ResetRepeatingShoot_1();
	void ExecuteUbergraph_Verb_Bow_Sniper(int32 EntryPoint, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue, bool CallFunc_IsValidClass_ReturnValue, bool CallFunc_IsValid_ReturnValue, enum class EQtnStopReason K2Node_Event_stopReason, bool K2Node_Event_isServer_6, class UAnimMontage* K2Node_Event_montage, bool K2Node_Event_interrupted, class UObject* K2Node_Event_intendedTarget, bool K2Node_Event_isServer_5, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue_1, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue_2, class AQtnItem* CallFunc_GetActualEquippedItem_ReturnValue, class AQtnItem* CallFunc_GetActualEquippedItem_ReturnValue_1, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue_3, class AQtnItem* CallFunc_GetActualEquippedItem_ReturnValue_2, class UQtnAnimNotify* K2Node_Event_animNotify, bool K2Node_Event_isServer_4, class UAnimNotify_FireProjectile_C* K2Node_DynamicCast_AsAnim_Notify_Fire_Projectile, bool K2Node_DynamicCast_bSuccess, const struct FQtnPawnIntentions& K2Node_Event_pawnIntentions, float K2Node_Event_DeltaSeconds, float K2Node_Event_elapsedTime, bool K2Node_Event_isServer_3, bool CallFunc_CheckMuzzleAimAgainstCamera_OutDrawHelper, const struct FVector& CallFunc_CheckMuzzleAimAgainstCamera_OutHelperLocation, const struct FVector& CallFunc_CheckMuzzleAimAgainstCamera_OutHelperHitNormal, const struct FRotator& CallFunc_MakeRotFromX_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_2, const struct FTransform& CallFunc_GetTransform_ReturnValue, class AActor* CallFunc_SpawnNonReplicatedActor_ReturnValue, bool CallFunc_IsLocallyControlled_ReturnValue, const struct FHitResult& CallFunc_K2_SetActorLocationAndRotation_SweepHitResult, bool CallFunc_K2_SetActorLocationAndRotation_ReturnValue, class AActor* K2Node_Event_Target, bool CallFunc_IsValid_ReturnValue_3, class AActor* K2Node_Event_damagedActor, const struct FQtnDamageInfo& K2Node_Event_DamageInfo, const struct FQtnHitReactionInfo& K2Node_Event_hitReactionInfo, bool K2Node_Event_isServer_2, const struct FVector& CallFunc_GetWorldGravity_ReturnValue, class AQtnPawn* CallFunc_GetOwningPawn_ReturnValue, const struct FQtnPawnIntentions& CallFunc_GetIntentions_ReturnValue, bool K2Node_Event_isServer_1, bool CallFunc_IsModalHeld_IsModalHeld, class AQtnItem* CallFunc_GetOwningItem_ReturnValue, class ABow_C* K2Node_DynamicCast_AsBow, bool K2Node_DynamicCast_bSuccess_1, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue_5, class AActor* K2Node_CustomEvent_TargetActor, const struct FVector& K2Node_CustomEvent_LocationOverride, bool CallFunc_K2_AttachToComponent_ReturnValue, class AQtnFXActor* CallFunc_BP_BeginEffect_ReturnValue, class AQtnProjectile* K2Node_Event_spawnedProjectile, bool K2Node_Event_isServer, class AQtnPawn* CallFunc_GetOwningPawn_ReturnValue_1, const struct FQtnDangerParameters& K2Node_MakeStruct_QtnDangerParameters, bool CallFunc_IsValid_ReturnValue_4, class AQtnPawn* CallFunc_GetOwningPawn_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_5, const struct FVector& CallFunc_GetDangerCapsuleEnds_ServerOnly_start, const struct FVector& CallFunc_GetDangerCapsuleEnds_ServerOnly_end, const struct FVector& CallFunc_GetDangerCapsuleEnds_ServerOnly_start_1, const struct FVector& CallFunc_GetDangerCapsuleEnds_ServerOnly_end_1, class AQtnDangerVolume* CallFunc_SpawnDangerCapsule_ServerOnly_ReturnValue, class AQtnPawn* CallFunc_GetOwningPawn_ReturnValue_3, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue_6, const struct FQtnPawnIntentions& CallFunc_GetIntentions_ReturnValue_1, bool CallFunc_IsModalHeld_IsModalHeld_1, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue_7, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue_8, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue_9, class UQtnCameraComponent* CallFunc_GetQtnCameraComponent_ReturnValue, class UQtnCameraComponent* CallFunc_GetQtnCameraComponent_ReturnValue_1, class UQtnCameraBehavior* CallFunc_GetActiveCameraBehavior_ReturnValue, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue_10, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, class UBowModalCam_C* CallFunc_RequestCameraBehavior_ReturnValue, class AQtnBodyPawn* CallFunc_GetOwningBodyPawn_ReturnValue_11, class UQtnCameraComponent* CallFunc_GetQtnCameraComponent_ReturnValue_2, bool CallFunc_Greater_FloatFloat_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
};

}


